{
    "Name": "actuarialscience",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ACTSC127",
            "Name": "Introduction to Global Capital Markets and Financial Analytics",
            "Desc": "This course introduces financial markets and institutions, examining the role of finance in the global economy while introducing foundational principles of financial decision making. The course utilizes analytic and computational approaches to the topics, enabling students to develop data management and analysis competencies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CS 115 or CS 135; Accounting and Financial Management or Mathematics/Chartered Professional Accountancy students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CFM 101, AFM 121",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC221",
            "Name": "Introductory Financial Mathematics (Non-Specialist Level)",
            "Desc": "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions. Yield rates. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to Actuarial Science students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ACTSC 231; (For Mathematics students only - CIVE 292/392)",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ACTSC231",
            "Name": "Introductory Financial Mathematics",
            "Desc": "The theory of rates of interest and discount including the theoretical continuous case of forces of interest and discount. Annuities and sinking funds, including the continuous case. Practical and theoretical applications primarily to mortgages and bonds. Yield rates. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 137 or 147 and (STAT 220 with a grade of at least 70% or a corequisite of STAT 230 or 240); Level at least 2A; Not open to students who have received credit for ACTSC 232.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ACTSC 221",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ACTSC232",
            "Name": "Life Contingencies 1",
            "Desc": "The future lifetime random variable: probability and survival functions; force of mortality; complete and curtate expectation of life; Makeham and Gompertz mortality laws. Life tables: characteristics of population and insurance life tables;  selection; fractional age assumptions. Life insurance payments and annuity payments: present value random variables; expected present values; higher moments; actuarial notation. Annual, 1/mthly and continuous cases. Relationships between insurance and annuity functions. Premiums: expense loadings. Present value of future loss random variables and distribution, net and gross cases. Equivalence principle. Portfolio percentile principle. Extra risks. ",
            "Notes": "[Note: Students who have met the ELPE requirement must contact their ACTSC advisor. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: (At least 60% in ACTSC 231) and (STAT 230 or 240) and (at least 60% in MTHEL 131). Not open to students who received credit for ACTSC 331.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ACTSC291",
            "Name": "Global Capital Markets and Financial Analytics",
            "Desc": "This course offers an overview of global capital markets and asset valuation. Topics may include an overview of financial markets and instruments, time value of money, valuation of financial assets, and financial risk and portfolio management. The course utilizes an analytic and computational approach to the topics, enabling students to develop data management and analysis competencies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CFM 101 or AFM 127/ACTSC 127; Accounting and Financial Management, Computing and Financial Management, or Mathematics/Chartered Professional Accountancy students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 273, ACTSC 372, ECON 371",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC331",
            "Name": "Life Contingencies 2",
            "Desc": "Policy Values: Annual, 1/mthly, and continuous cases. Thiele's equation. Modified premium policy values. Multiple state models: applications in life contingencies; assumptions; Kolmogorov equations; premiums, policy values, multiple decrement models. Joint life models: valuation of insurance benefits on joint lives, dependent and independent cases. ",
            "Notes": "[Note: Some of the material covered in STAT 333 reinforces some of the concepts covered in this course. Therefore students might find it beneficial to take STAT 333 and ACTSC 331 at the same time. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 232 with a grade of at least 60%; Actuarial Science students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC362",
            "Name": "Introduction to Property and Casualty Practice",
            "Desc": "Introduction to property and casualty coverages. Claim payment process, development triangles, and diagnostic testing. Estimating ultimate claims using development, frequency-severity, expected and Bornhuetter Ferguson methods. Estimating unpaid claim and unallocated loss adjustment expense liabilities. Ratemaking process, including expense provisions, profit and contingencies, and adjustments for catastrophes and large losses. Pricing for deductibles and increased limits. Introduction to reinsurance pricing and reserving. Commercial lines pricing. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 231 with a grade of at least 60%; Actuarial Science or Mathematical Finance students only.",
            "Coreqs": " Coreq: STAT 231 or 241",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC363",
            "Name": "Casualty and Health Insurance Mathematics 1",
            "Desc": "Introduction to the collective risk model; models for loss frequency: (a, \nb, 0) and (a, b, 1) classes of distributions, compound distributions and\nmixtures; models for loss severity: exponential, gamma, lognormal, Pareto, \nWeibull, and mixtures; measures of distribution tails; impact of policy \nadjustments on loss frequency and severity; estimation of frequency and \nseverity models. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Actuarial Science or Mathematical Finance students only.",
            "Coreqs": " Coreq: STAT 330.",
            "Antireqs": " Antireq: ACTSC 431 (taken in or before spring 2020).",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC372",
            "Name": "Investment Science and Corporate Finance",
            "Desc": "Introduction to financial markets. Different return and risk measures. Investment rules and capital budgeting. Rigorous derivations of Markowitz portfolio optimization and its application in investment decisions. Capital Asset Pricing Model (CAPM) and Arbitrage Pricing Theory (APT). Weighted average cost of capital (WACC) and efficient market hypothesis (EMH). Long-term financing, capital structure (MM propositions), and dividend policies. Introduction to options, forwards, and swaps. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 231, MATH 235/245, MATH 237/247.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 272/ACTSC 291, AFM 273, 274, AFM 275/AFM 372/ACTSC 391, BUS 393W, ECON 371, MATBUS 371",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC391",
            "Name": "Corporate Finance",
            "Desc": "This is the first in a two-course sequence that deals with corporate financial decision making. Topics may include capital budgeting, cost of capital, security issuance, capital structure, payout policy and dividends, and short-term finance. Where suitable, topics are treated from a mathematical and quantitative perspective.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AFM 272/ACTSC 291; Computing and Financial Management, Mathematics/Chartered Professional Accountancy students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 274, AFM 372, ACTSC 372, ECON 371",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC423",
            "Name": "Topics in Financial Econometrics",
            "Desc": "This course introduces the use of advanced econometric/statistical methods in studying financial market data, and in quantitatively assessing risks associated with financial investments. The methods presented in this course are tailored to address specific issues of interest in finance, such as the quantification of the risk-return tradeoff, the modelling of time-varying stock/bond market volatility and, possibly, also the statistical analysis of financial derivatives such as options. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of AFM 323/STAT 374, STAT 331, STAT 371, STAT 373",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC431",
            "Name": "Casualty and Health Insurance Mathematics 2",
            "Desc": "Aggregate loss and payment models: properties, analytic results, convolution-type methods, recursive methods, inversion-type methods, and simulation; advanced aggregate claims models; reinsurance; applications to insurance pricing; insurance pricing using generalized linear models.  [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 363 with a grade of at least 60%; STAT 330; One of STAT 331, 371, 373. Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC432",
            "Name": "Credibility and Risk Theory",
            "Desc": "Credibility theory: American credibility, Bayesian, Bühlmann, Bühlmann-Straub, and empirical Bayes parameter estimation. Risk theory: claim arrival dynamics, surplus models, first-passage times, applications to solvency, and their analytical and numerical analyses. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 363, STAT 330, STAT 333; Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC445",
            "Name": "Quantitative Enterprise Risk Management",
            "Desc": "This course introduces enterprise risk management, with a focus on quantitative analysis and economic capital. Risk classification is first discussed with an emphasis on the types of risk most suited to quantitative methods. Risk measures, such as Value-at-Risk (VaR) and Conditional Tail Expectation (CTE or TVaR), are then introduced and their use by firms and regulators to determine risk capital requirements is further highlighted. Different approaches are considered for developing loss distributions, including frequency/severity analysis and extreme value theory. Copulas and economic scenario generators are used to aggregate dependent risks. Different strategies for mitigating or transferring risk are reviewed. Additional topics that may be covered include credit risk, capital allocation, and regulation of financial institutions. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (AFM 275/AFM 372/ACTSC 391 or (ACTSC 231, 371) or ACTSC 372 or BUS 393W),((STAT 330,333) or STAT 334); ACTSC, Math/FARM, Math Fin students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 422, MATBUS 472, BUS 433W, BUS 439W",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC446",
            "Name": "Mathematics of Financial Markets",
            "Desc": "This course covers mathematical techniques for no-arbitrage pricing and hedging financial derivatives. Topics to be covered can be classified into three broad areas: derivatives markets (options; forwards and futures; other derivatives; put-call parity), discrete-time financial models (binomial models; general multi-period models; Fundamental Theorems of Asset Pricing; risk-neutral probability), and continuous-time financial models (basic stochastic calculus and Itô's lemma; Black-Scholes model; interest rate models and bond pricing). [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (AFM 275/AFM 372/ACTSC 391 or (ACTSC 231, 371) or ACTSC 372 or BUS 393W), (STAT 333 or 334); ACTSC, Math/FARM, Math Fin, STAT students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 322, BUS 423W, ECON 372, MATBUS 470",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC453",
            "Name": "Basic Pension Mathematics",
            "Desc": "Theory and practice of pension plan funding. Assumptions, basic actuarial functions, and population theory applied to private pensions. Concepts of normal costs, supplemental liability, unfunded liability arising from individual accrued benefit, and projected benefit cost methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 331; Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC454",
            "Name": "Longevity and Mortality Using Predictive Analytics",
            "Desc": "Kaplan-Meier and Nelson-Aalen estimators for survival functions. Kernel density models. Validation of mortality tables. Estimators for Markov multiple state transition intensities. Longevity models, including deterministic and stochastic models such as Lee-Carter and Cairns-Blake-Dowd. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 331, STAT 330; Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC455",
            "Name": "Life Contingencies 3",
            "Desc": "Profit testing for traditional and non-traditional life insurance. Pricing and valuation of embedded options in life insurance products. Defined benefit and defined contribution pension plan design. Theory and practice of unit credit methods for pension plan funding and valuation for final average salary, career average earnings, and career average revalued earnings pension plans; post-retirement health benefits.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ACTSC 331 with a grade of at least 60%; Actuarial Science or Mathematical Finance students only.",
            "Coreqs": " Coreq: ACTSC 446",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC468",
            "Name": "Readings in Actuarial Science 1",
            "Desc": "Reading course as announced by the department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC469",
            "Name": "Readings in Actuarial Science 2",
            "Desc": "Reading course as announced by the department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Actuarial Science or Mathematical Finance students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC471",
            "Name": "Corporate Financial Decision Making",
            "Desc": "This is the second course of a two-course sequence that deals with corporate financial decision making. The course builds on the theory of financial management using cases to illustrate a variety of corporate financial decisions. Where suitable, topics are treated from a mathematical and quantitative perspective.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AFM 275/AFM 372/ACTSC 391 or ACTSC 372; Comp & Financial Management, Actuarial Science, Math/CPA, Math/Financial Analysis & Risk Mgmt Chartered Financial Analyst, or Mathematical Finance.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 373",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ACTSC489",
            "Name": "Advanced Topics in Actuarial Science",
            "Desc": "Advanced topics course as announced by the department. Topics and term offerings will vary.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3B; Actuarial Science or Mathematical Finance students only.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}