{
    "Name": "anthropology",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ANTH100",
            "Name": "Introduction to Anthropology",
            "Desc": "Anthropology aims at understanding what it is to be human and to examine how humanity is manifested in the diversity of cultures and societies across time and space. This course gives the student an overview of the breadth of anthropology and orients them toward thinking anthropologically in our shared worlds.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ANTH 101 or ANTH 102",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH105",
            "Name": "Prehistoric Peoples and Places",
            "Desc": "How did people live prior to the invention of writing and how do we know? This course will survey findings from several important archaeological sites from different parts of the world and different periods in time, in order to show how those questions can be answered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ANTH106",
            "Name": "Technologies of Being Human",
            "Desc": "From walking on two feet to inventing tools, writing, machines, and medicines: who we are today is shaped by our technological past. In this course we discover this history and ask what it means for our present and future.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH201",
            "Name": "Introduction to Archaeology",
            "Desc": "An introduction to the working assumptions, analytic approaches, and integrative and descriptive methods of archaeological anthropology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH202",
            "Name": "Social and Cultural Anthropology",
            "Desc": "This course introduces students to the history and key concepts of social and cultural anthropology through the examination of classic works as well as contemporary ethnographic texts and films. Topics include anthropological approaches to understanding cultural identity and difference, social structure, kinship, politics, and exchange.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH204",
            "Name": "Biological Anthropology",
            "Desc": "This course surveys the lines of inquiry in biological anthropology including evolutionary theory, anthropological genetics, primatology, hominin fossil record, osteology and skeletal biology, and modern human biocultural adaptations. A laboratory component provides students an experiential approach to the material.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ANTH 260",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH221",
            "Name": "Language and Society",
            "Desc": "This course introduces students to the study of language and culture. Topics covered include language socialization, narrative, the politics of multilingualism, and hate speech.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ARTS 290 (LEC 001) taken fall 2014, ANTH 400 (SEM 001) taken fall 2016",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH222",
            "Name": "Anthropologies of the Body",
            "Desc": "Drawing upon diverse anthropological perspectives, this course takes a holistic biocultural approach to exploring what human bodies are, what they are used for, by whom, for what purposes, and how we come to know such things.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH233",
            "Name": "Inuit Cultures",
            "Desc": "An examination of Inuit and Eskimo cultures of Alaska, Canada, and Greenland from their prehistoric origins to the present. Administrative systems imposed upon the Inuit and Eskimo will be analyzed and compared, as will the contemporary problems these communities face.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH241",
            "Name": "Food as Culture",
            "Desc": "The course addresses the topic of food from an anthropological perspective. It examines how the acquisition of food has shaped human biology and forms of social organization. Topics examined include the relationship of food to colonialism, political economy, ritual, and taboo.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH245",
            "Name": "Anthropology of Education",
            "Desc": "This course examines anthropological approaches to the study of education. Topics include classroom discourse, social reproduction, development, citizenship, power, and governmentality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH251",
            "Name": "Doing Ethnography",
            "Desc": "This course will provide students with experiential learning in collaborative ethnography. Through participation in a group project, students will learn the practice and craft of ethnography, developing skills in interviewing, observation, collaboration, giving presentations, and writing reports. Readings address ethnographic methods, multidisciplinary collaboration, and applied ethnography in work settings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ANTH 289 taken fall 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH272",
            "Name": "Issues in Contemporary Indigenous Communities in Canada",
            "Desc": "An examination of First Nations and Métis cultures and cultural development from the perspective of local Indigenous communities. The course will feature lectures, discussions, and occasional guest speakers representative of the wider Indigenous community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDG 201.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ANTH 370, NATST 272",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ANTH289",
            "Name": "Special Topics in Anthropology",
            "Desc": "Analysis of a special topic in anthropology, as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH290",
            "Name": "Visual Anthropology",
            "Desc": "This course examines relations between culture and vision, the history of photography in anthropological research, and ethnographic film and its ethical implications. Topics include the roles of museums and representation, indigenous media, advocacy, and activism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH292",
            "Name": "Skeletons: Sex, Disease, and Death",
            "Desc": "This course will provide a general introduction to how human remains have been used to reconstruct perspectives on life and death in ancient societies. Topics will include sex, gender and sexuality, cannibalism, human sacrifice, body modification, disease, and beliefs about the supernatural, among others.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ANTH300",
            "Name": "Practicing Anthropology",
            "Desc": "Thinking anthropologically means bringing observations and empirical findings into a dialogue with theoretical approaches. This course explores how anthropologists have developed the methods they use, considers how they interpret their findings through such lenses as functionalism and structuralism, and examines how they formulate critiques of fieldwork.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH303",
            "Name": "Anthropology of Digital Media",
            "Desc": "This course examines diverse forms of digital media and associated practices anthropologically and inquires into the social orders and cultural assumptions that sustain them or are themselves sustained by them. Topics include social media, virtual worlds, and hacker activism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH305",
            "Name": "Paleopathology of Health and Disease",
            "Desc": "This course introduces students to the identification and interpretation of skeletal evidence for disease, ancient and modern concepts of health and disease, and current clinical interpretations of skeletal pathologies. Topics include pathology in archaeological remains and the process of developing a differential diagnosis of skeletal lesions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 204",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH309",
            "Name": "The Archaeology of North America",
            "Desc": "This course examines past Indigenous lifeways in North America north of Mexico from the time of earliest settlement to contact with Europeans. It provides a broad survey of space-time systematics as well as conceptual, methodological, and ethical issues relevant to study of the North American archaeological record. ",
            "Notes": "[Note: Formerly ANTH 203]",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ANTH 203",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH311",
            "Name": "Anthropology of Religion",
            "Desc": "This course examines how religion has been studied as an object of anthropological inquiry. Topics may include ritual, magic, witchcraft, symbolism, cosmology, the relation between beliefs and practices, as well as the mutual influences of religion, politics, nationalism, and socioeconomic change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH320",
            "Name": "Hunter-Gatherer Archaeology",
            "Desc": "Detailed consideration of prehistoric cultural developments from earliest toolmaking to the transition to agriculture. An examination of the human mode of adaptation and the increasing complexity of cultural systems among prehistoric hunters and gatherers. Areas and periods of emphasis will vary from year to year.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH321",
            "Name": "Archaeology of Complex Cultures",
            "Desc": "Cultural development from the agricultural revolution to the rise of literacy. Special attention to the development of agriculture as a means of subsistence and to the rise of early civilization. Areas and periods of emphasis will vary from year to year.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH322",
            "Name": "The Archaeology of the Great Lakes Area",
            "Desc": "An in-depth study of the archaeological evidence for prehistoric cultures in the Great Lakes area from their arrival ca. 11,000 years ago to the coming of Europeans. Cultural ecology and cultural evolution will be stressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH330",
            "Name": "Environmental Anthropology",
            "Desc": "This course examines the relationships between environments and human societies, focusing on the nature/culture divide and social and economic organization. Topics may include politics and practice, the influence of globalization, and regional perspectives.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH331",
            "Name": "Anthropology of Childhood",
            "Desc": "Through engaging with anthropological research on children and youth, students will develop their understanding of key anthropological theories while strengthening their communication skills. By examining work across subfields, including psychological anthropology, the anthropology of education, language socialization, and cross-cultural approaches to ethnography, students will learn to evaluate different methodologies and apply them in their writing while assessing how research in this area has developed over time.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH335",
            "Name": "Arctic Archaeology",
            "Desc": "A detailed examination of the prehistoric development of human adaptations to the Inuit-Eskimo region of Arctic North America, eastern Siberia, and Greenland.  Topics covered will include the ecology of the Arctic and the culture history of the peoples who first colonized the region as revealed by archaeological research.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ANTH 201/CLAS 221, ANTH 233",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH345",
            "Name": "Directed Research in Anthropology",
            "Desc": "This course provides selected students with an opportunity to work (up to a maximum of eight hours per week over one term) as apprentices with a specific instructor on a research project in which the instructor is currently engaged. ",
            "Notes": "[Note: This is a non-paid position and may not be combined with sponsored research positions. Previous or external research experiences will not meet the criteria for this course. This course will be graded on a CR/NCR basis.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Honours Anthropology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH347",
            "Name": "Medical Anthropology",
            "Desc": "This course teaches students the fundamentals of anthropological approaches to illness, health, medicine, and bioethics. It covers the history of medical anthropology as well as major movements, debates, and current topics. Topics include cross-cultural healing systems, social suffering, and concerns raised by new biomedical technologies and within global health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH348",
            "Name": "Anthropology of Tourism",
            "Desc": "This course examines the nature of tourism as cross-cultural contact and critiques the phenomena of mass travel and globalized tourism. The various perspectives of anthropologists and tourists in understanding culture will be explored.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH350",
            "Name": "Anthropology of Gender",
            "Desc": "This course examines anthropological perspectives on variations in gender roles and systems through the comparison of ethnographies. Topics include the relationship of gender to social organization, sexuality, economic and political processes, belief systems, and social movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH355",
            "Name": "Human Osteology",
            "Desc": "A laboratory course in the anatomy and function of the human skeleton with an emphasis on recovering and identifying skeletal remains from archaeological and forensic contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 204",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH365",
            "Name": "Human Evolution",
            "Desc": "This course reviews the evolutionary history of humans. It includes an examination of the hominin fossil record, evidence from genetic analyses, and behavioural inferences that have been drawn from nonhuman primate models. Emphasis is placed on the process of knowledge production and interpretation, and the representation of human evolution in the public realm.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 204",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH371",
            "Name": "Anthropological Field Experience",
            "Desc": "This course features a combination of academic content and field experience. ",
            "Notes": "[Note: Additional fees required. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH372",
            "Name": "Archaeological Field School",
            "Desc": "Data gathering techniques are studied and applied in field work on archaeological sites. ",
            "Notes": "[Note: Additional fees required. Enrolment is limited.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH377",
            "Name": "Dental Anthropology",
            "Desc": "This course introduces students to the analysis of human teeth, which is of central importance to paleopathology, paleoanthropology, forensic science, and contemporary human biomonitoring research. Students will also gain hands-on experience with laboratory techniques as they explore how to address anthropological questions with their data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 204",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH381",
            "Name": "Anthropology of South Asia",
            "Desc": "An introduction to culture and society in South Asia, focusing on caste, kinship, gender, religion, material culture, regional and national identity, ethnic conflict, globalization, and life in the diaspora.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH382",
            "Name": "Anthropology of East Asia",
            "Desc": "Through an examination of anthropological research on cultural and social change in contemporary East Asia, including China, Hong Kong, Japan, North Korea, South Korea, and Taiwan, students will develop their capacities in analyzing anthropological theory. Written and oral projects on specific topics and areas will vary by instructor and year, providing opportunities to strengthen communication skills. Students will also learn how to assess different research approaches through in depth and comparative readings on topics such as migration, mobility, gender, politics, popular culture, science and medicine, environment, post-colonialism, and transnationalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH389",
            "Name": "Special Topics in Anthropology",
            "Desc": "Analysis of a special topic in anthropology, as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH391",
            "Name": "Reading in Anthropology",
            "Desc": "Student-initiated independent research on a selected topic. A high standard of written work is required. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Honours Anthropology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH395",
            "Name": "Anthropological Study Abroad",
            "Desc": "This course features a combination of academic study and first-hand field study of cultures and visits to or work experience at museums and archaeological sites. ",
            "Notes": "[Note: Field trip fee may be required. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: at least 1.0 unit in ANTH",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH415",
            "Name": "Archaeologies of Landscape",
            "Desc": "This course examines the ways in which past peoples experienced, transformed, remembered, represented, and controlled landscapes. Readings and discussions emphasize both contemporary theoretical approaches and case studies from various settings in an effort to illuminate the social, political, economic, and ideological dimensions of landscape.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH430",
            "Name": "Science as Practice and Culture",
            "Desc": "An examination of science as being constituted by practices which are inevitably social and cultural, as well as of scientific expertise in contemporary issues of new technology, biomedicine, and environmental conflict.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH440",
            "Name": "Archaeological Analysis and Interpretation",
            "Desc": "A study of contemporary archaeological method and theory with emphasis on the process of deriving inferences concerning past peoples and societies from different kinds of archaeological materials and data. Students will be required to carry out an analysis of an actual archaeological assemblage. Specific topics will vary from year to year.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH447",
            "Name": "Global Health and Medical Anthropology",
            "Desc": "This course is an exploration of global health in anthropological perspective. It includes case studies as well as theoretical and critical readings on global health topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH455",
            "Name": "Skeletal Biology and Forensics",
            "Desc": "This laboratory course focuses on the evaluation of human skeletal remains in archaeological and forensic contexts. Topics include determination of basic biological categories (e.g., age, sex, race), evaluation of paleopathological conditions, and aspects of forensic anthropology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 355 or ANTH 370W",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH465",
            "Name": "Borders, Boundaries, and Crossings",
            "Desc": "This seminar covers anthropological perspectives on the relationship between state borders and socio-cultural boundaries (across race, gender, class, language, and religion). Readings include ethnographies about contested borders, border dwellers, and border crossers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH489",
            "Name": "Special Topics in Anthropology",
            "Desc": "Analysis of a special topic in anthropology, as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times. Formerly ANTH 400.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH498",
            "Name": "Anthropology Capstone",
            "Desc": "This course explores themes of current anthropological research as they intersect across the major subfields of the discipline. Topics may vary. ",
            "Notes": "[Note: The department chair is the course co-ordinator. This course cannot be substituted for other 400-level plan requirements. Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A; Anthropology majors only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH499A",
            "Name": "Honours Essay",
            "Desc": "Directed reading and research in a selected area of anthropology inquiry.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Anthropology majors only; 80% cumulative ANTH average",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ANTH499B",
            "Name": "Honours Essay",
            "Desc": "Directed reading and research in a selected area of anthropology inquiry.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Anthropology majors only; 80% cumulative ANTH average",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}