{
    "Name": "architecture",
    "Notes": "Students entering the program are expected to supply their\r\nown drawing\r\nequipment, drafting board (top only), and general art supplies. The\r\nestimated\r\ncost of this equipment is $500-$600.\nStudents are expected to defray the costs of studio\r\nprojects. The cost\r\nof materials may range from $100 to $500 per Design Studio.\nComputing equipment is available for general use by students.\nStudents not enrolled in the Architecture program may take any architectural course listed in the recommended core program (depending on availability of space) with the exception of courses in the theme area of Design. Prerequisites indicated in the course descriptions are primarily for Architecture students. For non-Architecture students, prerequisite evaluation must be carried out by the respective instructors. Contact the course instructor or the undergraduate officer for Architecture if you are interested in taking any Architecture courses.",
    "Courses": [
        {
            "courseCode": "ARCH110",
            "Name": "Visual and Digital Media 1",
            "Desc": "Introduction to the use of graphic media in architecture. Students will engage in exercises in drawing using various media, acquire digital skills, and develop fluency in diverse forms of architectural presentation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Architecture students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH113",
            "Name": "Visual and Digital Media 2",
            "Desc": "Introduction to computing techniques in architecture. Students will be instructed in the conceptual foundations for computer use in architecture, graphic applications for the computer and skills for two-dimensional drawing, three-dimensional modelling and graphic techniques for visualization and portfolio development. Students will gain fluency in a range of software applications for the purposes of developing technical and visual proficiencies to be integrated into the design process. [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 110",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH120",
            "Name": "An Introduction to Architectural Ideas and Communications",
            "Desc": "This course offers a broad introduction to the evolution of ideas, principles and vocabulary of architecture over time, establishing the concept that architecture conveys meaning through its own expressive language. It will familiarize students with the primary concepts of architecture; develop an awareness of the influences of architectural form; and introduce students to different modes of verbal and written communication, including the language of architectural criticism, analysis and interpretation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Architecture students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH126",
            "Name": "Environmental Building Design",
            "Desc": "An introduction to environmental design practices leading to low carbon design. Topics of discussion include passive heating and cooling, solar geometry, climate and meteorological influences, microclimate, site design, daylighting, active systems, embodied energy, sustainable rating systems, sustainable design philosophies such as cradle to cradle, biomimicry and design for disassembly. Energy-related issues will be addressed and energy-based software design programs will be introduced. Understanding the role of design in an energy efficient or passive solar building will be a central learning outcome. ",
            "Notes": "[Note: Field trip fee: $15. Offered: W]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Architecture students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 226",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH142",
            "Name": "Introduction to Cultural History",
            "Desc": "This course will introduce cultural history and the ethical dimension of the role architects play. Localizing the realities of modernity as an enduring cultural force and a global economy on one hand, with global threats to the future of humankind on the other. This course will explore the commonality of human experience, the interdependence of humans, and the natural environment. By considering narratives, artefacts, and buildings, this course will present how architecture and other cultural creations intersect with issues of race, gender, and identity, within a range of spiritual, social, political, and environmental contexts. Through orientation, disorientation, and reorientation, this course introduces human constructs and environmental conditions from a variety of perspectives such as location, foundation, habituation, accommodation, exile, and displacement. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Architecture students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH143",
            "Name": "Settlements, Sanctuaries, and Cities",
            "Desc": "This course introduces buildings, cultural practices, and worldviews of nomadic and sedentary societies across a broad range of geographies and periods. Beginning with the earliest shrines and cities that appear in the Middle East, the Far East, and India, and exploring settlements in Africa, Asia, Europe, and the Americas up to the year 1000CE. This course examines the origins of sacred and civic architectures in the landscapes and environments in which they emerge, moving across continents to recognize patterns of life, concepts of order and conduct, symbols, rituals, and myths embodied in our building practices and settlement patterns. Analysis in this course foregrounds the relationships to the lands that inform cultures, the formation and movement of societies, their temporary and permanent constructions, looking at the ecological and social bearings of cities as spaces of power, sanctuary, and exchange. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 142",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH172",
            "Name": "Building Construction 1",
            "Desc": "A focus on the construction of small-scale buildings will introduce the fundamentals of building construction demonstrating relationships between contemporary design and material selections. Design development practices will reference; regulatory frameworks, building science, soils, foundations, light wood construction, engineered wood, masonry (brick, concrete block, load bearing, veneer systems), shallow foundations, residential codes, barrier free design. ",
            "Notes": "[Note: Field trip fee: $20. Offered: F]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Architecture students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH173",
            "Name": "Building Construction 2",
            "Desc": "Focusing on the construction of medium-to large-scale buildings examines relationships between design development, and the building science, and construction practices of structural systems and enclosures. Case studies and projects will be used to investigate steel framing systems (traditional, long span, architectural exposed structural steel [AESS]); reinforced, precast, fibre reinforced and prestressed concrete construction; heavy timber construction (traditional, glulam, cross laminated timber [CLT]); deep foundations; building envelopes (curtain wall, window walls, glazing, insulation strategies, and roofing systems); fire protective design. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 172",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH174",
            "Name": "Experimental Course",
            "Desc": "This course offers a vehicle for introducing additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH175",
            "Name": "Experimental Course",
            "Desc": "This course offers a vehicle for introducing additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH192",
            "Name": "Design Studio",
            "Desc": "Development of the means to appreciate the art and science of building; introduction to the study of theories of architecture; development of skills in graphic communication; introduction to a study of building elements; promotion of the application of theory in the practice of design. ",
            "Notes": "[Note: Passing grade is 60%. Field trip (one week). Field trip cost $300-$450. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: Architecture students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH193",
            "Name": "Design Studio",
            "Desc": "Further development of basic skills, and the application of theory and design in small scale architectural design projects. Introduction to issues of inhabitation, program, and context. ",
            "Notes": "[Note: Passing grade is 60%. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 192",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH212",
            "Name": "Digital Fabrication",
            "Desc": "This course will introduce students to the tools, work-flows, and culture surrounding computer-aided design/computer-aided manufacturing (CAD/CAM) and its creative applications within architecture. Students will learn how to work with CAD/CAM technologies such as laser cutters, three-dimensional (3D) printers and computer numerical control (CNC) routers while expanding their knowledge of two- and three-dimensional CAD geometries that inform the digital fabrication process. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 113",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH215",
            "Name": "Communication Design",
            "Desc": "This course will elaborate upon the graphic and communication conventions established in the fundamental architecture curriculum through a series of assignments ranging from conventional architectural techniques to introductory principles of graphic and industrial design. The intention is to: cultivate an understanding of fundamental concepts and techniques in leading vector and raster-based graphic tools for design development and presentation; to develop an understanding of the paradigm shift from digital media as a representation tool to that of design development; to expand the depth and breath of skills necessary for modern design industry; and to apply design techniques and technologies to and from industrial and graphic design.  [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH225",
            "Name": "Theory and Design of the Contemporary Landscape",
            "Desc": "This course provides an historical overview of the ideas of nature and landscape in Western thought. 'Nature', 'Ecology', and 'Landscape' are treated as cultural constructs, related to specific philosophical, technological, economic, political, and social issues. Many of these issues will be considered as the course of study traces the evolution and transformation of contemporary landscape. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Architecture.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 425",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH243",
            "Name": "Indigenous Practices",
            "Desc": "This course will engage students in a range of topics that include historical, practical, or theoretical investigations centering indigenous topics and epistemologies. This can include indigenous architectures, spatial and land practices locally or globally, indigenous typologies and worldviews, traditional ecological knowledge, and practices of restoration. This course will also look at critical and decolonizing frameworks for research methods and creative practices in order to introduce other ways of knowing and engaging the world. [Offered: S, first offered Spring 2023]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH246",
            "Name": "Cultural Encounters 600-1600",
            "Desc": "This course presents encounters across peoples, worldviews, belief systems, and empires, following the movement of ideas, practices, and objects to consider significant cultural transformations resulting from conflictual or peaceful interactions. From Indigenous civilizations and imperial dynasties, to sites of economic, political, and religious encounters such as the Silk Road or the Crusades. This course thematically presents creative works across all continents and includes proto-capitalist and proto-colonial phenomena. Representational, material, and spatial practices studied range from visual and oral discourses, drawing, mapping, printing, land markings, places of burials, worship, and teachings, as well as the organization of cities, landscapes, and territories, all studied as windows into ways of knowing, patterns of life and relationships to the land. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 143",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH248",
            "Name": "Cultural Encounters 1600-1914",
            "Desc": "This course critically examines the period from the 17th century to the first years of the 20th century, studying revolutions in science, agriculture, and industry, and considering the social, political, and economic changes engendered globally in their wake. Selected works from philosophy, literature, the arts, architecture, landscape, and city design reveal complex social and political upheavals. The increasing influence of technology, and the power struggles around access to and extraction of the globe's resources. Topics considered include the birth of industrial nations driven by Enlightenment reason, science and the emancipative promise of political liberty, as well as the fall of that early idealism with the realities of capitalism, colonialism, racism, and the destruction of the natural environment. Considering encounters between people, as well as between people and the earth, this course studies both the promises and shadows of the complex global society that emerges in this time. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 246",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH256",
            "Name": "Introduction to Photography",
            "Desc": "Introduction to the main concepts in creating and using photographic images. This will be accomplished in the context of various academic applications including site and model documentation, portfolio, and thesis presentation. The course will include both analog and digital procedures but with a heavy emphasis on monochrome silver images. A limited number of analog and digital cameras are available on a loan basis. Materials at student's expense. ",
            "Notes": "[Note: Lab Fee $10. Offered: S]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Architecture students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: FINE 227",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH260",
            "Name": "Principles of Structures",
            "Desc": "Fundamental concepts of mechanics and structures, as related to architectural design, study of loading conditions, forces, moments, systems of forces, conditions of equilibrium for two- and three-dimensional structures, centre of gravity of loads and areas, bar forces in trusses, simple frame analysis, moment of inertia. Concepts of simple stress and strain; shear and bending moments in simple beams; shear and moment diagrams, qualitative deflected shapes, flexural and shearing stresses, deflection calculations; compression members; Euler's formula.  [Offered:  F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Architecture students. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 163",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH274",
            "Name": "Experimental Course",
            "Desc": "This course offers a vehicle for introducing additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH275",
            "Name": "Experimental Course",
            "Desc": "This course offers a vehicle for introducing additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH276",
            "Name": "Timber: Design, Structure and Construction",
            "Desc": "Architectural case studies are used to examine conceptual development, structural design, building process, and the selection of structural timber systems. Topics such as flexural, compression and truss members, connections, and plywood construction are studied using calculations, design aids, rules of thumb, and the latest CSA design standards. [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ARCH 260, ARCH 262, CIVE 204 or 205",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH277",
            "Name": "Timber: Design, Structure and Construction for Engineers",
            "Desc": "Architectural case studies are used to examine conceptual development, structural design, building process and the selection of structural timber systems. Topics such as flexural, compression and truss members, connections, and plywood construction are studied using calculations, design aids, rules of thumb and the latest CSA design standards. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 260 or CIVE 204 or CIVE 205.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 276",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH284",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum, guided exploration of specific architectural problem areas, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH285",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum, guided exploration of specific architectural problem areas, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH292",
            "Name": "Design Studio",
            "Desc": "The exploration of design as a thinking process through the medium of small scale design projects. The development and analysis of architectural propositions concerning personal space within the context of a larger community. ",
            "Notes": "[Note: Passing grade is 60%. Required two-day field trip, cost range $150-$200. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 193",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH293",
            "Name": "Design Studio",
            "Desc": "Design involving problems of human perception and dimension in more complex environments, and dealing with issues of public and private space. Development of skills in analysis and programming, and further exploration of questions of siting and context. ",
            "Notes": "[Note: Passing grade is 60%. Field trip (one week). Estimated field trip cost $400-$500. Offered: S]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 292",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH314",
            "Name": "Digital Design",
            "Desc": "This intermediate level course provides a more in-depth theoretical foundation in architectural design by computer, including three-dimensional modelling, light and colour, rendering, image processing and animation.  Practice is provided by weekly tutorial exercises and a small term design project. ",
            "Notes": "[Note: Formerly ARCH 212. Offered:  W]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 113",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH327",
            "Name": "Architecture of the Urban Environment",
            "Desc": "An introduction to the structure and form of urban environments as understood through the urban architecture. The forces that determine the creation and development of urban places will be examined. Topics include the plan as a generative form, urban building types, urban morphology, and the shape of the public realm, infrastructure as both system and architectural object, nature and the park, and real estate and development controls. Of special interest will be analyses of the suburb, and urban master plans. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Architecture students or Honours Environment and Business students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH328",
            "Name": "Approaches to Architecture and Urbanism",
            "Desc": "The course develops a trans-disciplinary overview to design approaches in architecture and urbanism using image- and symbol-making as key activities in designing environments. The course evaluates the quality of results and the quality of process of design of environments. The students address topics within a wide range of subject matter groupings, from sustainable architecture to engineering, landscape and infrastructure, to branding and aesthetic practices, to design within the municipal political forum. Students present seminars on diverse categories of design as a means to develop a personal design ethos. The final submission includes a set of drawings, diagrams and images that represent a set of design principles allowing students to consciously take a position in the world as a designer. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH331",
            "Name": "Working with Wood",
            "Desc": "This course focuses on understanding the premise that hand skills can facilitate and help inform conceptual and academic skills. The content provides a broad-based introduction to woodworking equipment, its fabrication methods and methodology. A combination of lectures and hands-on experiences are used to equip students with the basic skills and knowledge required to conceptualize, fabricate, and finish a designed object from wood. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 385 (Topics Course - Working with Wood)",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH332",
            "Name": "Design/Build Workshop",
            "Desc": "A design/build workshop which offers opportunities for hands-on experience in three-dimensional design. Advancements of technical and design skills provide the underpinnings for the projects. Students are encouraged to explore a variety of media and techniques such as woodworking and metalworking, allowing for both individual and small team investigations. A logbook will be kept to record creative intentions and the design process from conception to completion.  [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Architecture students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH342",
            "Name": "Modernisms: Local and Global",
            "Desc": "This course examines the cultural, architectural, urban, and environmental history of those complex movements designated as \"modernism\". Through selected works, projects and texts, this course studies the changing social, industrial, aesthetic, and ecological ambitions of these movements, critically reviewing their development and examining forms of acceptance and resistance to the \"modern project\". Through the examination of selected Canadian and international artistic, cultural, architectural, and landscape works, this course questions the technological, political, and social ideologies that continue to inform our buildings and cities as well as our relation to the earth and environment. Using a thematic approach to address the complexity of modernization, modernism, and modernity, this course presents issues related to habitat, health, craft, economy, and labour; histories of displacement, global narratives, resistance movements, and processes of emancipation and decolonization. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 248",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH345",
            "Name": "Architectural Theory 1850-1990",
            "Desc": "Beginning with the introduction of important theories of architecture in vogue prior to 1850, this course examines texts, movements, buildings, projects, and urban proposals of the period in order to understand the structure of contemporary architectural theory.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 247",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH346",
            "Name": "Competitions in Architecture",
            "Desc": "This course provides an opportunity for the student to independently engage in the respected tradition of the Architectural Competition. The competition entry and accompanying research paper must focus on the use of architectural precedents as the basis for the creation of typologically based propositions. Submission to the external competition is mandatory, the timing and detailed requirements of which will determine the personalized academic requirements for this course. [Offered: W, S]",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH347",
            "Name": "Philosophy in Architecture",
            "Desc": "The course introduces the study of philosophical issues as they pertain to architecture, urbanism, image-making and symbol manipulation. The course focuses on the work of a selection of living and recent philosophers whose issues are relevant to questions of everyday 21st century life, with reference to their basis in the history of philosophy. Work by philosophers such as Giorgio Agamben, Kwame Anthony Appiah and Judith Butler on ethics, Gilles Deleuze on meaning, Friedrich Kittler on media and technology, Jean-Luc Nancy on community and Slavoj Zizek on psychoanalysis and political economy, as well as Canadian scholars such as Marshall McLuhan and Harold Innis is addressed. Students participate in a seminar format with a series of presentations linking their design projects with philosophical issues, and submit a final project making use of text and diagrams. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH362",
            "Name": "Steel and Concrete: Design, Structure and Construction",
            "Desc": "Architectural case studies are used to examine conceptual development, structural design, building process, and the selection of structural steel and concrete systems. Topics such as tension, flexural, and compression members; and connections are studied using calculations, design aids, rules of thumb, and the latest CSA design standards. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 262 or (ARCH 260 and ARCH 276)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH364",
            "Name": "Building Science",
            "Desc": "The physio-technical factors that influence building design for performance,  durability, efficiency, health, and sustainability will be explored. Common building design construction problems, their causes and solutions, will be examined with the aid of case studies. Using the principles of building science, good details of masonry, wood, steel, and glass will be developed. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 173.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARCH 264",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH374",
            "Name": "Experimental Course",
            "Desc": "This course allows for additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH375",
            "Name": "Experimental Course",
            "Desc": "This course allows for additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH384",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH385",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH392",
            "Name": "Design Studio",
            "Desc": "Development of design skills and theoretical knowledge through their application in projects involving various building types in urban situations. Emphasis is placed upon issues of materiality and technology in architectural design. ",
            "Notes": "[Note: Passing grade is 60%. Required four to five day field trip, cost $400-$500. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 293",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH393",
            "Name": "Option Design Studio",
            "Desc": "This design studio is subdivided into distinct studio sections, each of which provides a specific platform for advanced research and design presented within the context of a topic or set of issues to be explored in relation to a specific design project, program and site. These studios range in both scale and scope, traversing an array of academic investigations, design hypotheses, research agendas, interdisciplinary explorations, and pedagogical intentions. These topics foreground the disciplinary arenas within architecture in the areas of architectural theory, media, technology, urbanism, and landscape. ",
            "Notes": "[Note: Passing grade is 60%. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 392",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH428",
            "Name": "Rome and the Campagna (Rome)",
            "Desc": "History of settlement and building in Rome and the surrounding area from antiquity to the present. Acts of design in architecture, urban form and landscape related to political, cultural and spiritual authority of Rome. Comparison drawn between the image of the city, represented in literature and art, and the material facts of the place. Field trips, lecture. ",
            "Notes": "[Note: Course fee: Required  travel fee applies to this course, please contact the Architecture Student Services Co-ordinator for current fees. [Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Architecture.",
            "Coreqs": " Coreq: ARCH 492",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH429",
            "Name": "Global Cities",
            "Desc": "A global cities course enabling students to travel abroad and study first hand the architecture and urbanism of cities across Europe, Asia and South America. These course offerings are thematically based and involve field trips to specific architectural sites, cities, and regions around the world. ",
            "Notes": "[Note: Additional course travel fee applies to this course, please contact the Architecture Student Services Co-ordinator for current fees. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH442",
            "Name": "Contemporary Architectural Theory",
            "Desc": "This course presents a thematically organized survey of contemporary architectural theory that focuses on the relationship between key theoretical texts and critical developments in contemporary architectural theory, practice, and their social and ecological contexts. This course is intended to be a forum for discussion of selected topics in contemporary culture, and to provide students with an advanced knowledge base in contemporary theory broadly, and architectural theory more specifically to ground other forms of advanced architectural research. Themes explored in the course may include ethics in architectural practice, gender and identify in architecture, race and spatial justice, climate, sustainability, and ecological care. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 342",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH443",
            "Name": "Architecture and Film",
            "Desc": "This course explores the relationship between Architecture and the development of early, modern and science fiction films via the examination of the source and methods of portrayal of architectural expression in film. Films will be viewed to examine precedents for imagery, set design, location selection, as well as the integrated vision of the urban and dystopic environmental future. Futuristic film architecture will provide an opportunity to study a vision of the future of urban built form and provide a forum for critical discussion. Assignments will require that the students become familiar with different methods of media; for example - video filming, sound and visual editing, web page production. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH446",
            "Name": "Italian Urban History (Rome)",
            "Desc": "The course provides a survey of the history of settlement and urban form on the Italian peninsula from antiquity to the present day. In it the influences upon the structure of public and private space are outlined for each historical period. These include constants such as geography and climate, but more especially the factors that induce and manifest change: politics, warfare, economics, social structure, the arts and theory. ",
            "Notes": "[Note: Course fee: $550.00. Offered:  F]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Architecture.",
            "Coreqs": " Coreq: ARCH 492",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH449",
            "Name": "The Development of Modern Italian Architecture (Rome)",
            "Desc": "The course addresses the issues of architecture and urbanism in Rome and Italy from 1750 to the present. It explores the relationship between cultural, political, and artistic phenomena such as Futurism, Novecento, and Rationalism, that anticipate and create modernism in Italy. ",
            "Notes": "[Note: Two one-day field trips, estimated cost $60.00. Offered:  F]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Architecture.",
            "Coreqs": " Coreq: ARCH 492",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH463",
            "Name": "Integrated Environmental Systems",
            "Desc": "This course is focused on the integrated environmental systems of buildings with an aim to develop the knowledge and skills appropriate to architectural practice. Subjects covered include environmental parameters, air and water systems, heating and cooling loads, energy conservation, ventilating and air conditioning systems, plumbing and waste systems, artificial source lighting and daylighting, acoustics, and fire protection criteria and systems, with reference to building codes and standards. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Architecture.",
            "Coreqs": " Coreq: ARCH 493.",
            "Antireqs": " Antireq: ARCH 263",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH473",
            "Name": "Technical Report",
            "Desc": "Students will investigate and report on technical issues as they relate to the development of the comprehensive building project in the parallel Design Studio. Innovation and integration in architectural design will be stressed with respect to structure, building envelope, environmental systems, health and life safety, movement systems, site planning and the integration of information technology.  [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Architecture.",
            "Coreqs": " Coreq: ARCH 493",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH474",
            "Name": "Experimental Course",
            "Desc": "This course allows for additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH475",
            "Name": "Experimental Course",
            "Desc": "This course allows for additional electives to the program on a short-term basis, and for developing future permanent courses.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH484",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH485",
            "Name": "Architectural Research",
            "Desc": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH492",
            "Name": "Design Studio",
            "Desc": "The studio course is mounted in Rome, Italy, with the school's own faculty and premises, and offers a unique opportunity to undertake design studies in a truly rich architectural heritage. The main focus is the nature of the institution and its relationship to the city and its culture. Students participating in the Rome term are expected to defray the costs of travel, accommodation, and food. For students unable to study in Rome, an alternative studio is offered in Cambridge. It presents similar design projects and theoretical questions in a North American context. ",
            "Notes": "[Note: Passing grade is 60%. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 393",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH493",
            "Name": "Design Studio/Comprehensive Building Design",
            "Desc": "This studio represents a culmination of the pre-professional degree, through the integration and application of skills and knowledge to a complex building project. Students will develop designs to a high level of detail. A concern for technical material, environmental, and legal aspects of architecture will support open speculation and innovative design. ",
            "Notes": "[Note: Passing grade is 60%. Offered: S]",
            "Consent": "None",
            "Prereqs": "Prereq: ARCH 492",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH510",
            "Name": "Special Topics in Visual and Digital Media",
            "Desc": "A range of special topics within visual and digital media that include course offerings in parametric design and scripting, advanced visualization, interaction design, and digital fabrication. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH520",
            "Name": "Special Topics in Urbanism and Landscape",
            "Desc": "A range of special topics courses within urbanism and landscape. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH540",
            "Name": "Special Topics in Architectural History and Theory",
            "Desc": "A range of special topics courses within cultural and architectural history, theory and criticism. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH570",
            "Name": "Special Topics in Building Technology and Environmental",
            "Desc": "A range of special topics courses within building technologies, structures, materials and methods and environmental systems including coursework in alternative energy systems, ecological design and design build. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARCH580",
            "Name": "Special Topics in Race, Equity, and Environmental Justice",
            "Desc": "The equity and environmental justice electives include courses that are at the intersection of representation, culture, technology, environment, landscape, and urbanism to consider questions of race, space, and environmental justice, addressing a range of topics that can include universal design principles, design norms and standards, exclusionary and inclusive practices in architecture, questions of solidarity, climate crisis, sustainability, as well as social and spatial justice. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Architecture",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}