{
    "Name": "arts",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ARTS111",
            "Name": "Career Development and Decision-Making",
            "Desc": "This course is designed to assist students in understanding themselves, the career development process, and occupational information in order to make informed and appropriate occupational and educational decisions. Students will study key career development theories and learn how to integrate self-knowledge into occupational/life decisions, set goals, and devise strategies to attain these goals.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to first-year students in Arts and Business",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS122",
            "Name": "Quest for Meaning in the Modern World",
            "Desc": "This course invites students on a quest for meaning in the context of a time in which traditional meanings and definitions have been challenged by rapidly-shifting cultural and religious values.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS130",
            "Name": "Inquiry and Communication",
            "Desc": "This course provides an introduction to diverse intellectual modes of inquiry in the social sciences and humanities with an emphasis on the development of communication skills. In a small seminar setting, students will explore a variety of topics based on instructor expertise in order to build social awareness, ethical engagement, and communication competencies in comprehension, contextualization, and conceptualization. Students will be expected to engage with the work of others, articulate positions, situate writing and speaking within contexts, practice writing and speaking for situations beyond the classroom, engage in basic forms of research, and workshop, revise, and edit writing. ",
            "Notes": "[Note: Course not open to those who have met ELPE or the Undergraduate Communication Requirement.]",
            "Consent": "None",
            "Prereqs": "Prereq: Arts students; Not open to Accounting and Financial Management students;",
            "Coreqs": "None",
            "Antireqs": " Antireq: English Proficiency/Undergraduate Communication Requirement milestone",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS140",
            "Name": "Information and Analysis",
            "Desc": "This course introduces students to diverse ways of finding, examining, and using data and information in the social sciences and humanities. In a small seminar setting, students will explore a variety of topics based on instructor expertise in order to understand quantitative and qualitative methods of data gathering and build competencies in conceptualizing, contextualizing, and comprehending methods of information analysis. Students will be expected to investigate, use, and assess the presentation of information in their own work and the work of others so that they can better understand the range of social, ethical, and political challenges of our world. ",
            "Notes": "[Note: Course not open to those who have met ELPE or the Undergraduate Communication Requirement.]",
            "Consent": "None",
            "Prereqs": "Prereq: Arts students; Not open to Accounting and Financial Management students;",
            "Coreqs": "None",
            "Antireqs": " Antireq: English Proficiency/Undergraduate Communication Requirement milestone",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ARTS190",
            "Name": "First-Year Topics in Arts Disciplines",
            "Desc": "This topics course will be offered from time to time by particular disciplines in Arts, to cover areas of emerging research and teaching interest. ",
            "Notes": "[Note: For permission to enrol in the course, students should consult the department offering the desired section. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS280",
            "Name": "Statistics for Arts Students",
            "Desc": "A basic course in social statistics for Faculty of Arts students. Introduces descriptive statistics (measures of central tendency, dispersion, cross-tabular analysis) and inferential statistics (sampling, statistical significance, hypothesis testing, test assumptions). Covers a range of statistical techniques including t-tests, one-way ANOVA, Chi square, and bivariate correlation/regression.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to Econ or Psych students.",
            "Coreqs": "None",
            "Antireqs": " Antireq:\nECON 221, ENVS 278, GBDA 205, HLTH 204, ISS 250A/B, 250R, KIN 222, 232, PSCI214/314, PSYCH292, REC371, SDS250R, SMF230, SOC/LS280, STAT202, 206, 211, 221, 231, 241, SWREN250A/B, 250R",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ARTS290",
            "Name": "Second-Year Topics in Arts Disciplines",
            "Desc": "This topics course will be offered from time to time by particular disciplines in Arts, to cover areas of emerging research and teaching interest. ",
            "Notes": "[Note: For permission to enrol in the course, students should consult the department offering the desired section. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS301",
            "Name": "Studies in Ideas",
            "Desc": "A course consisting of a series of lectures and tutorials on specific topics dealing with important ideas in the humanities, social sciences, fine and performing arts, and languages and cultures. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS365",
            "Name": "Arts Study Abroad",
            "Desc": "Study abroad in the fall term under exchange agreements supported by the Faculty of Arts. Discussion and approval of options with your advisor is required. Credit for specific courses will be evaluated following receipt of a transcript of academic results and supporting course outline documentation. The approved study agreement will be recorded on the student's record.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS366",
            "Name": "Arts Study Abroad",
            "Desc": "Study abroad in the winter term under exchange agreements supported by the Faculty of Arts. Discussion and approval of options with your advisor is required. Credit for specific courses will be evaluated following receipt of a transcript of academic results and supporting course outline documentation. The approved study agreement will be recorded on the student's record.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS367",
            "Name": "Arts Study Abroad",
            "Desc": "Study abroad in the spring term under exchange agreements supported by the Faculty of Arts. Discussion and approval of options with your advisor is required. Credit for specific courses will be evaluated following receipt of a transcript of academic results and supporting course outline documentation. The approved study agreement will be recorded on the student's record.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS390",
            "Name": "Third-Year Topics in Arts Disciplines",
            "Desc": "This topics course will be offered from time to time by particular disciplines in Arts, to cover areas of emerging research and teaching interest. ",
            "Notes": "[Note: For permission to enrol in the course, students should consult the department offering the desired section. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS450",
            "Name": "Global Engagement Seminar",
            "Desc": "In this interdisciplinary topics course, students collaborate with each other and with instructors and outside experts to develop imaginative but possible solutions to vexatious contemporary global problems. Each year, instructors from different disciplines, joined by Jarislowsky Fellows with diverse expertise and lived experience in the topic area, lead the class. Past topics include global populism and democratic futures, artificial intelligence, the future of nature, and pandemic. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times. Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ARTS490",
            "Name": "Fourth-Year Topics in Arts Disciplines",
            "Desc": "This topics course will be offered from time to time by particular disciplines in Arts, to cover areas of emerging research and teaching interest. ",
            "Notes": "[Note: For permission to enrol in the course, students should consult the department offering the desired section. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}