{
    "Name": "aviation",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "AVIA100",
            "Name": "Introduction to Aviation",
            "Desc": "This course incorporates a survey of topic areas that impact the aviation industry in Canada. Key areas include aviation history, civil and military aviation, human factors, airspace and air traffic control systems, airport management, and aviation safety. The nature and impact of each of these topics is explored through a combination of lecture, class discussion and activities, and student presentations. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA101",
            "Name": "Professional Pilot Program Course 1",
            "Desc": "This course provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete flight training to the First Solo level and acquire approximately 20 hours of flight time. This course also includes the ground school required to prepare the student to write the Transport Canada Private Pilot Licence - Airplane examination. The course provides a solid base of the knowledge required to be a safe and proficient professional pilot.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA102",
            "Name": "Professional Pilot Program Course 2",
            "Desc": "This course is a continuation of AVIA 101 and provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete flight training to the Private Pilot Licence level and acquire approximately 45 hours of flight time in the semester to total 65 hours of flight time to date.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 101; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA203",
            "Name": "Professional Pilot Program Course 3",
            "Desc": "This course is a continuation of AVIA 102 and provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete flight training required to acquire the Night Rating and acquire additional cross-country Pilot-in-Command time to total approximately 85 hours flight time by the end of the course.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 102; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA204",
            "Name": "Professional Pilot Program Course 4",
            "Desc": "This course continues from AVIA 203 and provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete a dual cross-border flight to the United States as well as a dual flight into high density controlled airspace (CYYZ). Students also complete a check-out in a complex aircraft and acquire additional cross-country pilot-in-command time. Students will have acquired approximately 110 hours total flight time by the end of the course. This course also includes the ground school required to prepare the student to write the Transport Canada Commercial Pilot Licence - Airplane examination.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 203; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA205",
            "Name": "Professional Pilot Program Course 5",
            "Desc": "This course continues from AVIA 204 and provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete a solo cross-border flight to the United States as well as a dual flight into a grass field. Students also complete a check-out in a glass cockpit aircraft and work on acquiring cross-country Pilot-in-Command time. Preparation for the Commercial Pilot Flight Test is started during this course as well. The student will have acquired approximately 155 hours total flight time by the end of the course.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 204; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA270",
            "Name": "Remotely Piloted Aircraft Systems (RPAS) Knowledge Requirements",
            "Desc": "Students will gain knowledge about the requirements and constraints affecting recreational, commercial and research RPAS (Unmanned Aerial Vehicles [UAV], Unmanned Aircraft Systems [UAS]) flights for geomatics applications. Theory and conceptual factors affecting flight, remote sensing, and spatial analysis with very-high resolution data will be discussed. Students will gain knowledge about how to navigate regulatory requirements. They will learn how to link their science and research objectives with geomatics skills to mitigate risk and obtain regulatory approval for legal RPAS flights. Assignments provide a range of experiences to students that may include: applied aspects of flight campaign approval, setup, management; flight training; and integrating imagery with geographic information systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: GEOG 374 001 S17; AVIA 374 001 S17",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA306",
            "Name": "Professional Pilot Program Course 6",
            "Desc": "This course continues from AVIA 205 and provides the required Preparatory Ground Instruction to prepare students for the air exercises to be completed during in-aircraft instruction that is conducted as part of the course. Students will complete the Commercial Pilot Flight Test early in the course and then complete the training for the Multi-Engine Class Rating. Students will have acquired approximately 175 hours total flight time by the end of the course. This course also includes ground school to prepare students to write the Transport Canada Instrument Rating examination.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 205; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA307",
            "Name": "Professional Pilot Program Course 7",
            "Desc": "This course continues from AVIA 306 and focuses on exercises that apply knowledge of various considerations and procedures for flight in instrument meteorological conditions. Pairs of students will function as two-person flight crews during simulated IFR flights. Scenarios will enable students to recognize, avoid, or manage situations that lead to incidents. Also included is a tour of the Toronto Area Control Centre. The flight portion focuses on acquiring cross-country Pilot-in-Command time to meet the requirements for the Instrument Rating. This course also includes ground school in preparation for students to write the Transport Canada IATRA examination and training in wilderness survival and First Aid skills.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 306; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA310",
            "Name": "Human Factors in Aviation",
            "Desc": "An exploration of aviation non-technical skills and their impact on aviation safety and operational performance. Components explore workload, management, situational awareness, decision-making, and crew co-ordination.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 100; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA374",
            "Name": "Special Topics in Aviation",
            "Desc": "A course offered in a particular branch of aviation, subject to availability of instructor.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA408",
            "Name": "Professional Pilot Program Course 8",
            "Desc": "This course continues from AVIA 307 and completes the instruction toward the Group 1 Instrument Rating. Training will be conducted using a combination of simulator, single engine aircraft, and multi-engine aircraft. Flight in instrument meteorological conditions will be conducted whenever practicable. Any outstanding flight time requirements for the issue of the Commercial Pilot Licence will also be completed. This course completes the flight training.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 307; Geography and Aviation, Science and Aviation plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA416",
            "Name": "Aviation Sustainability",
            "Desc": "An exploration of how sustainability is sought within the international aviation industry. The course takes a cross-sectional approach to aviation, exploring sustainability within the various sectors that make up the air transport system (e.g., air law, aircraft, operations, navigation, airports, and safety). Both the positive and negative impacts of aviation upon the sustainable development goals will be analyzed through reviewing case studies and industry practices. This course includes significant student project teamwork. ",
            "Notes": "[Note: Formerly AVIA/GEOG 315]",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 100; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GEOG 474/AVIA 374 001 W18, GEOG 315/AVIA 315",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA417",
            "Name": "Aviation Safety",
            "Desc": "This course is an advanced exploration of how aviation safety is managed at the organizational level. Content will include explorations of pilot threat and error management, safety management systems (including risk analysis and hazard identification), and safety audits. The focal point of the course is on understanding the nature and causation of accidents. This course includes significant student project teamwork. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AVIA 310; Geography and Aviation or Science and Aviation students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA474",
            "Name": "Special Topics in Aviation",
            "Desc": "An advanced special topics course offered in a particular branch of aviation, subject to availability of instructor.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A Honours Aviation or Aviation Specialization students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "AVIA475",
            "Name": "Independent Studies of Selected Topics",
            "Desc": "Individual study of special topics not covered in other aviation courses. Students will not be given permission to register for this course until a faculty member has agreed to supervise the study and the student has developed a brief outline of study to be approved by the Director of Aviation.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Honours Aviation or Aviation Specialization students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}