{
    "Name": "business,entrepreneurshipandtechnology",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "BET100",
            "Name": "Foundations of Entrepreneurial Practice",
            "Desc": "Successful entrepreneurs combine intellectual rigour with innovation to create solutions that have impact. It is a process that starts with a search for \"big ideas\" using tools such as research, observation, and appreciative inquiry. Next, entrepreneurs analyze situations and apply creativity techniques to develop solutions. Finally, solutions are tested against business drivers including customer value propositions, customer identification, channel selection, and resource needs. This course covers the three steps that form the foundation of all entrepreneurial success: big ideas, solutions, and testing. Because of its broad scope, the course is valuable to students from different academic backgrounds, entrepreneurship interests, and program level. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BET210",
            "Name": "Business Technology and Infrastructure",
            "Desc": "Modern organizations increasingly rely on a technological infrastructure that informs what can be accomplished, the prospects for long-term growth, and its overall competitiveness. In this course, students will learn about underlying technologies, gain insights into planning for new technologies, evaluate existing systems, and understand the various roles and issues related to corporate information systems management. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BET300",
            "Name": "Foundations of Venture Creation",
            "Desc": "This course provides students with an introduction to the processes involved in moving an idea for a new venture from concept through to launch. The theoretical knowledge and practical skills needed to create a successful small entrepreneurial enterprise are developed. Topics include definition and evaluation of entrepreneurial opportunities, business planning, funding strategies and early-stage revenue models, legal issues and intellectual property protection. [Offered: F, W, S]",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET320",
            "Name": "Entrepreneurial Strategy",
            "Desc": "Once your \"big idea\" has been formulated, what is the best way to realize its potential? With whom should you partner? How do you protect your intellectual property? What is the optimal business model? The objective of this course is to provide an understanding of the commercialization process, with a specific focus on assessment of opportunities and development of an entrepreneurial business plan. Course content includes the importance of strategic partnerships, understanding the bases of competition, conducting industry and market level analyses, evaluating innovative ideas for commercial potential, business planning in a corporate context, intellectual property strategy, and strategic tools needed for launching new ideas. ",
            "Notes": "[Note: It is recommended that students should take BET 100 prior to this course. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET340",
            "Name": "Essentials of Entrepreneurial Planning and Execution",
            "Desc": "Entrepreneurial success starts with finding a solution to a problem and then creating the right strategy to bring it to market. The final step in the process is explored in this course, the disciplined execution of strategy. A broad range of skills are required to do this including understanding founder and team dynamics, hiring and firing, cash flow management, project management, developing suitable equity structures and compensation, pitching, fundraising, internal and external communications, and people skills. This course explores the business skills and knowledge needed to take a new venture, whether it is a start-up or part of an existing organization, from strategy to market. ",
            "Notes": "[Note: It is recommended that students should take BET 100 and BET 320 prior to this course. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET350",
            "Name": "Customer Experience Design",
            "Desc": "In this course, entrepreneurial students will learn the principles and tools of customer experience (CX) design and how developing an exceptional experience for the customer fits into an overall business strategy. Not only will students develop a conceptual understanding of user experience and user-centered design, they will also learn how to deeply understand the needs of the customer and develop engaging and innovative products and services. Topics include visual design principles, design thinking, user experience research, experience mapping, sketching and storyboards, interactive prototypes, and usability testing. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET360",
            "Name": "Design Frameworks for Social Ventures",
            "Desc": "In this course, students will explore several design frameworks as they relate to complex problems; assess the impacts of these frameworks in recent entrepreneurial applications; and determine how to apply these concepts in the design of the social impact aspects of ventures and cross-industry collaborations. In parallel, students will be encouraged to develop skills, reflect on their own mindsets, and further their learning through workshops and studio sessions.  Several frameworks will be explored, including human centred design, life centred design, equity centred design, and inclusive design. [Offered: S, first offered Spring 2023]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET400",
            "Name": "Marketing Foundations for Early-stage Ventures",
            "Desc": "This course develops the theoretical knowledge and practical skills needed to develop a marketing strategy for early-stage ventures. Topics include managing product development, marketing and brand development, segmentation and targeting, competitor analysis, and positioning. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET411",
            "Name": "Milestone Planning and Execution",
            "Desc": "This course, taken concurrently with a capstone project or entrepreneurial milestone, consists of workshops, seminars, and online content. Topics can include goal setting and project planning, team building, understanding your competitive landscape and customers, patents and patent searches, commercialization options and developing a business model, legal issues, creating a business case for the capstone project, presentation skills and \"pitching\", post-mortem and root cause analysis. ",
            "Notes": "[Note: Students interested in this course are responsible for finding an instructor willing to supervise it. Course plans must be approved by the Entrepreneurship Minor/Option academic co-ordinator.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET412",
            "Name": "Advanced Topics in Entrepreneurship",
            "Desc": "This course will be taken by students in the corporate entrepreneurship track of the Entrepreneurship Minor, and approved by the program co-ordinator in order to meet the experiential component requirements in the minor with special projects as assigned. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Enrolled in Entrepreneurship Minor",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET420",
            "Name": "Entrepreneurship for Social Impact",
            "Desc": "This course explores how innovative approaches can address social problems, create organizations that make positive change, have significant social impact, and be sustainable and economically viable. Topics include the principles of social entrepreneurship, design thinking applied to identifying significant problems, innovative solutions for social impact, and identifying opportunities for social change. Students develop skills and tools for refining and implementing their ideas as well as measuring the success and value of mission-driven organizations. Through case studies, lectures, and workshops, students also develop skills in strategic thinking with a socially conscious business mindset to create high-impact ventures. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET430",
            "Name": "Sales Fundamentals",
            "Desc": "The one thing every new venture needs whether small or large, not-for-profit or for-profit, startup or part of an already mature business, is sales. This course is designed to help create and grow a successful business venture through personal marketing and sales efforts. Coursework examines key sales technologies, networking techniques, the use of marketing in sales, the sales process, and assessing the value of a particular sale from both the perspective of customer impact and the financial and strategic impact on the organization. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET450",
            "Name": "Leadership",
            "Desc": "Leaders make things happen. Leaders make things possible. This course explores the relevant concepts, theories, and skills needed to lead successfully in any environment, from new ventures to change management in large corporations, government, and not-for-profits. Course topics include leadership and followership, group and team dynamics, change management, interpersonal dynamics, and supporting leadership skills such as self-awareness, conflict management, and communications. Course topics will be enriched through a critical study of leadership exemplars in popular media. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: MSCI 411, COMMST 204, 227",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET460",
            "Name": "Business Negotiations",
            "Desc": "We negotiate every day with potential employers, coworkers, merchants, service providers, customers, and suppliers. Negotiation is the art and science of securing agreements between two or more independent parties. It is a craft that must hold co-operation and competition in creative tension, and even the most experienced negotiators often fall prey to common biases and errors in judgment. This course is highly experiential; therefore, students will practice, reflect, analyze, and practice again. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET470",
            "Name": "Family Business",
            "Desc": "This course explores the business practices needed to manage, run, and work for family-owned ventures. The focus will be on those issues unique to family-businesses such as the interaction between family, management, and ownership. Family-controlled businesses are also characterized by challenges that put their continuity in serious jeopardy; and leadership and succession crises are the norm. Topics include, but are not limited to, the strengths and weaknesses of family businesses, managing family-business conflict, succession planning, professionalization, communication, new opportunity development, and strategic planning. ",
            "Notes": "[Note: Course offered when resources permit.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BET580",
            "Name": "Consulting",
            "Desc": "This course is useful for anyone considering working as a consultant, either for a consulting firm, as an independent entrepreneurial consultant, or as an internal consultant to large organizations. Some of the competencies skilled consultants have include understanding business needs from a holistic perspective, developing innovative ideas, expert people skills, influence, and change management. Course topics may also include key stages in the consulting process, issue diagnosis, managing difficult clients, consulting frameworks, analytical approaches to solving complex problems, engagement management, building a consulting toolset, change management processes, negotiation, and advanced presentation techniques. We will also cover aspects of the business of consulting. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}