{
    "Name": "biology",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "BIOL110",
            "Name": "Biodiversity, Biomes, and Evolution",
            "Desc": "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests). Through a lens of evolution this course focuses on how life has adapted to physical conditions, interactions with neighbouring organisms, and the influence of flora and fauna on the world we inhabit. Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species. Developing hypotheses, collecting and analyzing data, and determining how to best communicate results will be carried out. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Faculty of Environment students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL130",
            "Name": "Introductory Cell Biology",
            "Desc": "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms. ",
            "Notes": "[Note: BIOL 130L may be required for entrance to certain professional/graduate programs. Offered: F,W]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL130L",
            "Name": "Cell Biology Laboratory",
            "Desc": "Experiments to study the principles of cell biology that are elaborated in BIOL 130.  [Offered:  F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: BIOL 130.",
            "Antireqs": " Antireq: BIOL 230",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL150",
            "Name": "Organismal and Evolutionary Ecology",
            "Desc": "This course provides students with an introduction to the basic principles of scientific reasoning, ecology, and evolution. Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: BIOL 251",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL165",
            "Name": "Diversity of Life",
            "Desc": "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.  Current ideas on classification and phylogeny will be compared with traditional schemes.  Morphology, ecology, and economic uses of representative Phyla and Divisions will be discussed. [Formerly BIOL 265. Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL201",
            "Name": "Human Anatomy",
            "Desc": "This course takes a systems approach to study the structure of the human body and its relationship to function. [Formerly BIOL 301; Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL211",
            "Name": "Introductory Vertebrate Zoology",
            "Desc": "An introduction to the structure, evolution and development of vertebrate organ systems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL220",
            "Name": "Introduction to Plant Structure and Function",
            "Desc": "An introduction to plant diversity, and the anatomy and physiology of vascular plants. The course will include a description of major cell and tissue types, and their organization in roots, stems, and leaves. Topics such as the processes of water and ion uptake, photosynthesis, long distance transport, and growth regulation will also be covered. ",
            "Notes": "[Note: Formerly BIOL 120; Offered: W]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: BIOL 120",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL225",
            "Name": "Plants and Civilization",
            "Desc": "This course examines the importance of plants and the role they have in the local and global community. It introduces students to the impact of plants on the past, present and future of human civilization and describes the importance of plants as sources of food, medicine, fuel, shelter, clothing and psychoactive agents. Topics include medicinal plants and human health, the origin of agricultural crops, plants that changed the course of history, plant-based biofuels, the green revolution, plant biotechnology and genetic engineering of plants. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL239",
            "Name": "Genetics",
            "Desc": "Mendelian genetics. Chromosomal mechanisms in mitosis and meiosis. The origin, inheritance and adaptive significance of chromosomal changes. Nucleic acids as the carriers of genetic information. Natural selection and the evolution of genetic systems. [Formerly BIOL 139. Offered: W,S; online F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BIOL240",
            "Name": "Fundamentals of Microbiology",
            "Desc": "Introduction to the biology of bacterial and archaeal organisms. Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity. ",
            "Notes": "[Note: BIOL 240L must be completed before taking BIOL 241. BIOL 240L may be required for entrance to certain professional/graduate programs. Formerly BIOL 140. Offered: F; online W, S]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BIOL240L",
            "Name": "Microbiology Laboratory",
            "Desc": "Experiments to study the principles of microbiology that are elaborated in BIOL 240.  [Formerly BIOL 140L. Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: BIOL 140/240",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL241",
            "Name": "Introduction to Applied Microbiology",
            "Desc": "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology. Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants. Topics in medical microbiology include concepts of immunology and host-parasite relationships. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240 and 140/240L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL251",
            "Name": "Fundamentals of Ecology",
            "Desc": "This course provides students with an introduction to the breadth of the ecology discipline. It covers hypothesis testing and the nature of scientific inquiry, organismal, population, community, and ecosystem levels of ecology. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110 or 2A Faculty of Environment students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 150",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL266",
            "Name": "Introduction to Computational Biology",
            "Desc": "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems. Labs will include practical experience applying computational tools to biological problems. ",
            "Notes": "[Note: Formerly BIOL 366. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 366",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL273",
            "Name": "Principles of Human Physiology 1",
            "Desc": "The physiology of major organ systems of the human body. Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system. The combination of BIOL 273 and BIOL 373 covers all of the major topics of human physiology. ",
            "Notes": "[Note: BIOL 373L may be required for entrance to certain professional/graduate programs. Offered: F, W and online S]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BIOL280",
            "Name": "Introduction to Biophysics",
            "Desc": "Introduction to a physical understanding of biological systems at macro and molecular scales. The course is intended for second-year science and engineering students and will cover a broad spectrum of topics in biophysics, as well as an introduction to neurobiology, nanotechnology, and biotechnology. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Honours Science or Engineering plans",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL302",
            "Name": "Functional Histology",
            "Desc": "A hierarchical approach to biological structure with an emphasis on functional morphology.  Starting with the cell, the fundamental unit of structure and function, the material progressively develops how cells organize to form tissues such as epithelium, connective tissue and muscle.  Emphasis on how these tissue building blocks cooperate to form the major organs and organ systems of the human body. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 273",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL303",
            "Name": "Introductory Developmental Biology and Embryology",
            "Desc": "Fundamental processes and concepts in embryonic development including the acquisition of multicellularity, organization of the early embryo, morphogenesis of tissues, major organ systems, fetal membranes, growth, differentiation, and analysis of common developmental defects. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 139/239",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL308",
            "Name": "Principles of Molecular Biology",
            "Desc": "Prokaryote and eukaryote genome structure and replication; mechanisms of gene expression and regulation. ",
            "Notes": "[Note: BIOL 240 is recommended. BIOL 308 is recommended for those wishing a general understanding in molecular biology. Students intending to take several upper year molecular biology courses are advised to take BIOL 308 and BIOL 309 concurrently. BIOL 308 is required as a prerequisite for the following courses: BIOL 331, 403, 428, 431, 434, 438, 441, 442, 448. Offered: F, S]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 139/239",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL309",
            "Name": "Analytical Methods in Molecular Biology",
            "Desc": "An introduction to molecular methods used to analyze the structure of genes and genomes, including DNA sequencing, cloning, restriction mapping and bioinformatic tools. Techniques to monitor transcript and protein abundance, protein-protein and DNA-protein interactions will also be covered. ",
            "Notes": "[Note: BIOL 240 is recommended. BIOL 309 is recommended for students intending to take upper year molecular biology courses.  BIOL 309 is a required prerequisite for: BIOL 331, 342, 335L, 428, 431, 434, 438. Formerly BIOL 208. Offered: F,S]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 139/239",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL310",
            "Name": "Invertebrate Zoology",
            "Desc": "The diversity of invertebrate animals will be explored in this class. Topics covered will include reproduction, development, life history, feeding, locomotion, and behaviour. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110 or 165",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL312",
            "Name": "The Natural History of Aquatic Organisms",
            "Desc": "This course will introduce students to the diversity of freshwater organisms and their habitats. Emphasis will be placed on sampling techniques, taxonomic identification, life histories, and adaptations to aquatic environments. The course will introduce students to the use of aquatic organisms in environmental impact and biodiversity assessments. Students must be prepared to work outdoors in potentially inclement weather. ",
            "Notes": "[Note: A field trip fee of $60 is required toward the cost of transportation; Offered: S]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110 or 165; BIOL150 or 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL323",
            "Name": "Plant Physiology",
            "Desc": "A study of plant physiological processes with an emphasis on the role of key metabolic pathways in plant growth and development. Topics such as photosynthesis, nitrogen assimilation, growth regulators, mineral nutrition, water relations, and stress physiology will be covered.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 120/220, 130",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL325",
            "Name": "Flowering Plants",
            "Desc": "A study of floral morphology in relation to classification and evolution. An introduction to taxonomy and nomenclature. History of taxonomy. Systems of classification. Mechanisms of pollination. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL331",
            "Name": "Advanced Cell Biology",
            "Desc": "The functional organization of cells with particular reference to cell-cell interaction, the structure, function and development of organelles and the biological roles of cellular membranes. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 308 or 309; CHEM 233 or 237; (BIOL 308 or BIOL 309) and co-req CHEM 233 or CHEM 237 for Science and Business/Biotechnology Specialization or Honours Biotechnology/Economics or CS Honours Bioinformatics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL335L",
            "Name": "Molecular Biology Techniques",
            "Desc": "Selected experiments to provide students with a range of laboratory skills in recombinant DNA technology. ",
            "Notes": "[Note: Students in the Molecular Biology and Biotechnology Specialization are encouraged to take this course unless they have previous laboratory experience involving molecular biology techniques. Offered: F,W]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 240L.",
            "Coreqs": " Coreq: BIOL 309",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL341",
            "Name": "Fundamentals of Immunology",
            "Desc": "This course will provide students with an understanding of the fundamental concepts of the vertebrate immune system. Topics will focus on the components of the immune system, innate and adaptive immunity, immune cell development, communication, and recognition of non-self leading to an\nimmune response. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140/240L, (241 or 273).",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 441 prior to Spring 2015",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL342",
            "Name": "Molecular Biotechnology 1",
            "Desc": "Molecular biotechnology applies the principles of recombinant DNA technology (genetic engineering, gene cloning) to the development of commercial products. The methods of recombinant DNA technology, molecular diagnostic systems for detecting diseases and transgenic organisms will be discussed. ",
            "Notes": "[Note: Recommended prerequisite BIOL 241.  It is recommended that BIOL 342 be taken after completion of second year. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, BIOL 208/309",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL345",
            "Name": "Microorganisms in Foods",
            "Desc": "Food preservation, spoilage, poisoning and modern concepts in quality assurance programs are studied. The aim is to understand factors governing microbial changes in foods. Problem solving in the food industry is emphasized. Laboratory work will reflect current practices in quality control and testing. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL346",
            "Name": "Microbial Ecology and Diversity",
            "Desc": "Examples from terrestrial and aquatic ecosystems, and plant- and animal-associated environments, will be used to illustrate the activities and diversity of microorganisms in these habitats. The importance of the ecological roles of microbes to aspects of agriculture, geochemistry, human biology, and the biology of extreme environments will be considered. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL348L",
            "Name": "Laboratory Methods in Microbiology",
            "Desc": "Selected experiments to provide students with a range of laboratory skills in microbiology. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL349",
            "Name": "Synthetic Biology Project Design",
            "Desc": "Synthetic biology involves developing new approaches, based on engineering principles, for genetic engineering of biological systems. Students will prepare a comprehensive research proposal for a synthetic biology project of their own design, under the supervision of a faculty member. Attendance at a weekly journal club focused on synthetic biology will be mandatory. [Offered: F,W,S].",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL350",
            "Name": "Ecosystem Ecology",
            "Desc": "This course provides an overview of the dynamic interactions among microbes, plants, animals and their physical environment with emphasis on ecosystem structure and function. Topics include the hydrological cycle, biogeochemical cycling, ecological energetics, roles of population and community interactions, paleoecology and current topics in ecosystem science. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 150, 251, ENVS 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL351",
            "Name": "Aquatic Ecology",
            "Desc": "Study of the structure and function of lake and stream ecosystems. The course emphasizes biological components and processes, but includes the origin and nature of lake and stream systems and the fundamentals of surface water chemistry and physics. Human influences, management options and current issues will be examined with readings and project work. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251; One of BIOL 110, 120/220, 165",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL354",
            "Name": "Environmental Toxicology 1",
            "Desc": "An introduction to the basic theories, principles and techniques of environmental toxicology. A comparative study of the effects of specific groups of toxicants on ecosystems; biodegradation and cycling. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of CHE 102, CHEM 120, 121",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL355",
            "Name": "Biology of Human Aging",
            "Desc": "An overview of current aspects of the biology of human aging and the functional changes associated with both normal aging and pathological problems often present in the elderly. Biological theories of aging and normal age-related structural and physiological changes on all of the major body systems will be discussed.  Extrinsic factors such as diet and exercise and their role on the aging process will be examined as well as various medical treatments. [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL359",
            "Name": "Evolution 1: Mechanisms",
            "Desc": "A study of the processes of evolution; the differentiation of populations and the origin of new forms of life. [Offered: F, W; online S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 139/239 or Level at least 3A Environment and Resource students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "BIOL360",
            "Name": "Evolution 2: Fossil Record",
            "Desc": "An overview of the origin of life, how it evolved and diversified, modern principles of paleontology with particular emphasis on analytical tools to interpret ancient life forms. Patterns, processes of evolution and paleoecology of key groups of microfossils, invertebrates, plants, vertebrates and their trace fossils.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 121, CIVE/ENVE/GEOE 153, BIOL 359",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL361",
            "Name": "Biostatistics and Experimental Design",
            "Desc": "An introduction to hypothesis testing and experimental design in biology. Topics will include exploratory data analysis, analysis of variance, categorical data analysis, correlation, linear regression, multiple linear regression, power analysis, visualization tools, and statistical software. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of STAT 202, ECON 221, ENVS 278.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSYCH 391, STAT 332",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL364",
            "Name": "Mathematical Modelling in Biology",
            "Desc": "An introduction to the mathematical modelling of biological processes using a variety of techniques including linear difference models, ordinary differential equations, and Markov models. Modelling applications ranging from genetics to ecosystem biology will be addressed. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of  MATH 116,127,137,147; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL365",
            "Name": "Methods in Bioinformatics",
            "Desc": "This course covers bioinformatics methods with an emphasis on analysis of high-throughput `-omics' data. Topics include analysis of genome-scale gene and protein expression, construction of species and gene trees from molecular sequence data, and analysis of biological systems using bioinformatics tools. Included will be practical experience with bioinformatics tools and datasets.\n[Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 239; One of BIOL 266, CHEM 140, CS 116, CS 136",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL370",
            "Name": "Comparative Animal Physiology: Environmental Aspects",
            "Desc": "A comparative study of salt and water balance, circulation, respiratory systems, nitrogenous excretion, and mechanisms of energy acquisition and metabolism in animals. Adaptations to different environments will be emphasized. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110 or 211; BIOL 273",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL371",
            "Name": "Comparative Animal Physiology:  Evolutionary Themes",
            "Desc": "A comparative study of neural, sensory, endocrine, digestive, and reproductive strategies across animal taxa. The emphasis will be on evolutionary themes at the organismal, cellular, and molecular levels. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110 or 211; BIOL 273",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL373",
            "Name": "Principles of Human Physiology 2",
            "Desc": "The physiology of major organ systems of the human body. Topics include the central nervous system, the sense organs, the digestive system, the endocrine system, the reproductive system, and the excretory system. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL373L",
            "Name": "Human Physiology Laboratory",
            "Desc": "Laboratory exercises to study the principles of human physiology. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: BIOL 373.",
            "Antireqs": " Antireq: BIOL 273L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL376",
            "Name": "Cellular Neurophysiology",
            "Desc": "This course gives students background in neuronal signaling, ion channels, and methods in electrophysiological recording methods. The course requires completion of neuro-simulation laboratories, which provide an introduction to biophysical modelling to explain the functions of neural systems. ",
            "Notes": "[Note: PHYS 111/112 are recommended; Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 273, BME 284, PSYCH 261, SYDE 384/584",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL382",
            "Name": "Computational Modelling of Cellular Systems",
            "Desc": "An introduction to dynamic mathematical modeling of cellular processes.  The emphasis is on using computational tools to investigate differential equation-based models.  A variety of cellular phenomena are discussed, including ion pumps, membrane potentials, intercellular communication, genetic networks, regulation of metabolic pathways, and signal transduction. [Offered in the W of even numbered years.]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 118, 119, 128, 138, 148; Third year standing in an Honours plan",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL383",
            "Name": "Tropical Ecosystems",
            "Desc": "This course examines the fundamental concepts of terrestrial ecosystems in tropical climates. The course has three sections: (1) biophysical aspects (climate, location, landforms, soil, vegetation), (2) tropical resource systems (forest- and agroecosystems) within the framework of conventional and sustainable resource extraction, and (3) current conservation issues. Case studies are presented.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 150, 251, ENVS 200, ERS 218",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL403",
            "Name": "Advanced Topics in Developmental Biology",
            "Desc": "This course explores the cellular and molecular basis of developmental phenomena in animals. Lectures will emphasize the experimental basis for both historical and contemporary knowledge with a focus on the major developmental systems in model organisms. Course content will concentrate on themes that permeate current published research. ",
            "Notes": "[Note: BIOL 208/309 is recommended as a prerequisite. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 303, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL414",
            "Name": "Parasitology",
            "Desc": "This course will explore how parasites affect their host(s) and interact with other parasites. Attention will be given to eukaryotic parasites impacting human and domestic animal health. Public measures of parasite control will be covered.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 110, 359",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL428",
            "Name": "Plant Molecular Genetics",
            "Desc": "An examination of the current molecular techniques used to study plant development physiology. Topics include mutant isolation, transcript and metabolite profiling, gene silencing and protein localization. ",
            "Notes": "[Note: BIOL 120/220 is recommended; Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 309",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL431",
            "Name": "Bacterial Molecular Genetics",
            "Desc": "Bacterial molecular biology with an emphasis on the use of genetic tools to study the biology of microorganisms. Topics include mutagenesis, conjugation, recombination, gene regulation, plasmids, transposons, bacteriophage and genomics. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140/240L, 208/309, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL432",
            "Name": "Molecular Biotechnology 2",
            "Desc": "How recombinant DNA technology is used to produce vaccines, pharmaceuticals, crop plants, and other commercial products will be discussed. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 342",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL433",
            "Name": "Plant Biotechnology",
            "Desc": "Biotechnological approaches and their applications in plant genetic manipulation, transformation and cell culture for plant improvement, propagation, and biochemical production. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 120/220, 130, 239; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL434",
            "Name": "Human Molecular Genetics",
            "Desc": "Recent advances in human molecular genetics will be examined with emphasis on how human disease-causing genes are mapped, identified, isolated and characterized. Examples will draw from research on Duchenne muscular dystrophy, Huntington disease, cystic fibrosis, Alzheimer disease, cancer, vision defects and other disorders. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 208/309, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL438",
            "Name": "Molecular Biology of Animal Development",
            "Desc": "An examination of the current major issues in the regulation of gene expression during animal development with emphasis on technical and conceptual advances. Current research literature will be reviewed. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 208/309, 303, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL439",
            "Name": "Environmental and Natural Products Biochemistry",
            "Desc": "This course deals with the functions, distribution and environmental ramifications of natural compounds produced by plants and other biological systems. Natural products are those compounds usually described as secondary metabolites, i.e. those apparently non-essential products whose physiological and ecological functions are either obscure or are of peripheral importance to the organism. However, many of these non-essential products have profound competitive, economic and pharmacological significance; and as research proceeds, their physiological roles within the parent organisms are becoming clearer. As well, this course has a strong emphasis on how environmental chemical and physical processes impact on living organisms and their biochemistry. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHEM 233 or 237; CHEM 264 or 266",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL441",
            "Name": "Advances in Immunology",
            "Desc": "A survey of the recent advances in the vertebrate immune response; the cells and tissues of the lymphoid system; humoral and cell-mediated  immunity; initiation and regulation of the immune response; the immune system and disease, emerging techniques used in immunology. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 308, 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL442",
            "Name": "Virology",
            "Desc": "A survey of viral structures, life cycles, and the interactions of viruses with their hosts. The laboratory component will include procedures used for viral detection and titration, as well as individual library research projects. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140/240L, 241,308, 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL443",
            "Name": "Fermentation Biotechnology",
            "Desc": "Biology of industrial micro-organisms: fermentation systems; fermentation raw materials; downstream processing; biomass production; food fermentations; production of industrial chemicals, food additives, enzymes and other products by fermentation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL444",
            "Name": "Bacterial Pathogenesis",
            "Desc": "A study of the bacteria involved in pathogenesis, their mode of infection, symptoms and prevention of diseases. The laboratory will focus on identification of bacterial isolates. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241, 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL447",
            "Name": "Environmental Microbiology",
            "Desc": "A study of the environmental impact of microorganisms. Aspects of pollution, waste treatment, biodegradation of environmental contaminants, and nutrient cycling will be examined. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140L/240L, 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL448",
            "Name": "Microbial Physiology and Biochemistry",
            "Desc": "A study of the physiology of microorganisms. Provides biochemical- and molecular-level detail on the diverse structures and metabolic functions of bacterial, archaeal, and eukaryal cells. Aspects of microbial growth, nutrition, and metabolism are examined in the context of how microorganisms develop diverse solutions for meeting essential requirements for life. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 140/240, 140/240L, 241, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL449",
            "Name": "Public Health Microbiology",
            "Desc": "How the health of human populations is influenced by microbial communities. Aspects of the epidemiology of infectious diseases, factors influencing the emergence of microbial pathogens and antibiotic-resistant strains, means to control undesired microbial populations in habitats such as water, biodegradable materials and food will be discussed. Approaches to the regulation and monitoring of microbial agents will also be examined. ",
            "Notes": "[Note: It is recommended that one or more of BIOL 341, BIOL 345, BIOL 444 or BIOL 447 be taken before or with BIOL 449. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL450",
            "Name": "Marine Biology",
            "Desc": "Ecological processes and evolutionary adaptation are explored in the world's largest and most diverse ecosystems. The major ocean habitats will be characterized, stressing their importance as resources, moderators of climate and reservoirs of biodiversity. [Notes: Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL451",
            "Name": "Advanced Ecology and Evolution",
            "Desc": "Students will use scientific literature to explore and analyze a range of advanced topics in ecology and evolution at the individual, population, community, and ecosystem scales. Recent advances in understanding of fundamental concepts as well as current frontiers in the field will be examined through written reports, essays, and oral presentations.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251; BIOL 359, 361",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL452",
            "Name": "Quantitative Fisheries Biology",
            "Desc": "The practices of fisheries science including the effects of industrial fisheries on fish stocks; methods of capture, obtaining, using, and interpretation of vital statistics of fish stocks; population estimation; stock-recruitment; growth; mortality; and fecundity. Emphasis is placed on the use of statistical information for making ecological inferences about the status of fish populations. ",
            "Notes": "[Note: Familiarity with linear regression is essential. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251; STAT 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL455",
            "Name": "Ecological Risk Assessment and Management",
            "Desc": "Examination of the use of scientific information characterizing the risks posed to the environment by anthropogenic stresses. Discussions will take place in the context of aquatic ecology and presume a background of standard aquatic toxicology methods. Methods for assessing risks, including environmental impact assessment, risk quotients, national, and international risk assessment paradigms, and cumulative effects assessment will be examined. Critical connections between assessment and management will also be discussed. [Offered: F of even years]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251; BIOL 354, STAT 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL456",
            "Name": "Population Biology",
            "Desc": "The analysis of the structure and dynamics of plant and animal populations. Theoretical, mathematical and experimental approaches to the study of population ecology. ",
            "Notes": "[Note: Students are advised that this course involves computer and numerical applications. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 350; One of STAT 202, ECON 221, ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL457",
            "Name": "Analysis of Communities",
            "Desc": "A study of the organization, structure and development of communities with emphasis on vegetation change. Topics include: diversity, stability; succession; sampling procedures and multivariate analysis. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 150, 251, ENVS 200; One of STAT 202, ECON 221, ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL458",
            "Name": "Quantitative Ecology",
            "Desc": "The course addresses the integration of mathematical and statistical tools to solve problems in ecology, using examples from individual, population, community, and ecosystem scales. Coursework will explore the relationships between models, hypotheses, experiments and data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 150, 251, ENVS 200; One of STAT 202, ECON 221, ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL461",
            "Name": "Advanced Biostatistics",
            "Desc": "Advanced aspects of statistics and experimental design for biologists. Topics will include analysis of variance (factorial, hierarchical and blocking designs; fixed- and random-effects models); a-priori and a-posteriori comparisons; multivariate analysis of variance; analysis of covariance; multiple linear regression; multivariate statistics (indirect and direct gradient analysis). [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 361; Not open to students in the Faculty of Mathematics.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL462",
            "Name": "Applied Wetland Science",
            "Desc": "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology. Current issues in Canada and abroad will be examined. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 221, 322, 358, BIOL 350, 351, ENVE 375, 376.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GEOG 405",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL465",
            "Name": "Structural Bioinformatics",
            "Desc": "Analysis of proteins using structural and bioinformatics approaches. Topics include methods of protein structure determination and visualization, structure comparison and prediction, prediction of protein function and interactions, molecular dynamics, and protein design. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 266/366 or BIOL 365; CHEM 233 or CHEM 237 or BCS Bioinformatics Specialization or BMath (CS) Bioinformatics Specialization",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL469",
            "Name": "Genomics",
            "Desc": "An applied course on the computational exploration of genomes. Topics include comparative and evolutionary genomics, metagenomics, and genomics applications in health/medicine. The lab will involve analysis of genomic datasets using scripting and bioinformatic software. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 239; BIOL 266/366 or BIOL 365",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL470",
            "Name": "Methods of Aquatic Ecology",
            "Desc": "An introduction to methods used to sample and characterize the ecological structure and function of aquatic ecosystems, including basic aspects of the abiotic environment.  Field trips to lake and stream sites are combined with laboratory analysis of samples and data. While the main emphasis is on the techniques, the exercises also provide direct experience with some of the natural and anthropogenic variation observable in aquatic systems. ",
            "Notes": "[Note:  Formerly BIOL 460L. Field Trip fee of $60 is required toward the cost of transportation.Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 350 or 351",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL472",
            "Name": "Cell Biology of Human Disease",
            "Desc": "This course focuses on the nature and mechanisms of disease processes. Abnormalities in the structure and function of cells, tissues and organs that underlie disease are explored. Emphasis is placed on current research aimed at understanding the mechanisms of disease and disease therapy, covering topics including inherited disorders, cellular pathology and immunology, diabetes and cancer. [Offered F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273, 331, 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL473",
            "Name": "Mammalian Reproduction",
            "Desc": "This course will provide an in-depth coverage of reproductive biology in a range of mammalian species. Emphasis will be on the principles underlying the regulation of key reproductive processes, from the whole animal to the molecular level. Topics will include applications of these principles to human and veterinary medicine, and ethical problems posed by some reproductive technologies. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273, 373",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL475",
            "Name": "Current Topics in Microbiology",
            "Desc": "Students will explore and analyze a variety of often controversial topics in microbiology as reflected in popular culture and the current scientific literature. This course involves significant in-class group work. An essay and presentations are required. [Offered W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 241; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL476",
            "Name": "Systems Neuroscience: From Neurons to Behaviour",
            "Desc": "Systems neuroscience attempts to explain complex functions of the nervous system in terms of underlying neural circuits. The course focuses on how neural circuits analyze sensory information, form perceptions, make decisions, and execute movements, as well as contribute to high-level mental functions such as language, memory, and self-awareness. ",
            "Notes": "[Note: BIOL 376 is recommended. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 273, BME 284, PSYCH 261, SYDE 384/584.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 377",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL477L",
            "Name": "Techniques in Animal Physiology",
            "Desc": "Laboratory exercises and computer-based data collection to study the functions of the cardiovascular, respiratory, nervous, digestive, and excretory systems of vertebrates and invertebrate animals. Students will learn animal handling techniques, data collection with state of the art physiological equipment, and data analysis using computer software. Tutorials will allow students to investigate and discuss current animal physiology research topics in greater detail. [Formerly BIOL 374L. Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: BIOL 370, 371",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL479",
            "Name": "Population Genetics and Evolution",
            "Desc": "This course provides an overview of the interplay among mutation, random and non-random mating, genetic drift, gene flow, and selection within and among natural populations. Special emphasis is placed on the dynamic role these factors play in the process of population divergence, and ultimately speciation. Case studies will illustrate the application of population genetic methodology in fields such as ecology, conservation biology, and forensic sciences. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 139/239, 359",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL483",
            "Name": "Animal Cell Biotechnology",
            "Desc": "A study of the techniques and applications of animal cell culture to biotechnology. Topics include basic cell culture technique, gene modification, products of animal cell culture, large-scale productions, and tissue engineering. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 342",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL484",
            "Name": "Advanced Eukaryotic Genetics",
            "Desc": "The role of classical genetic analysis in the context of today's genomic era. Topics: meiotic recombination, meiosis, complementation analysis, chromosome aberrations, and genetic interactions.  Methods used in model eukaryotic genetic organisms such as forward and reverse genetic screens, genetic mosaics, conditional mutants, and genetic mapping will be discussed.  Examples will illustrate how genes continue to be identified using classical-based approaches in a variety of biological processes, including cell cycle progression, cancer and metastasis, learning and memory, as well as pattern formation and embryonic development.  Alternatives to traditional mutagenesis-based screens and the links between classical and molecular genetics will also be discussed.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 139/239, 308",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL485",
            "Name": "Conservation Biology",
            "Desc": "An introduction to conservation biology and the ongoing biodiversity crisis.  Topics will include the history of conservation biology and impacts on populations, communities, and ecosystems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 150 or 251; BIOL 359",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL486",
            "Name": "Glycobiology",
            "Desc": "Monosaccharides and their linkages; conformations of oligosaccharides; glycoconjugates/glycoproteins: their physiological functions and how they are synthesized; O- and N-glycosylation; receptors and lectins; glycobiology of plants, viruses and microbes; glycobiology and disease; glycans as bio-energy sources. ",
            "Notes": "[Note: BIOL 331 recommended.  Offered:  F]",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130; CHEM 233 or 237; CHEM 264 or 266",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL487",
            "Name": "Computational Neuroscience",
            "Desc": "Introduction to modelling and analysis of neurophysiological systems. Models of synaptic plasticity and learning, with focus on the similarities and differences between neuroscience and deep learning. ",
            "Notes": "[Note: For systems design engineering students: It is recommended that one of BIOL 273, 376, 377 or BME 284 or SYDE 384/584 be taken before or concurrently with SYDE 552. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: One of CS 115,135, 200; 200-level STAT course; Level at least 3B within the Faculty of Science",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL489",
            "Name": "Arctic Ecology",
            "Desc": "This course explores the unique ecology of Arctic and sub-Arctic ecosystems. Topics addressed will include postglacial history, climate, permafrost, nutrient cycling and food web structure of terrestrial, marine, and freshwater systems, plant and animal adaptations to cold, human ecology, traditional ecological knowledge, climate change, resource extraction, and other human impacts. ",
            "Notes": "[Note:  BIOL 350 recommended. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 150, 251, ENVS 200; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL490A",
            "Name": "Biology Field Course 1",
            "Desc": "A two-week field study of terrestrial, aquatic, and/or marine biology offered by the Ontario Universities Program in Field Biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. ",
            "Notes": "[Note: Field course fee: $400-$4500. A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL490B",
            "Name": "Biology Field Course 2",
            "Desc": "A two-week field study of terrestrial, aquatic, and/or marine biology offered by the Ontario Universities Program in Field Biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. ",
            "Notes": "[Note: Field course fee: $400-4500. A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL490C",
            "Name": "Biology Field Course 3",
            "Desc": "A two-week field study of terrestrial, aquatic, and/or marine biology offered by the Ontario Universities Program in Field Biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. ",
            "Notes": "[Note: Field course fee: $400- $4500. A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL490D",
            "Name": "Biology Field Course 4",
            "Desc": "A two-week field study of terrestrial, aquatic, and/or marine biology offered by the Ontario universities program in field biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. ",
            "Notes": "[Note: Field course fee: $400- $4500. A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL498A",
            "Name": "Short Biology Field Course 1",
            "Desc": "A one-week field study of terrestrial, aquatic and/or marine biology offered by the Ontario Universities Program in Field Biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. \r\n",
            "Notes": "[Note: Field trip fee: $400 - $2500.  A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL498B",
            "Name": "Short Biology Field Course 2",
            "Desc": "A one-week field study of terrestrial, aquatic and/or marine biology offered by the Ontario Universities Program in Field Biology (OUPFB). OUPFB offers a diverse array of courses annually that normally take place at off campus locations. Field courses consist of lectures, field exercises, and a small project chosen in consultation with the course instructor(s). Contact the Biology Department field course coordinator for additional information. \r\n",
            "Notes": "[Note: Field trip fee: $400- $2500 A Biology Department field course information session is held in early January of each year]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BIOL 110, 120/220; One of BIOL 150, 251, ENVS 200; STAT 202 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL499A",
            "Name": "Senior Honours Project",
            "Desc": "A senior-year research project. ",
            "Notes": "[Note:  Normally, only students attaining either a 73% or better cumulative major average or a 78% or better major average in their two most recent terms (normally 3A and 3B) will be accepted into this course. May only be taken with the permission of the BIOL 499 co-ordinator. Consult the BIOL 499 manual for details. A final grade for BIOL 499A will be submitted only after completion of 499B. Normally, BIOL 499A and 499B may not be taken concurrently without prior permission of the BIOL 499 co-ordinator]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Cumulative Major Average at least 73%; Honours Biology, Biochemistry, Biomedical Sciences, Environmental Science - Ecology Specialization, Life Physics - Biophysics Specialization only.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BIOL499B",
            "Name": "Senior Honours Project",
            "Desc": "A senior-year research project.  ",
            "Notes": "[Note:  Normally, only students attaining either a 73% or better cumulative major average or a 78% or better major average in their two most recent terms (normally 3A and 3B) will be accepted into this course. May only be taken with the permission of the BIOL co-ordinator. Consult the BIOL 499 manual for details. A final grade for BIOL 499A will be submitted only after completion of 499B. Normally, BIOL 499A and 499B may not be taken concurrently without prior permission of the BIOL 499 co-ordinator]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Cumulative Major Average at least 73%; Honours Biology, Biochemistry, Biomedical Sciences, Environmental Science - Ecology Specialization, Life Physics - Biophysics Specialization only.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}