{
    "Name": "blackstudies",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "BLKST101",
            "Name": "Foundations of Black Studies",
            "Desc": "This is an introductory course in Black studies that surveys a range of Black social, historical, and political constructions, epistemologies, institutions, and protests from around the globe. Students will examine foundational texts from the field of Black studies, which may include speeches, narratives, and media. Coursework is designed to help students survey and critically consider major theories and social movements that give rise to the academic study of Black societies and to experience contemporary institutions firsthand through site visits, participation, and observations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST102",
            "Name": "Introduction to Black Arts, Culture, and Literature",
            "Desc": "This course examines the evolution and development of Black Peoples' artistic, cultural, and literary experiences from a global perspective including art and design, theatre and performance, literature, music, spoken word, and other modes of interdisciplinary and transdisciplinary practice. Coursework is designed to immerse students in analyzing Black art, culture, and literature through intersectional, feminist, and queer lenses. The course is designed for both thinkers and creators. Students will engage in the course material through readings, viewings, and field trips around film, comics, anime, popular culture events, plus the visual and performing arts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST103",
            "Name": "Combating Racisms",
            "Desc": "This course examines historical and contemporary practices, theories, principles, figures, and allies of anti-racism. Students will learn methods of communicating and pursuing anti-racism in culture, society, and in personal and professional interracial relationships. Coursework will immerse students in recognizing language, behaviours, institutions, and discourses that maintain white supremacies and further enable racist policies and practices in North America. Students will be challenged to apply course material to real issues of racisms in local contexts and communities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST201",
            "Name": "Taking B(l)ack History",
            "Desc": "In this course students will engage in Black speculative thought by engaging such questions as: what would the world have been like if Africa had colonized Europe? What if the \"Other\" was White? How and why do these questions make the public uncomfortable, and at the same time pique curiosities about the many \"what ifs\" that could have turned history? This course will challenge students to consider a world where the power dynamics are flipped. Special consideration will be given to histories of enslavement and colonialism, with a specific focus on the Black experience in Canada.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST202",
            "Name": "Black and Free",
            "Desc": "This course focuses on how Black public figures such as artists, intellectuals, and journalists in the 19th-21st centuries create and disseminate expressions of Black freedom in the public sphere and will explore how performances of Black speech in service of Black freedom is an act of borderless belonging.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST203",
            "Name": "Introduction to Anti-Racist Communication",
            "Desc": "This course surveys the rhetorical strategies of both more recent and historical civil rights and anti-racist activists. Students will use Black rhetorical theory and will examine work by international historical figures such as Franz Fanon, Aime Cesaire, Edouard Glissant, Albert Memmi, and Mohandas Gandhi, Frederick Douglas, WEB Dubois, Martin Luther King, Fannie Lou Hamer, Malcolm X, Angela Davis, Stokely Carmichael, Fred Hampton, Robert Hill, and Walter Rodney and such recent figures as Kimberle Crenshaw, Robyn Maynard, Brittney Cooper, Desmond Cole, Feminista Jones, Rinaldo Walcott, and Idil Abdillahi. The objective for students is to understand the evolution of liberatory, anti-racist rhetoric and the rhetorical successes and failures of key anti-racist activists.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, 102, 103; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST210",
            "Name": "Language, Life, and Literature in the Caribbean",
            "Desc": "This course introduces students to the ways in which language shapes and sustains various forms of cultural expressions in the Caribbean region. Students will use the creative output of storytellers, poets, DJs, and playwrights as a lens to investigate and trace the evolution of a distinctly Caribbean identity from the post-colonial period (1960s) up to the present. Students are also introduced to the social dynamics of Creole language use in the Caribbean and an exploration of the ways in which these languages are implicated in diverse cultural art forms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST224",
            "Name": "Black Performance Studies",
            "Desc": "This course explores the genealogies and historical development of Black performance created in regions such as North America, the Caribbean, Africa, and Europe. Students will examine the influences of key artists and theorists. Students will be challenged to apply historical, political, and cultural contexts to the analysis of audio, text-based, and/or audio-visual materials. This course expands students' concepts of Black performance to include performative modes such as performance poetry, TV shows, music, and podcasts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST230",
            "Name": "Black Feminisms",
            "Desc": "Through the sustained and in-depth study of foundational Black feminist organizers, activists, artists, theorists, and public figures, this course will analyze the interconnected themes of race and gender. Students will examine the meaningful ways that Black women have shaped feminist studies, gender studies, art, popular culture, civic, and social movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST240",
            "Name": "Black Diasporic Lives: 1740-1900",
            "Desc": "An introduction to cultural productions of the Black diaspora pre-1900, with an emphasis on political writing, memoir, fiction, and journalism. Students will engage works from a variety of regions, situated in their historical and cultural contexts, even as connections will be drawn to later social movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST244",
            "Name": "Introduction to Black Canadian Writing",
            "Desc": "An analysis of Black writing and cultural achievement in Canada. Theoretical and literary texts will be studied to explore how contributions from this field have helped to shape Canada from the 18th century to the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST302",
            "Name": "Strategic Management of Black Enterprises",
            "Desc": "Current real-world challenges in the strategic management of start-ups, technological innovation, and social enterprises are addressed through the lens of Black studies. Students will work collaboratively to address the topics to be pursued, including both cultural and business/economic aspects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 103; BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST303",
            "Name": "Black Anti-Racist Consulting Practices",
            "Desc": "Using Canada and the United States as its context, this course will explore the historical outcomes and future opportunities for North America's growing diversity at work, in the classroom, and in society. Students will learn to conduct assessments of their own and others' attitudes about cultural competency and racial differences and to develop materials that can be used to promote cross-racial understandings. Special attention may be given to issues of miscommunication across racial, social, cultural, ethnic, economic, and historic barriers within workplaces and school environments. Students will also explore various approaches used to mitigate ethno-racial differences including intercultural fluency, diversity, anti-oppression, and anti-racism training.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 103; BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST304",
            "Name": "Pan-African Global Politics",
            "Desc": "This course examines Africa's role in international order and offers an in-depth study of the evolution of Africa's global political relations. Engaging with concepts related to political and economic underdevelopment, post coloniality, and early Pan-African political thought and practice, students will be challenged to develop and apply an historical understanding of Africa's past political relations to analyses of contemporary African multilateralism, global Pan-Africanism, and increased political and economic engagement with world nations. Students will engage with current concepts of Pan-African politics and envision prospects of future Black global leadership.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST308",
            "Name": "Writing Anti-Racism",
            "Desc": "In this course students will be introduced to counterstory as research method, genre, and organizing rhetoric within anti-racist movements. Students will examine counterstory in the context of Critical Race Theory and read classic counterstories by figures such as Derrick Bell, Patricia Williams, Richard Delgado, Bryan Brayboy, Tomson Highway, and Lee Maracle. Course activities will challenge students to assess and assert the value and truth of the Black lived experience, Black epistemologies, and Black knowledge production, including that of Black Canadians and their Indigenous and Allies of Colour. Students will write, workshop, revise, and publish their own actionable anti-racist commitments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103, BLKST 203; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST309",
            "Name": "Blackness at the Intersections ",
            "Desc": "This course examines intersectionality as a theoretical framework, a methodological approach, and a tool for activists. Students will learn to interrogate the complex and varied ways that intersectionality has been used by scholars and activists to understand the relationships among intersecting forms of marginalization and privilege, as well as its limitations. Students will explore how gender, disability, racialization, language, sexuality, sex, class, and nation articulate and co-constitute one another. Students will be challenged to apply course concepts to thinking about the complexities of identity formation beyond the language of intersectionality, and to discover what individuals, communities, and societies lose and gain in the pursuit.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST310",
            "Name": "Topics in Black Language and Linguistics",
            "Desc": "This course focuses on the formal linguistic, sociolinguistic, and communicative aspects of either a single Black language or a combination of Black languages or language varieties spoken within the contemporary African diaspora, e.g., in Africa, the Caribbean, Canada, or the United States. Attention will be given to the ways in which Black language has developed, how it is deployed by speakers and writers, and attitudes and debates about Black language use in culture, education, and society. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, 102, 103; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST317",
            "Name": "Afro-Latin America",
            "Desc": "The African diaspora is central to understanding the historical development and contemporary expressions of Latin American identity. Through the study of historical events, cultural production, and current affairs, this course examines African cultural legacies in Latin America, and explains the economic, societal, and political challenges faced by Afro-Latin Americans today. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST330",
            "Name": "Black Queer Studies",
            "Desc": "This course examines a range of historical and contemporary issues, texts, movements, and figures of Black lesbian, gay, bisexual, transgendered, gender non-conforming, non-binary, intersexed, and two-spirited people. Students will be immersed in the groundbreaking work of the late 20th and 21st centuries to develop the field of Black queer studies. Students will be introduced to such topics as Black queer life, Black queer literature and the pedagogical implications of Black queer studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST380",
            "Name": "Black Theatre in Practice",
            "Desc": "A workshop that explores the history, dramatic literature, and performance of Black theatre artists. Students will explore the relationship of Black theatre to artistic and public life. Special attention may be given to specific issues, periods, locations, and genealogies of Black theatre. Students will create performance pieces.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST399",
            "Name": "Special Topics in Black Studies",
            "Desc": "A seminar course investigating special issues related to Black studies. Content may vary from year to year. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103; Level at least 3A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST410",
            "Name": "African American Rhetoric",
            "Desc": "This course examines the artistic, cultural, political, and disciplinary histories of African American rhetoric, discourse, and persuasion. Students will study various genealogies of African American rhetoric through primary texts such as dialogues, essays, folklore, music, song lyrics, dance, interviews, news stories, raps, videos, and speeches by African Americans. Special attention will be given to the economic, gendered, and social conditions of African Americans from the enslavement period in North America to the present, as well as to the Black diaspora.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103; Level at least 3A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST421",
            "Name": "The Black Atlantic",
            "Desc": "Using a number of Black studies' approaches, including Black Feminist Theory and Critical Race Theory, students will explore the diverging and converging histories of Black people(s) in the \"Atlantic\" and examine the diachronic realities of the Black Self in the 21st century.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103; Level at least 3A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BLKST499",
            "Name": "Black Entrepreneurial Enterprises",
            "Desc": "This workshop addresses the formulation of firm-wide strategic plans (e.g., business cases, marketing plans) for start-ups, technological innovations, and social enterprises. Special emphasis will be given to the local ecosystem of Black entrepreneurship. This course involves significant group work as well as a completed special capstone project.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 302; Level at least 3A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}