{
    "Name": "biomedicalengineering",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "BME101",
            "Name": "Communications in Biomedical Engineering-Written and Oral",
            "Desc": "This course introduces first-year students to biomedical engineering with a focus on the engineering profession and technical communication skills. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME101L",
            "Name": "Communications in Biomedical Engineering-Visualization",
            "Desc": "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 101L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME102",
            "Name": "Seminar",
            "Desc": "Biomedical engineering first-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME121",
            "Name": "Digital Computation",
            "Desc": "The key skills necessary to develop software solutions to solve biomedical engineering problems. Topics include software development, software design, programming language syntax, object oriented programming, structured programming, arrays, matrices, pointers, and algorithm efficiency. The topics will be reinforced in the context of practical biomedical software systems such as physiological monitoring systems and clinical support systems.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 121",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME122",
            "Name": "Data Structures and Algorithms",
            "Desc": "Topics of structured software design, data structures, abstract data types, recursive algorithms, algorithm and data structure analysis and design from both computational and memory perspectives, lists, stacks, queues, trees, graphs, sorting and searching, hashing, and problem-solving strategies. Embedded programming in health monitoring systems and healthcare management systems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 223",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME161",
            "Name": "Introduction to Biomedical Design",
            "Desc": "Topics related to biomedical design will be covered: multidisciplinary system design, design process, problem definition, life-cycle design, design specification, function analysis, design evaluation and decision-making, introduction to mechanical design, prototyping, experimentation, safety and responsibility in engineering design, design for society and environment, and design documentation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 161",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME162",
            "Name": "Human Factors in the Design of Biomedical and Health Systems",
            "Desc": "Design of human-machine environments, designing for patient safety and reduce human error in decision-making, analytical methods of determining user needs, information processing and human sensory processes and consideration of these elements in the design of systems with humans, and consideration of human physical capabilities in ergonomic design. Topics will be reinforced in the context of the design of prosthetics or rehabilitation devices. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 162",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME181",
            "Name": "Physics 1: Statics",
            "Desc": "Introduction to the basic theory and principles of mechanics of static systems. Topics covered include statics of particles, rigid bodies and force systems, equilibrium of rigid bodies, analysis of joints and frames, distributed forces, centroids and moments of inertia, and friction. Applications of mechanical principles to musculoskeletal systems will be presented. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 181",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME182",
            "Name": "Physics 2: Dynamics",
            "Desc": "The science of motion is taught with initial focus on particles, and then progressing to planar rigid body systems. Concepts such as inertia, momentum, work, energy, Newton's laws, and contact dynamics are covered, with particular application to human motions (e.g., walking, running, jumping, lifting, and throwing). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ME 212, SYDE 182",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME186",
            "Name": "Chemistry Principles",
            "Desc": "The stoichiometry of compounds and chemical reactions. Periodicity and chemical bonding. Energy changes in chemical systems. Electronic structure of atoms and molecules, correlation with the chemical reactivity of common elements, inorganic and organic compounds. Discussion of the structure, nomenclature and reactions of important classes of organic compounds. Stereochemistry and its role in reaction mechanisms. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME201",
            "Name": "Seminar",
            "Desc": "Biomedical engineering second-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME202",
            "Name": "Seminar",
            "Desc": "Biomedical engineering second-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME213",
            "Name": "Statistics and Experimental Design",
            "Desc": "Fundamentals of probability and statistics, and applications to biomedical engineering. Random variables and statistical distributions, statistical estimation, hypothesis testing, regression, and experiment design considerations. Applications to biomedical experiments, biomedical imaging data, and clinical trials. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 361, CHE 220, CIVE 224, ENVE 224, KIN 222, MSCI 252, ME 202, MTE 201, NE 215, PSYCH 292, STAT 202, 206, 211, SYDE 212",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME252",
            "Name": "Linear Systems and Signals",
            "Desc": "Models and analysis of linear systems in the context of measurement and processing of biosignals such as electroencephalography (EEG), electrocardiography (ECG), and electromyography (EMG). Discrete and continuous time systems, difference and differential equations, impulse and frequency response, transform domain techniques, transfer functions and frequency response, frequency domain analysis of linear systems, sampling theory, stability, and linear filters. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 252",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME261",
            "Name": "Prototyping, Simulation and Design",
            "Desc": "Problem-solving approaches, agile design and development, rapid prototyping, revision control, design patterns, development cycles, and simulation. Topics will be reinforced in the context of biomedical engineering projects conducted in groups within a collaborative environment. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME281",
            "Name": "Mechanics of Deformable Solids",
            "Desc": "Introduction to mechanical response of materials and stress-strain relationship. Behaviour of prismatic members in tension, compression, shear, bending, and torsion. Shear-force and bending-moment diagrams. Introduction to instability. Mechanical properties of biological tissues, and viscoeleastic models. Applications to bone, cartilage, and biomedical implants. [Offered:  F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CIVE 204, ME 219, SYDE 286",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME281L",
            "Name": "Mechanics of Deformable Solids Laboratory",
            "Desc": "Laboratory experiments for students taking BME 281. [Offered:  F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME282",
            "Name": "Materials Science for Biomedical Engineers",
            "Desc": "Crystalline structure, crystal defects, non-crystalline materials, structure and properties of metals, ceramics, glasses, semi-conductors, polymers, and composites. Factors in materials design, material selection and processing in the context of biomedical devices and instruments will also be discussed.[Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 285",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME284",
            "Name": "Physiological and Biological Systems",
            "Desc": "The structure, functions, and properties of the major biological systems (musculoskeletal, nervous, cardiovascular) will be presented in relation to the design of biomedical devices (imaging, assistive, and diagnostic). Concepts in modeling biological systems will be introduced. Various aspects of pathology and how they influence medical device design will also be discussed. [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 384/584",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME284L",
            "Name": "Physiology and Anatomy Laboratory",
            "Desc": "Laboratory experiments for students taking BME 284. [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME285",
            "Name": "Engineering Biology",
            "Desc": "Introduction to basic concepts of biochemistry and cell biology. Overview of the chemistry of amino acids, carbohydrates, lipids and nucleic acid. Structure and properties of proteins and enzymes. Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism. A focus on biomedical engineering with relevant examples such as biomimetic engineering design, system biology, and tissue engineering. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME285L",
            "Name": "Engineering Biology Laboratory",
            "Desc": "Laboratory experiments for students taking BME 285.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME294",
            "Name": "Circuits, Instrumentation, and Measurements",
            "Desc": "Basic concepts of hardware measurement systems pertaining to the measurement of biosignals: active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition, step responses of first and second order networks, sinusoidal steady state analysis, input-output relationships, transfer functions and frequency response of linear systems, operational amplifiers, analog signal detection, conditioning and conversion systems, transducers, difference and instrumentation amplifiers, A/D and D/A conversion. Examples will be presented in the form of physiological monitoring hardware for vital measurements such as electroencephalography (EEG), electrocardiography (ECG), and electromyography (EMG). [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 392, SYDE\n292",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME294L",
            "Name": "Circuits, Instrumentation, and Measurements Laboratory",
            "Desc": "Laboratory experiments for students taking BME 294. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 392L, SYDE\n292L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME301",
            "Name": "Seminar",
            "Desc": "Biomedical engineering third-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME302",
            "Name": "Seminar",
            "Desc": "Biomedical engineering third-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME355",
            "Name": "Physiological Systems Modelling",
            "Desc": "Introduction to systems theory as a general modelling method, and applied to the skeletal, neuromuscular, central nervous, cardiovascular, and respiratory systems of the human body. Time-domain simulations, sensitivity analyses, and parameter identification, with the latter driven by experimental measurements of system performance. [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME356",
            "Name": "Control Systems",
            "Desc": "Classical and state space representations of control systems. Stability, controllability, observability, and sensitivity. Routh-Hurwitz and root-locus methods. Frequency domain behaviour, Bode plots, Nyquist stability criteria. Pole placement, PID, phase-lead and phase-lag controllers. Application to anatomical system models, including musculoskeletal and cardiovascular systems, and to physiological feedback systems. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 353, SYDE 352",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME356L",
            "Name": "Control Systems Laboratory",
            "Desc": "Laboratory experiments for students taking BME 356. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 353L, SYDE\n352L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME361",
            "Name": "Biomedical Engineering Design",
            "Desc": "Design methods: problem definition, requirements analysis, criteria and generation of alternative solutions, feasibility analysis, and optimization. Product development. Design survey of biomedical equipment and assistive technologies. A term-long design project in small groups. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 361",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME362",
            "Name": "Biomedical Engineering Design Workshop 1",
            "Desc": "Engineering design project course where students work in small groups applying the principles of engineering problem solving, systems analysis, simulation, optimization, and design to a biomedical engineering problem of their own choosing. Lecture topics include project management, risk management, standards, regulatory clearance, and certification for biomedical devices. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 362",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME364",
            "Name": "Engineering Biomedical Economics",
            "Desc": "This course examines key economic issues in health care and biomedical industries. Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care. This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms. [Offered:  F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 262",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME381",
            "Name": "Biomedical Engineering Ethics",
            "Desc": "This course explores ethical issues in biomedical engineering practice, including professional ethics, medical ethics, the ethics of human and animal subject use in biomedical research, and the impact of biomedical engineering solutions on society and the environment. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME384",
            "Name": "Biomedical Transport: Biofluids and Mass Transfer",
            "Desc": "Fundamental concepts in systems involving fluid flow. Basic treatment of statics, kinematics, and dynamics of fluids. Mass transfer, conservation of mass, momentum and energy for a control volume. Dimensional analysis and similarity. Discussion of flow in pipes and channels and brief introduction to boundary layers, lift and drag, ideal and compressible flow will be specifically covered in the context of the cardiovascular system (macrocirculation and microcirculation). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 381, 383",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME386",
            "Name": "The Physics of Medical Imaging",
            "Desc": "The fundamental laws of electricity, magnetism, and optics will be taught through the introduction to basic concepts of medical imaging: radiation for imaging, x-ray, computed tomography (CT), magnetic resonance imaging (MRI), ultrasound or sonography imaging, electric impedance tomography, confocal microscopy, fluoroscopy. Radionuclide imaging: Single photon emission computed tomography (SPECT), and positron emission computed tomography (PET). Emerging technologies: elastography, tHz imaging, molecular imaging will also be discussed.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 283",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME393",
            "Name": "Digital Systems",
            "Desc": "Digital technology, combinatorial logic, binary arithmetic, sequential circuits, digital design, and microcontrollers. Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 292, SYDE 192",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME393L",
            "Name": "Digital Systems Laboratory",
            "Desc": "Laboratory experiments for students taking BME 393, focusing on circuit construction, simulation, and design. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 292L, SYDE 192L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME399",
            "Name": "Directed Biomedical Research Project",
            "Desc": "A biomedical research project carried out under the supervision of a faculty member. Students interested in graduate studies or industrial research careers will gain experience in advanced research techniques and develop valuable research skills. A written report is to be submitted to the course co-ordinator. This course is extra over and above the normal course load. ",
            "Notes": "[Note: This course is graded as CR/NCR. Offered: F,W]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME401",
            "Name": "Seminar",
            "Desc": "Biomedical engineering fourth-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME402",
            "Name": "Seminar",
            "Desc": "Biomedical engineering fourth-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work, and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME411",
            "Name": "Optimization and Numerical Methods",
            "Desc": "Interpolation and curve fitting, root-finding methods, local and global optimization methods, constrained optimization, multiobjective and multidisciplinary design optimization for biomedical applications. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 411",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME461",
            "Name": "Biomedical Engineering Design Workshop 2",
            "Desc": "The first half of a two-term engineering design project continuing the biomedical design workshop sequence. A prototype and interim progress report are presented at the end of the first term. Lecture topics include safety and risk analysis of biomedical technologies. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 461",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME462",
            "Name": "Biomedical Engineering Design Workshop 3",
            "Desc": "The concluding half of the fourth-year Biomedical Engineering Design Workshop. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SYDE 462",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME499",
            "Name": "Elective Biomedical Research Project",
            "Desc": "A major undergraduate individual biomedical research project carried out as a technical elective (TE) under the supervision of a faculty member. Students are expected to demonstrate initiative and responsibility. An oral presentation of results and a written report are the minimum requirements. The faculty supervisor or department may set other requirements. Students will arrange for a faculty supervisor prior to registration. [Offered: F,W]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BME 399; Level at least 4A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME530",
            "Name": "The Healthcare System",
            "Desc": "A broad introduction to the Canadian healthcare system, with emphasis on factors related to biomedical engineering. History, structure, and function of various healthcare organizations, procurement practices in healthcare, electronic health records and information exchange. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 245/GERON 245",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME540",
            "Name": "Fundamentals in Neural and Rehabilitation Engineering",
            "Desc": "Introduction to the field of neural and rehabilitation engineering (NRE). Topics include describing common neurological and musculoskeletal injuries, related neural and rehabilitation engineering approaches to address disabilities, and the development of a design framework for synthesizing a novel neural and rehabilitation engineering approach. Critical concepts in clinical research design to meet current regulatory, ethical, and practice policies will be studied. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Biomedical or Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME550",
            "Name": "Sports Engineering",
            "Desc": "This course focuses on the application of engineering principles to the analysis of sports equipment and their effects on athletic performance. Principles of mechanics are used to understand the motion and forces arising in sports equipment, and their interaction with the musculoskeletal dynamics of athletes. [Offered: F]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: (BME 182 or ME 212 or SYDE 182), (BME 281 or ME 219 or SYDE 286); Level at least 3A Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME551",
            "Name": "Biomechanics of Human Movement",
            "Desc": "This course introduces students to the biomechanics of the musculoskeletal system, including motor control and rehabilitation engineering. Multibody models in two-dimensional (2D) and three-dimensional (3D) will be used to study the dynamics of normal and pathological motions. Motor control will be included, as well as the identification of body segment parameters and the dynamics of muscles. Applications may include assistive devices, rehabilitation, human gait, occupational biomechanics, and other activities. [Offered: W]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: (BME 182 or ME 212 or SYDE 182); Level at least 3A Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME581",
            "Name": "Ultrasound in Medicine and Biology",
            "Desc": "Ultrasound physics, scanning modes, data acquisition schemes, transducer basics, wave-matter interactions; biomedical applications of ultrasound including imaging, flow measurements, microscopy, therapy, drug delivery. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BME 386, PHYS 395, 396.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 487 Biomedical Signals - Ultrasound in Medicine and Biology",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME587",
            "Name": "Special Topics in Biomedical Signals",
            "Desc": "This course deals with selected topics at the undergraduate level in medical imaging and diagnostics, biosignals, and neuroscience. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME588",
            "Name": "Special Topics in Biomechanics",
            "Desc": "This course deals with selected topics at the undergraduate level in biofluid mechanics, tissue mechanics, sports engineering, and rehabilitation engineering. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "BME589",
            "Name": "Special Topics in Biomedical Devices",
            "Desc": "This course deals with selected topics at the undergraduate level in assistive devices, implants, prostheses, orthoses, biomedical technologies, therapeutics, and biocompatibility. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}