{
    "Name": "chemicalengineering",
    "Notes": "Prerequisite: For all courses in the Department of Chemical\r\nEngineering, registration in chemical engineering or permission of the\r\nassociate chair (undergraduate studies) is required.",
    "Courses": [
        {
            "courseCode": "CHE100",
            "Name": "Chemical Engineering Concepts 1",
            "Desc": "Introduction to basic methods and principles in chemical engineering. The fundamentals of engineering calculations (units and dimensions), behaviour of fluids, mass balances, processes, and process variables. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE101",
            "Name": "Chemical Engineering Concepts 2",
            "Desc": "Development of chemical process analysis skills. Introduction to single- and multi-phase physical equilibria. Material and energy balances in reactive and non-reactive systems. Introduction to investigation and technical communication through laboratory experiments illustrating the physical principles discussed. (In the Winter term only: brief review of co-op fundamentals.) [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE102",
            "Name": "Chemistry for Engineers",
            "Desc": "Chemical principles with applications in engineering. Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "CHE120",
            "Name": "Computer Literacy and Programming for Chemical Engineers",
            "Desc": "Using computers as problem-solving tools. Introduction to computer architecture and networking. Effective use of command line interfaces and graphical user interfaces. Word processing, spreadsheet, and presentation software. Introduction to programming and numerical computing using a high-level interpreted programming language. Programming fundamentals including flow charts, variables, design and use of functions, strings and text input/output, relational operators, conditionals, collections, loops. Numerical computing, plotting and file input/output. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE161",
            "Name": "Engineering Biology",
            "Desc": "Introduction to basic concepts of biochemistry and cell biology.  Overview of the chemistry of amino acids, carbohydrates, lipids and nucleic acids.  Properties and functions of biopolymers.  Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism. A focus on biotechnologically relevant examples such as biomimetic engineering design, proteomics, system biology and high throughput biology.  [Offered:  W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Engineering or Software Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE180",
            "Name": "Chemical Engineering Design Studio 1",
            "Desc": "Engineering as a profession. An introduction to the fundamentals of data analysis, investigation, design, and communication in chemical engineering. Introduction to chemical product and process design. Needs analysis and problem identification. Literature search and brainstorming. Design requirements, constraints, and criteria. Development and preliminary evaluation of alternative solutions using software tools. Process synthesis, block diagrams, process flow diagrams (PFD), and piping and instrumentation diagrams (P&ID). Introduction to computer-aided design (CAD). Safety and sustainability in design. Principles of green engineering. Occupational health and safety. Introduction to process safety and process hazard identification. Communication of technical information, written reports, and oral presentations. Teamwork. Professional development, résumé and interview skills, and e-portfolios. Students undertake a term-long design project under the supervision of the instructor. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE181",
            "Name": "Chemical Engineering Design Studio 2",
            "Desc": "Development of chemical engineering analysis, investigation, design, and communication skills. Introduction to engineering measurement. Instrument performance characteristics. Electric circuits, current, voltage and resistance, measurements, and signal transmission. Electrical safety. Measurement uncertainty, types of errors, calibration, instrument uncertainty analysis, and error propagation. Measurement of force and load, chemical composition, temperature, pressure and flow. Sensor interfacing and data acquisition using software. Process safety management and inherently safer design. Prototyping, testing, and verification. Communication of technical information, written reports, and oral presentations. Teamwork. Students undertake a term-long design project under the supervision of the instructor. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE200",
            "Name": "Equilibrium Stage Operations",
            "Desc": "Equilibrium between phases; the equilibrium stage concept. Cascades of stages with and without reflux; group methods and stage-by-stage approaches; graphical solutions. Applications in the separation of components by distillation, absorption, stripping, extraction and leaching. [Offered:  F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE201",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE202",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE211",
            "Name": "Fluid Mechanics",
            "Desc": "Fundamentals of fluid flow. Conservation laws for mass, momentum and mechanical energy. Flow of fluids in conduits. Flow past immersed bodies. Flow through beds of solids, fluidization. Transportation and metering of fluids. Dimensional analysis. [Offered: F, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE220",
            "Name": "Process Data Analysis",
            "Desc": "Introduction to statistical methods for analyzing and interpreting process data.  Introduction to statistical ideas, probability theory, distribution theory, sampling theory, confidence intervals and significance tests. Introduction to regression analysis. Introduction to design of experiments and statistical quality control. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE225",
            "Name": "Strategies for Process Improvement and Product Development",
            "Desc": "A course in practical statistics at a level one step beyond an elementary course. Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data. Applications to process improvement, product development, and research problems will be explored. Use of statistical analysis software to apply these techniques. [Offered: F, W, S, last offered as CHE 425 winter 2024]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE230",
            "Name": "Physical Chemistry 1",
            "Desc": "Thermodynamics: work and heat as forms of energy. First law, internal energy and enthalpy. Heats of chemical and physical changes. Cycles and the second law, entropy. Spontaneity and equilibrium, free energies. Systems of variable composition, chemical equilibrium. Phase equilibrium and the phase rule. Ideal solutions, colligative properties.  [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE231",
            "Name": "Physical Chemistry 2",
            "Desc": "Thermodynamics: ideal solutions; non-ideal solutions, non-electrolytic and electrolytic solutions, phase equilibrium and phase diagrams, reaction equilibrium.  Surface phenomena: surface tension, capillarity, properties of small particles, adsorption.  Chemical kinetics: rate laws, reaction rates, mechanisms, catalysis, heterogeneous reactions. [Offered: F, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE241",
            "Name": "Materials Science and Engineering",
            "Desc": "Fundamentals; atomic bonding, crystalline structure, crystal defects, non-crystalline materials; structure and properties of metals, ceramics, glasses, semi-conductors.  Amorphous materials, polymers, composites. Processing and concepts of engineering design of materials. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE290",
            "Name": "Chemical Engineering Lab 1",
            "Desc": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term.  Topics may include:  basic microbiology and biotechnology, introductory physical chemistry, mass and energy balances.  [Offered:  F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE291",
            "Name": "Chemical Engineering Lab 2",
            "Desc": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term.  Topics may include:  physical chemistry, design of experiments and statistics, and equilibrium stage operations.  [Offered:  F, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE298",
            "Name": "Directed Research Project",
            "Desc": "Directed research project under the supervision of faculty members.  Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers.  Taken over and above normal course load.  Good standing and permission of department required for registration.  ",
            "Notes": "[Note:  This course graded as CR/NCR.  Offered:  F, W]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE299",
            "Name": "Directed Research Project",
            "Desc": "Directed research project under the supervision of faculty members.  Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers.  Taken over and above normal course load.  Good standing and permission of department required for registration.  ",
            "Notes": "[Note:  This course graded as CR/NCR.  Offered:  F, S]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE301",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE302",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE312",
            "Name": "Mathematics of Heat and Mass Transfer",
            "Desc": "Fundamentals of mass transfer: species and mixture velocities, diffusive and convective fluxes, Fick's law and the diffusion coefficient. Vector form of the microscopic (differential) mass balance. Fundamentals of heat transfer: conduction, convection and radiation, Fourier's law and thermal conductivity. Vector form of the microscopic thermal energy balance for solids and incompressible fluids. Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions. Bessel functions. Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform. Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion. Heat-mass transfer analogies and dimensionless numbers. [Offered:  W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE313",
            "Name": "Applications of Heat and Mass Transfer",
            "Desc": "Convective heat transfer. Analysis of convective heat transfer in external flows using the boundary layer approach. Analysis of convective heat transfer in internal flows. Empirical correlations for convective heat transfer. Heat transfer with phase change: condensation and boiling. Heat exchanger design. Convective mass transfer. Empirical correlations for convective mass transfer. Mass transfer at fluid-fluid interfaces. Design of continuous differential contactors for absorption/stripping, distillation and liquid-liquid extraction. Analogy between heat, mass and momentum transfer. Dimensional analysis. Simultaneous heat and mass transfer operations. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE314",
            "Name": "Chemical Reaction Engineering",
            "Desc": "Review of stoichiometry and chemical kinetics. Homogeneous reactors: isothermal operation; batch; semi-batch; continuous tank; plug flow reactor design. Continuous stirred-tank reactors (CSTRs) in series; plug flow reactor with recycle. Multiple reactions in reactor networks. Temperature effects in adiabatic and non-isothermal reactors. Yield, selectivity and optimal operation of reactors. Heterogeneous catalysis and effectiveness factors in two-phase reactors. [Offered: W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE322",
            "Name": "Numerical Methods for Process Analysis and Design",
            "Desc": "Systems of linear and non-linear algebraic equations; polynomial and spline interpolation; numerical differentiation and integration; numerical solution of initial value and boundary value ordinary differential equation problems: accuracy and stability, step size control and stiffness; finite differences for the numerical solution of elliptic and parabolic partial differential equations: method of lines, explicit vs. implicit finite-difference methods; introduction to the finite element method (optional). [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE330",
            "Name": "Chemical Engineering Thermodynamics",
            "Desc": "Review of fundamentals, including 2nd law and concepts of equilibrium, phase and reaction equilibria, fugacity, exergy. Thermodynamics applied to practical situations. Examples chosen from: fluid flow; power generation; refrigeration; air conditioning and water cooling; liquefaction of gases; equilibria in complex chemical reactions and separation processes; surface phenomena; electrochemical reactions; biological processes. [Offered: W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE331",
            "Name": "Electrochemical Engineering",
            "Desc": "Topics and applications of electrochemistry and electrochemical engineering. Industrial process examples. Environmental aspects. Ionic equilibria. Laws of electrolysis. Theory of electrolytes. Transport properties of electrolytes. Reversible cell potentials. Irreversible electrode processes. Thermodynamic and kinetic aspects of corrosion. Common examples of corrosion. Electrochemical energy conversion and storage. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE341",
            "Name": "Introduction to Process Control",
            "Desc": "Laplace transform techniques. Proportional-integral-derivative control. Frequency response methods. Stability analysis. Controller tuning. Process control simulation and computer control systems. Process identification. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering or Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE361",
            "Name": "Bioprocess Engineering",
            "Desc": "Review of elementary aspects of microbiology, biochemistry, molecular biology, and genetic engineering. Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials. Introduction to design of bioprocess systems, including biosafety and sustainability. Development of reaction kinetics associated with biological systems. Quantification of metabolism. Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle. Introduction to mass and heat transfer considerations for bioreactors. Dynamic simulation of cultures defined by ordinary differential equations. Introduction of downstream processes associated with biological systems and recovery of biological products. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering or Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE383",
            "Name": "Chemical Engineering Design Workshop",
            "Desc": "An introduction to the engineering design process, including problem definition and needs analysis, critical analysis of problems, alternative solutions, process synthesis, design constraints, and safety and environmental protection in design. This course also develops and enhances team work, project management and technical communication (written and oral). Students in teams work on open-ended problems and apply the formal methods of engineering design. At the conclusion of this course, each student team presents a pre-proposal of the design project that will become the subject of CHE 482 and CHE 483.  [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE390",
            "Name": "Chemical Engineering Lab 3",
            "Desc": "A selection of computer and laboratory exercises, and project-based investigations, refreshing and reinforcing material covered in the previous term. Topics may include fluid mechanics, physical chemistry and kinetics, materials properties, and testing. [Offered: W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE398",
            "Name": "Directed Research Project",
            "Desc": "Directed research project under the supervision of faculty members.  Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers.  Taken over and above normal course load.  Good standing and permission of department required for registration.  ",
            "Notes": "[Note:  This course graded as CR/NCR. Offered:  W, S]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE399",
            "Name": "Directed Research Project",
            "Desc": "Directed research project under the supervision of faculty members.  Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers.  Taken over and above normal course load.  Good standing and permission of department required for registration.  ",
            "Notes": "[Note:  This course graded as CR/NCR.  Offered:  F, W]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE401",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE402",
            "Name": "Seminar",
            "Desc": "General Seminar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE425",
            "Name": "Strategies for Process Improvement and Product Development",
            "Desc": "A course in practical statistics at a level one step beyond an elementary course. Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data. Applications to process improvement, product development, and research problems will be explored. Use of statistical analysis software to apply these techniques. [Offered: F, W, S, last offered as CHE 425 winter 2024]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE450",
            "Name": "Technical Work-term Report",
            "Desc": "An engineering report based upon a technical project, activity, or analysis carried out by the student, during the preceding work-term employment. Evaluation is based upon a level of written communication, technical proficiency, and engineering analysis appropriate to a graduating engineering student. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PD 11; Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE480",
            "Name": "Process Analysis and Design",
            "Desc": "Development and analysis of process flowsheets and chemical product design. Design and selection of common process equipment such as heat exchangers, pumps, piping, staged separations. Incorporation of pollution prevention and inherently safer design principles. Equipment and project cost estimation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE482",
            "Name": "Group Design Project",
            "Desc": "The first of two required courses for the Chemical Engineering capstone design project. Student design teams of three to five members work on design projects of industrial scope and importance under the mentorship of a faculty member. Students develop and communicate a feasible design project proposal and plan; generate feasible solutions that address the formulated problem; evaluate alternatives and identify preferred solution; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage design project technical and non-technical risks using project management tools and techniques; deliver a report and/or a presentation that summarizes the work completed; work effectively as a team member and/or team leader. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE483",
            "Name": "Group Design Project and Symposium",
            "Desc": "Completion of the design project cycle started in CHE 482 and communication of the engineering design work. Submission of a written final report. Lecture-style technical presentation by group members. Poster-style technical presentation with group members available to discuss the project. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHE 482; 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE490",
            "Name": "Chemical Engineering Lab 4",
            "Desc": "A project-based experimental investigation of complex systems in main areas of application of chemical engineering. Topics selected from reaction engineering, separation processes, bioprocess engineering, electrochemical engineering, materials engineering and process control. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE491",
            "Name": "Chemical Engineering Lab 5",
            "Desc": "Project-based experimental investigation of complex systems in main areas of application of chemical engineering. Topics selected from reaction engineering, separation processes, bioprocess engineering, electrochemical engineering, materials engineering and process control. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE498",
            "Name": "Directed Research Project",
            "Desc": "Directed research project under the supervision of faculty members.  Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers.  Taken over and above normal course load.  Good standing and permission of department required for registration.  ",
            "Notes": "[Note:  This course graded as CR/NCR.  Offered: F, S]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE499",
            "Name": "Elective Research Project",
            "Desc": "A major undergraduate research project carried out as a technical elective (TE) under the supervision of a faculty member. An oral presentation of results and a written report are the minimum requirements. Other requirements may be set by the faculty supervisor or department. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of CHE 398 or 399 or 498",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE500",
            "Name": "Special Topics in Chemical Engineering",
            "Desc": "Special courses on advanced topics may be offered from time to time, when resources are available. For current offerings, inquire at the CHE undergraduate office.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE514",
            "Name": "Fundamentals of Petroleum Production",
            "Desc": "Fundamentals of surface chemistry, capillary pressure, and wettability. Petrophysics, measurement, and interpretation of electrical, capillary, and flow properties of reservoir rock. Hydrostatic pressure regimes and estimation of oil and gas reserves. Darcy's law and modelling of steady-state and transient incompressible and compressible single-phase flow through porous media. Thermodynamics of petroleum fluids. Material balance for oil and gas reservoirs: subsurface withdrawal and primary production mechanisms. Oil well testing. Two-phase flow in oil reservoirs, relative permeability, Buckley-Leverett theory of linear water flooding and sweep efficiency. Introduction to enhanced oil recovery. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical, Environmental or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE516",
            "Name": "Energy Systems Engineering",
            "Desc": "Energy systems in society. Review of fossil fuel reserves, production and consumption trends, including unconventional sources such as shale gas, and oil sands. Transportation fuels and alternative fuels; the design of hybrid power trains, fuel cells and batteries. Design considerations of carbon-free energy generation and carbon-neutral technologies, including nuclear, wind, solar and bio-energy. Design of energy storage on a 'utility scale' and portable power sources. Applications of thermodynamics in the design of energy systems, including the Rankin and Brayton cycles. Other energy system topics as appropriate. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical or Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ME 459",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE520",
            "Name": "Process Flowsheet Analysis",
            "Desc": "An integrated view of process flowsheet synthesis, analysis and optimization, emphasizing the use of computer aids to perform steady-state mass and energy balancing on chemical processes. Application of relevant chemical engineering concepts, including mass and energy balances, thermodynamics of mixtures and unit operation models, to process simulation. Process simulation modes, numerical solution of relevant non-linear equation systems, recycle partitioning, and tearing. Applications including heat exchanger networks, multistage separation processes, and chemical reactor networks. Practical skills will be developed through the application of available process simulation software. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE521",
            "Name": "Process Optimization",
            "Desc": "An introduction to chemical process optimization. Model development and classification of optimization problems. Linear programming techniques, simplex algorithm, goal programming and barrier method, parametric sensitivity analysis and duality theory. Convex optimization, necessary and sufficient conditions for optimality for unconstrained and constrained problems. Mixed-integer programming. Trajectory optimization. Applications include optimization of heat exchanger networks, multistage separation processes, batch operations, process scheduling and chemical reactor networks. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 411, MSCI 331, SYDE 411",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE522",
            "Name": "Advanced Process Dynamics and Control",
            "Desc": "State space methods. Sampled-data systems. Discrete systems. Transform methods. Multivariable control. Computer control. Closed-loop analysis. Design of controllers. Control of complex chemical systems. [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE524",
            "Name": "Process Control Laboratory",
            "Desc": "Experiments on process dynamics, control, and simulation of processes. Time constant; step and frequency response; controller tuning; multivariable control strategies. Implementation using simulation systems, mainframe computer control, microcomputers. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE541",
            "Name": "Introduction to Polymer Science and Properties",
            "Desc": "An introduction to principles governing polymerization reactions and the resultant physical properties of polymers. Molecular weight distribution. Crystallinity. Step-growth and chain-growth polymerization and copolymerization. Selected additional topics in polymer characterization/ properties. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE543",
            "Name": "Polymer Production: Polymer Reaction Engineering",
            "Desc": "Overview of polymer production technology and polymer reaction engineering analysis tools. Examples from chain growth polymerization processes (free radical, ionic, living/controlled radical variants, metal co-ordination catalysis, etc.), different modes of polymer reactor operation (batch, semi-batch, continuous flow stirred-tank reactor (CSTR), tubular, trains of CSTRs), homogeneous (bulk/solution/suspension) and heterogeneous (emulsion/dispersion/co-ordinated/etc.), linear and branched/cross-linked chains. Calculations and mathematical models for rate, copolymer composition, molecular weight and sequence length characteristics, for polymer reactor design/optimization of polymer productivity and quality variables. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHE 541",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE561",
            "Name": "Biomaterials and Biomedical Design",
            "Desc": "An overview of nanomedicine and nanotechnology-based biomedical devices. Strategies and technologies for designing, testing, and manufacturing biomaterials and tissue-engineering products. Biological and clinical applications. Manufacturing challenges and regulatory procedures for commercialization. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 489 (Topic 1: Biocompatibility and Biomaterial)",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE562",
            "Name": "Advanced Bioprocess Engineering",
            "Desc": "Application of process engineering principles to the design and operation of fermentation reactors which are widely used in the pharmaceutical, food, brewing, and waste treatment industries. Aspects of mass transfer, heat transfer, mixing, and rheology with biochemical and biological constraints. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE564",
            "Name": "Food Process Engineering",
            "Desc": "Applications of unsteady and steady state heat and/or mass transfer operations to processing natural and texturized foods. Design and analysis of sterilization, low temperature preservation, concentration, separation and purification processes. Effects of formulation, additives and processing on organoleptic and nutritional quality. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4B Chemical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE565",
            "Name": "Synthetic Biology Project Design",
            "Desc": "Synthetic biology involves developing new approaches, based on engineering principles, for genetic engineering of biological systems. Students will prepare a comprehensive research proposal for a synthetic biology project of their own design, under the supervision of a faculty member. Attendance at a weekly journal club focused on synthetic biology will be mandatory. [Offered: F,W,S].",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE571",
            "Name": "Industrial Ecology",
            "Desc": "Industrial Ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies. It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes. This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues. The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations. The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical or Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE572",
            "Name": "Air Pollution Control",
            "Desc": "Nature and sources of air pollutants.  Transport of pollutants and dispersion modeling for regulatory purposes. Design of industrial particulate capture systems using cyclones, electrostatic precipitators, filters, scrubbers.  Design of organic compound emissions control using incineration, biofiltration, adsorption and absorption.  Overview of NOx and SOx control.  Indoor air quality assessment techniques.  [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical or Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHE574",
            "Name": "Industrial Wastewater Pollution Control",
            "Desc": "Primary focus is on the control and treatment of inorganic aqueous waste from chemical process industries.  Waste minimization methods with specific examples such as rinsewater circuit design.  Principles and design of treatment methods:  chemical treatment, precipitation, coagulation and flocculation, ion exchange and membrane separation.  Treatment of organic aqueous waste.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical or Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}