{
    "Name": "chinese",
    "Notes": "Students who are interested in the Chinese language courses\r\nshould be aware that the completion of at least three courses in a\r\nsubject is recommended for a minimum working knowledge of the language.\r\nThe Chinese and East Asian culture courses may provide useful\r\nbackground for students intending to spend time in the Far East.\nStudents who have previous experience with or who have\r\nstudied the Chinese language at the elementary or secondary school\r\nlevel should not enrol in first-year level courses of the same\r\nlanguage. Such students should consult the Renison Registrar's Office\r\nregarding the appropriate level to enter.\nTwo\r\ntracks of introductory courses are offered. CHINA 101R and 102R are\r\nsequenced courses at that beginner level designed for complete\r\nbeginners who have little or no background in Chinese. CHINA 120R is\r\ndesigned for advanced beginners who have some Chinese background either\r\nin speaking or writing Chinese characters. The pinyin system of\r\npronunciation and simplified form of Chinese characters are used in all\r\nthe Chinese courses offered.\nStudents seeking\r\nentry into Chinese courses who have not previously taken a course in\r\nChinese at Renison University College must complete an assessment form. Renison reserves the right to allocate\r\nstudents to the appropriate class based on this assessment.\nStudents are not permitted to enrol in more than one Chinese\r\nlanguage course at the same time.\nRenison\r\nUniversity College reserves the right to refuse admission to, and/or\r\ncredit for, any of its language courses to a student who has, in\r\nRenison's view, a level of competence unsuited to the course(s).",
    "Courses": [
        {
            "courseCode": "CHINA101R",
            "Name": "First-Year Chinese 1",
            "Desc": "An introductory course for students who have little or no prior background in writing, speaking, or understanding any dialect of the Chinese language to develop basic listening, speaking, reading, and writing skills. Practical oral and written exercises provide a firm grammatical foundation for further study.  ",
            "Notes": "[Note: CHINA 101R is not open to speakers of any Chinese dialect.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: CHINA 120R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA102R",
            "Name": "First-Year Chinese 2",
            "Desc": "With the completion of the study of the rudiments of phonetics (as provided in CHINA 101R), the emphasis in this course shifts to grammar and character writing.  Vocabulary will be expanded to between 500 and 700 words. ",
            "Notes": "[Note: CHINA 102R is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 101R.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CHINA 120R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA120R",
            "Name": "Advanced First-Year Chinese",
            "Desc": "Equivalent to 101R and 102R but covered in one term.  This introductory Chinese course is designed for two major groups of students who have different initial advantages in learning Chinese: 1) students who have substantial aural-oral proficiency but limited ability in reading and writing Chinese characters and 2) those who know characters but cannot speak Mandarin (Putonghua). ",
            "Notes": "[Note: CHINA 120R is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: CHINA 101R, 102R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA180R",
            "Name": "Conversational Chinese",
            "Desc": "This course helps strengthen students' speaking and listening competence. Classes are structured around themes, integrating discussions, student presentations, and question/answer exchanges. This structure provides opportunities for pronunciation practice, vocabulary building, and sentence pattern formation, helping students develop oral/aural proficiency in elaborating opinions on socio-cultural topics relevant in a Chinese community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 102R or 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA201R",
            "Name": "Second-Year Chinese 1",
            "Desc": "Development of speaking, writing, reading, and listening skills. This course and its follow-up (CHINA 202R) include a survey of grammar, complex sentences, and logical stress.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 102R or 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA202R",
            "Name": "Second-Year Chinese 2",
            "Desc": "The study of Chinese characters receives more emphasis. Grammar instruction includes comparisons and different kinds of complements.  The course includes topics of interest to students illustrating cultural differences between China and the West.  Upon completion of CHINA 201R and 202R, the student should have a reading vocabulary of 1,600 Chinese characters and have learned about 300 key sentence patterns.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 201R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA301R",
            "Name": "Third-Year Chinese 1",
            "Desc": "A course to consolidate, expand, and deepen the understanding of lexical items and sentence patterns.  Besides introducing more vocabulary and grammar, this course concentrates on complex sentences and paragraphs not emphasized in earlier textbooks.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 202R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA302R",
            "Name": "Third-Year Chinese 2",
            "Desc": "A continuation of China 301R to further students' ability to comprehend and communicate at a higher level in Chinese.  In addition, the course introduces aspects of Chinese society, highlighting traditional and contemporary cultural life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 301R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA310R",
            "Name": "Chinese for Business Settings",
            "Desc": "A course to develop comprehension, speaking, reading, and writing of Mandarin specifically related to the Chinese business environment.  This course is designed for students who are already familiar with Chinese characters and Mandarin tonality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 302R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA320R",
            "Name": "Chinese in Mass Media",
            "Desc": "A course to develop Chinese language skills in conversation, reading, writing, and critical thinking in both practical and cultural situations through contemporary films, television programs, newspapers, magazines, and literary works.  Selected important issues and themes in Chinese culture and history are considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 302R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA390R",
            "Name": "Introduction to Professional Translation (Chinese to English)",
            "Desc": "This course is for students with a strong command of Chinese and English who seek to learn the basics of professional translation between the two languages. Focus is on translation involving government and business documents, as well as news stories.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 320R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA391R",
            "Name": "Special Topics",
            "Desc": "This course deals with advanced topics in Chinese language and literature. Students are expected to have at least an intermediate level of language proficiency. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 202R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA401R",
            "Name": "Introduction to Classical Chinese 1",
            "Desc": "This course examines selected philosophical and historical writings from pre-modern China with an emphasis on introducing the basic vocabulary and grammar of classical Chinese. ",
            "Notes": "[Note: Chinese native or near-native proficiency students may enrol; placement test is required.]",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 302R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CHINA402R",
            "Name": "Introduction to Classical Chinese 2",
            "Desc": "Building on skills introduced in CHINA 401R, this course examines selected writings from pre-modern China to develop a deeper understanding of and facility with classical literary Chinese.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHINA 401R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}