{
    "Name": "classicalstudies",
    "Notes": "Students should consult with the departmental\r\nundergraduate advisor for the latest information on course offerings.\r\nSome courses are offered in rotation. \nClassical Studies courses are taught in English. See Greek and Latin for courses in the\r\nClassical languages.",
    "Courses": [
        {
            "courseCode": "CLAS100",
            "Name": "An Introduction to Classical Studies",
            "Desc": "An introduction to Greek and Roman civilization, focusing on six key aspects of the discipline of classical studies: history, literature, philosophy, myth and religion, art and architecture, and classical archaeology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: No more than 0.50 unit in CLAS",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS103",
            "Name": "Colossos: The Major Figures of Classical Antiquity",
            "Desc": "An introductory study of the achievements of ancient Greece and/or Rome through some of their major figures. Each year two figures will be featured. These may include Homer, Pericles, Socrates, Alexander the Great, Cleopatra, Julius Caesar, Augustus, Nero, Seneca, Hadrian, and Constantine. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS104",
            "Name": "Classical Mythology",
            "Desc": "A study of Greco-Roman mythology and legend, with special emphasis on the Olympian gods and the figure of the hero. Topics may include myths of creation, the rise of the gods, divine myths, the tales surrounding the cities of Troy, Mycenae, and Thebes and the heroes Herakles, Perseus, and Theseus.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "CLAS105",
            "Name": "Introduction to Medieval Studies",
            "Desc": "An introduction to Medieval European civilization focusing on essential aspects of the discipline: history, literature, philosophy, religion, art, architecture and archaeology, law, and science and technology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS123",
            "Name": "Classical Studies in Pop Culture",
            "Desc": "An introduction to the role that classical studies and the classical cultures have played in pop culture. This course will examine specific references, such as ancient Greek myths, and more general trends, such as literary types, in contemporary movies, television shows, comic books, and video games to illustrate the continued fascination with the cultures of Ancient Greece and Rome.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS201",
            "Name": "Love, Life, and Death in Greece",
            "Desc": "This course surveys how different people gave meaning to their lives in ancient Greece. It will cover topics ranging from personal identities, culture wars, sports, art, myth, and history, to sex, slavery, and social justice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS202",
            "Name": "Love, Life, and Death in Rome",
            "Desc": "This course surveys how different people gave meaning to their lives in ancient Roman world. It will cover topics ranging from personal identities, family roles, myth, and history, to sex scandals, slavery, gladiatorial games, and mystery cults.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS205",
            "Name": "Medieval Society",
            "Desc": "A survey of Medieval civilization featuring such topics as the individual, political institutions, art, architecture, religion, philosophy, literature, social life, and leisure activities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS210",
            "Name": "History of Ancient Law",
            "Desc": "A historical introduction to law in the ancient world. Babylonian, Assyrian, Hittite, and Roman law, legal practices, and concepts will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS220",
            "Name": "Philosophy of Friendship",
            "Desc": "Friendship is an essential part of a happy life. Ancient western philosophers made friendship one of the cornerstones of their ethics. This course is an exploration of their views on problems such as the necessity of friendship, its nature, its species, and its relationship to happiness and the political community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHIL 403 taken winter 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS221",
            "Name": "Introduction to Archaeology",
            "Desc": "An introduction to the working assumptions, analytic approaches, and integrative and descriptive methods of archaeological anthropology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS225",
            "Name": "Classics in Political Thought",
            "Desc": "Where do the core tenets of Western political philosophy come from? In this course students will trace the development of political philosophy by examining Ancient Greek plays (e.g., Antigone, Medea) and foundational political texts (e.g., Plato's Republic, Aristotle's Politics) which set the stage for modern Western political thought (Machiavelli and after).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in CLAS",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS230",
            "Name": "Greek and Latin Scientific Terminology",
            "Desc": "This course is an introduction to decoding the vocabulary of many modern scientific, technical, and medical disciplines. The main focus will be on learning the important Greek and Latin word elements found in technical vocabulary, as well as the rules by which words take shape.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "CLAS231",
            "Name": "Studies in Ancient Greek Literature",
            "Desc": "Special topics in ancient Greek literature, as announced by the department. Authors, works, time periods, and topics will vary. Authors studied may include Homer (epic), Euripides (tragedy), Aristophanes (comedy), Thucydides (history), Sappho (poetry), and Plato (philosophy). Topics by which the course will be organized may include gender, slavery, politics, war, peace, death, and love. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS232",
            "Name": "Studies in Ancient Roman Literature",
            "Desc": "Special topics in ancient Roman literature, as announced by the department. Authors, works, time periods, and topics will vary. Authors studied may include Vergil (epic), Seneca (tragedy), Plautus (comedy), Livy (history), Catullus (poetry), and Lucretius (philosophy). Topics by which the course will be organized may include gender, slavery, politics, war, peace, death, and love. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS237",
            "Name": "The Ancient Near East and Egypt",
            "Desc": "A study of the civilizations of the ancient Near East focusing on Mesopotamia (Sumer and Akkad, the Babylonian Dynasty, and the Third Dynasty of Ur), Hatti, Assyria, Egypt, and Persia.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS241",
            "Name": "Survey of Greek Art and Architecture",
            "Desc": "A survey of Greek art and architecture from the earliest times to the coming of the Romans. Material studied may include the art of the Bronze Age, the development of Greek sculpture, the evolution of the Acropolis at Athens, and the change in art and architecture after Alexander the Great.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS242",
            "Name": "Survey of Roman Art and Architecture",
            "Desc": "A survey of Roman art and architecture from the earliest times to the age of Constantine the Great. Material studied may include the art of the Etruscans, the evolution of Roman portraiture, innovations in architectural materials and forms, the use of art and architecture by the Emperors, and the change to Late Antique art.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS251",
            "Name": "Greek History",
            "Desc": "A survey of ancient Greek history, from the Bronze Age to Alexander the Great, emphasizing particularly its political and military aspects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS252",
            "Name": "Roman History",
            "Desc": "A survey of ancient Roman history, from the Republic to the Empire, emphasizing particularly its political and military aspects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS260",
            "Name": "Ancient Science",
            "Desc": "The ancient Greeks developed scientific theories that were influential for over a thousand years. Their worldview was different from ours, but they sought to explain some of the same phenomena that we grapple with today. In this course, we will study ancient Greek theories and methodologies in the sciences, which may include physics, astronomy, mathematics, meteorology, cosmology, astrology, and geography.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHIL 271 taken winter 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS261",
            "Name": "Great Works: Ancient and Medieval",
            "Desc": "A historical survey of ancient and medieval philosophy in the Western tradition.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHIL 250A",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "CLAS311",
            "Name": "Sex and Gender in the Ancient World",
            "Desc": "This course examines a variety of issues around sexuality and gender relations in antiquity, including sexual mores and behaviours; literary, artistic, and philosophical constructs of gender; the roots of misogyny; and the legal and social restrictions placed on women in most ancient societies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One course in CLAS",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS321",
            "Name": "Archaeology of Complex Cultures",
            "Desc": "Cultural development from the agricultural revolution to the rise of literacy. Special attention to the development of agriculture as a means of subsistence and to the rise of early civilization. Areas and periods of emphasis will vary from year to year.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ANTH 201/CLAS 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS325",
            "Name": "Greek and Roman Religion",
            "Desc": "An examination of the religious beliefs and cult practices of the classical world. Topics include prayer and sacrifice; divination and oracles; temples, priests, and festivals; mystery cults and their relation to Christianity.  ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of CLAS 100, 104, 201, 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS326",
            "Name": "The Body, Dress, and Religion",
            "Desc": "From clothing to hairstyles to tattoos, dress can express beliefs, aspects of identity, and power. This course examines dress in a variety of religions from ancient Greece to the modern era. The course includes attention to the look and feel of dress on the body, conflicts that can arise over dress and religion, as well as the role of dress in the formation and maintenance of religious communities. ",
            "Notes": "[Note: The course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS327",
            "Name": "Astrology and Magic",
            "Desc": "An examination of the theory and practice of astrology and magic in the classical and medieval worlds. Topics include the relationship of astrology and magic to traditional Greco-Roman religion and Christianity, occult practices, and the people who performed them.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of CLAS 100, 104, 201, 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS331",
            "Name": "Advanced Studies in Ancient Literature",
            "Desc": "An in-depth examination, through English translation, of a genre(s), author(s), or selected topic(s) in Greek and/or Roman literature. Material studied may include the genres of epic, tragedy, comedy, lyric, and satire, and authors such as Homer,  Virgil, Sophokles, Seneca, Aristophanes, Menander, Plautus, Sappho, Pindar, Catullus, and Horace. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 231 or 232",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS341",
            "Name": "Advanced Studies in Greek Art and Architecture",
            "Desc": "An advanced survey of the art and architecture from a selected time period of Greek history. Material studied may include the art and architecture of the Aegean Bronze Age, and the Archaic, Classical, and Hellenistic periods. Archaeological, historical, and cultural issues specific to each time period will be discussed through the important media of the day. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 241/FINE 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS342",
            "Name": "Advanced Studies in Roman Art and Architecture",
            "Desc": "An advanced survey of the art and architecture from a selected time period of Roman History. Material studied may include the art and architecture of the Etruscans, the Roman Republic, and the Roman Empire. Archaeological, historical, and cultural issues specific to each time period will be discussed through the important media of the day. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 242/FINE 242",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS351",
            "Name": "Advanced Studies in Greek History",
            "Desc": "An advanced study of aspects of Greek history, through the examination of a specific time period, event(s), or theme(s). Topics studied may include the Archaic Age and the rise of the Polis, the Persian Wars, the Peloponnesian War, conflict in the fourth century BCE, the history of the Hellenistic period, and Greek social history. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 251/HIST 242",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS352",
            "Name": "Advanced Studies in Roman History",
            "Desc": "An advanced study of aspects of Roman history, through the examination of a specific time period, event(s) or theme(s). Topics studied may include the Punic Wars, the end of the Republic, the Julio-Claudian Dynasty, history of the High Empire, later Roman history, and Roman social history. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 252/HIST 252",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS361",
            "Name": "History of Ancient Philosophy",
            "Desc": "In this course students will examine one or more important figures, periods, or issues in ancient philosophy. Plato and Aristotle are among the philosophers who may be covered. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: 0.50 units in PHIL",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "CLAS384",
            "Name": "Science and Technology of Ancient Greece and Rome",
            "Desc": "A study of scientific thought and achievements in such areas as astronomy, biology, anatomy, and medicine, and of the technological skills which produced and distributed raw materials, manufactured goods, and agricultural products.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of CLAS 201, 202, 251, 252 or a first year Engineering course or a first year CHEM/EARTH/PHYS course or a second year BIOL/SCI course",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS390",
            "Name": "Classical Studies Abroad",
            "Desc": "This course features a combination of academic study and first-hand investigation of museums and ancient sites, normally in Greece and/or Italy. ",
            "Notes": "[Note: This is a concentrated study course (block format) normally offered in a spring term. This is a repeatable course, subject to different content; it may be completed a total of four times. This course incurs extra costs for the student above and beyond the registration fee in the form of travel, room and board, and incidental costs.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: At least 1.5 units in CLAS and/or GRK and/or LAT",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS461",
            "Name": "Studies in Ancient Philosophy",
            "Desc": "Special topics in ancient philosophy, as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS486",
            "Name": "Senior Seminar",
            "Desc": "Each fall and winter term a senior seminar on some aspect of Greek or Roman civilization will be offered. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 251, 252; CLAS 231 or 232; CLAS 241 or 242",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS490A",
            "Name": "Senior Honours Thesis",
            "Desc": "Students wishing to undertake a senior honours thesis in their fourth year should consult the department's undergraduate officer.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS490B",
            "Name": "Senior Honours Thesis",
            "Desc": "Continuation of the Senior Honours Thesis.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "CLAS492",
            "Name": "Directed Study",
            "Desc": "Under exceptional circumstances, and only with the prior approval of the department, a student may substitute an individualized course of study at the senior level. Such circumstances might include, for example, the student's participation in an approved archaeological dig. For further details, consult the department.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}