{
    "Name": "communicationstudies",
    "Notes": "Courses in Communication Studies are offered through the Department of\r\nCommunication Arts. Many courses emphasize team work and will require\r\nmeetings outside of class time.",
    "Courses": [
        {
            "courseCode": "COMMST100",
            "Name": "Interpersonal Communication",
            "Desc": "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms. Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST101",
            "Name": "Theories of Communication",
            "Desc": "This is an introductory course addressing the major theoretical issues in, approaches to, and applications of communication. Theories from various branches of communication, including interpersonal, group/organizational, rhetorical, mass and cultural, will be explored in-depth. Historical, current, and practical critiques of each theory will be conducted. Coursework is designed to encourage students to give critical consideration to the place of theory within the field of Speech Communication and within everyday life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST102",
            "Name": "Introduction to Performance",
            "Desc": "This workshop course introduces students to the creative processes of performance in a range of formal and informal settings. Emphasis is placed on the student's development as a performer. ",
            "Notes": "[Note: Prior performance experience is not required.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST111",
            "Name": "Leadership, Communication, and Collaboration",
            "Desc": "This course focuses on developing the qualities and transferable skills necessary for integration, continuous learning, and professional development. This course establishes a common baseline of leadership, communication, and collaboration capabilities for Accounting and Financial Management majors. Focus will be on the design and delivery of various types of communication and the development of basic teamwork skills. ",
            "Notes": "[Note: Students will be videotaped.]",
            "Consent": "None",
            "Prereqs": "Prereq: Accounting and Financial Management, Mathematics Chartered Accountancy, or Science Biotechnology/Chartered Accountancy students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: COMMST 204",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST112",
            "Name": "Introduction to Black Arts, Culture, and Literature",
            "Desc": "This course examines the evolution and development of Black Peoples' artistic, cultural, and literary experiences from a global perspective including art and design, theatre and performance, literature, music, spoken word, and other modes of interdisciplinary and transdisciplinary practice. Coursework is designed to immerse students in analyzing Black art, culture, and literature through intersectional, feminist, and queer lenses. The course is designed for both thinkers and creators. Students will engage in the course material through readings, viewings, and field trips around film, comics, anime, popular culture events, plus the visual and performing arts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST149",
            "Name": "Introduction to Critical Design Practices",
            "Desc": "How does design help us think? This studio course introduces students to practice-based methods for generating knowledge. Topics may include prototyping, performance as research, material thinking, multi-modal representation, and experience design. Students will test and explore how we learn differently through creative practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST191",
            "Name": "Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE)",
            "Desc": "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Architectural, Civil, Environmental, and Geological Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GENE 199 taken fall 2017 or fall 2018",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST192",
            "Name": "Communication in the Engineering Profession (COMPE, ELE, MGTE)",
            "Desc": "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Computer, Electrical, and Management Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GENE 191",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST193",
            "Name": "Communication in the Sciences",
            "Desc": "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences. ",
            "Notes": "[Note: This course requires department consent to enrol and to drop or swap the course. Please consult the Science Undergraduate Office who administer this course.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BSc students in the Faculty of Science.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SCCOM 100",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST201",
            "Name": "Introduction to Gender and Sexuality in Communication",
            "Desc": "This course introduces the basic theories for studying the multiple relationships between communication practices and gender. The course emphasizes how communication creates gender and power roles and how communicative patterns reflect, sustain, and alter social conceptions of gender.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST204",
            "Name": "Leadership, Teams, and Communication",
            "Desc": "This course examines leadership, team dynamics, and communication in organizational contexts. Students will develop communication knowledge and skills to enhance their abilities to be effective in leadership and team roles.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Arts and Business students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: COMMST 111",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST210",
            "Name": "Key Concepts in Media and Culture",
            "Desc": "This course introduces foundational theories and lines of inquiry in contemporary media and cultural studies. Students apply media and cultural studies theories and methods through case studies of cultural artifacts ranging from wartime propaganda to memes and viral videos.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST220",
            "Name": "Performance Studies",
            "Desc": "This workshop course in performance studies explores performance as a way of knowing. It investigates performance as artistic practice and as a means of understanding historical, social, and cultural practices, including drama/theatre texts, poetry, narratives, and texts of everyday life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST223",
            "Name": "Public Speaking",
            "Desc": "Theory and practice of public speaking. A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills. Students will be videotaped. ",
            "Notes": "[Note: Must attend first class. May be subject to priority enrolment.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST224",
            "Name": "Black Performance Studies",
            "Desc": "This course explores the genealogies and historical development of Black performance created in regions such as North America, the Caribbean, Africa, and Europe. Students will examine the influences of key artists and theorists. Students will be challenged to apply historical, political, and cultural contexts to the analysis of audio, text-based, and/or audio-visual materials. This course expands students' concepts of Black performance to include performative modes such as performance poetry, TV shows, music, and podcasts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST225",
            "Name": "Interviewing",
            "Desc": "Theory and practice of interviewing. A workshop course which teaches theory, design, and presentation of interviews. Videotaping student exercises will enhance interview design and delivery, as well as listening and critical skills.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (For Mathematics students) one of EMLS 101R, 102R, EMLS/ENGL 129R, ENGL 109, COMMST 100, COMMST 223",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST226",
            "Name": "Introduction to Race, Culture, and Communication",
            "Desc": "This course introduces theories and practices central to the relationship between communication and race/ethnicity. Students gain theoretical and practical understanding of the opportunities and obstacles that exist for racialized equity-deserving groups. Students are prompted to recognize their positionality in relation to race and how communication can be meaningfully used toward anti-racist ends.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; LEVGE 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST227",
            "Name": "Leadership",
            "Desc": "A workshop course in leadership combining theoretical and experiential perspectives.  Students will develop and apply knowledge, skills, and attitudes necessary to be effective and perceptive communicators in a leadership position.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: For Mathematics students one of EMLS 101R, EMLS 102R, EMLS/ENGL 129R, ENGL 109, COMMST 100, COMMST 223; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST228",
            "Name": "Public Communication",
            "Desc": "This course introduces a theoretical framework for understanding the nature and significance of public communication. Strategies and techniques typically employed in political and commercial contexts are examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101 or for Mathematics students one of EMLS 101R, EMLS 102R, EMLS/ENGL 129R, ENGL 109, COMMST 100, COMMST 223; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST229",
            "Name": "History and Communication",
            "Desc": "This course takes a historical approach to the discipline of communication studies. Using a range of historiographic approaches, it analyzes technologies, theories, and practices of communication within the broader context of social and historical change. Potential topics include writing in the ancient world, the printing press, radio and television, cinema and sound recording, the computer and new media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST300",
            "Name": "Special Topics in Digital Design",
            "Desc": "In this course students will learn advanced digital design theory. They will participate in workshops with professional designers, develop specialized digital materials, and contribute signature work to their digital portfolio. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST301",
            "Name": "Topics in Gender and Sexuality in Communication",
            "Desc": "This course offers a sustained engagement with theories and methods used to study communication practices related to gender and sexuality through looking at a specific topic. This course emphasizes how communication practices influence relationships between social conceptions of gender, sexuality, power, identity, and culture. Subject to different content, the course may concentrate on a topic in-depth, such as gender and science, masculinity and race, colonial and non-Western feminisms, queer theory. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 201",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST302",
            "Name": "Topics in Race, Culture, and Communication",
            "Desc": "This course analyzes whiteness, race, and ethnicity with special emphasis on language, media, discourse, rhetoric, and performance through looking at a specific topic. This course will enrich student understanding of the conceptions and impacts of race on communicative practices. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST323",
            "Name": "Speech Writing",
            "Desc": "The analysis, writing, and editing of speeches. This course considers how genre and style impact the creation, reception, and implications of meaning. Students practice writing, as form and style, in the construction of arguments and other genres of speech making.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST324",
            "Name": "Small Group Communication",
            "Desc": "A workshop course which works from theory to develop the skills to work in groups effectively. The principles of group dynamics, leadership, and conflict resolution will be studied and implemented in small group meetings and presentations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST325",
            "Name": "Organizational Communication",
            "Desc": "This course examines organizational theory, the communication process, and the interplay between the two. Students will develop the skills to identify, analyze, and solve a variety of organizational communication problems through case study group work and other workshop-style methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST326",
            "Name": "Performing the Voice",
            "Desc": "Students explore techniques to access and develop the voice as a resource for performance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: THPERF 102/COMMST 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST329",
            "Name": "Designing Digital Presentations",
            "Desc": "In this course students will be introduced to design and production of digital presentations. They will develop specialized digital materials and contribute work to their digital portfolio.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.5 unit of DAC",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST335",
            "Name": "Power, Agency, Community",
            "Desc": "This course examines the ways in which individuals and institutions communicate to enact agency and build communities situated within power relations. Students will develop their understanding of what power and agency are, the relationship of each to communication, and how each constitutes community life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST339",
            "Name": "Media, Images, and Communication",
            "Desc": "This course investigates how distinct modes of communication impact the creation of messages, dissemination or knowledge, and reception of meaning. Students will examine aural, textual, and visual communication in the context of print, electronic, and digital media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST399",
            "Name": "Communication Inquiry",
            "Desc": "This course identifies critical communication inquiry at the individual, group, public, and collective levels of theory and practice. Students will work to develop strategies of engagement or thinking that could extend, modify, or overturn standing theoretical positions and initiate new inquiry. Critique and criticism are developed in order to explore advanced questions within the field of Speech Communication, and students are introduced to critical research methods used by scholars in the field of Speech Communication.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST401",
            "Name": "Advanced Gender and Sexuality in Communication",
            "Desc": "This course further develops theories and methods for studying how communication practices reflect, maintain, and disrupt social conceptions of gender and sexuality. The course emphasizes how gender, sexuality, and communication are implicated in power relations, and how gender and sexuality intersect with multiple dimensions of identity and culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST101, COMMST 201; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST402",
            "Name": "Advanced Race, Culture, and Communication",
            "Desc": "This course is an advanced study of the intersection of communication and race that develops theoretical, critical, and historical perspectives on whiteness and race, racist language and communicative practices, and anti-racist critiques of communication. Students will further explore their own relationships to cultural conceptions of whiteness, race, and ethnicity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 226; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST420",
            "Name": "Persuasion",
            "Desc": "This course examines the communicative, psychological, and sociological aspects of persuasion and persuasive messages, with attention to interpersonal contexts, the role of images, and persuasion in the media and public discourse. This course will explore the ways in which the sending and receiving of persuasive messages involve cognition, emotions, and social norms in everyday contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 223; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST430",
            "Name": "Communication and Social Justice",
            "Desc": "An examination of how communication on the part of individuals, groups, and institutions implicates social justice. Students examine the relationship between communication and justice to understand how the representation and performance of gender, race, ethnicity, and other cultural constructs contribute to social and political conditions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST431",
            "Name": "Crisis Communication",
            "Desc": "This course examines practical and theoretical dimensions of communication in times of crisis. It examines case studies and communication strategies and conducts critical and conceptual analysis of how crisis disrupts and transforms various forms of communication.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST432",
            "Name": "Conflict Management",
            "Desc": "This course focuses on how conflict is communicated and resolved in one-on-one, group, and organizational contexts.  Theoretical perspectives, simulations, role plays, and self-assessment exercises will enhance students' abilities to be successful communicators in conflict situations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST433",
            "Name": "The Organizational Consultant",
            "Desc": "This workshop course will examine the communication skills necessary for the organizational consultant.  Participation in videotaped simulations will allow students to explore consulting styles and training interventions by developing the communications expertise and knowledge specific to the consulting professional.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST434",
            "Name": "The Discourse of Dissent",
            "Desc": "A study of the social, historical, and rhetorical dimensions of collective action. Topics may include health and welfare movements, civil rights and anti-war protests, and environmentalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST435",
            "Name": "Games and Culture",
            "Desc": "This course examines the relationships between games and culture. Students will consider the social, political, and economic dimensions of games and acquire ways of thinking about how games communicate by transmitting, contextualizing, and contesting culturally situated meanings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST440",
            "Name": "Performative Inquiry and Practice",
            "Desc": "This course explores how to create, perform, and analyze performance texts, here defined as including drama/theatre texts, poetry, narratives, and the texts of everyday life. Through readings and creative investigation, students will explore the links between the participant, the researcher, the site, and the impulse of inquiry.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 220; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST471",
            "Name": "Communication, Resistance, and Social Change",
            "Desc": "This course explores the function of communication in advocating for and generating social change, mostly through practices of resistance, protest, and other forms of dissent and collective action. Students will consider how the broader assemblage of media, social, and civic institutions resist change, and will imagine how communication might be used effectively to challenge the status quo.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COMMST 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST475",
            "Name": "Communication Ethics",
            "Desc": "An examination of the interplay between communication and ethics from historical and pragmatic perspectives. Issues discussed include communication in a variety of settings, such as intrapersonal, interpersonal, organizational, public, and intercultural interactions as they relate to personal development, values, meaning making, and ethical ways of communicating.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A or Level at least 2A Philosophy majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST479",
            "Name": "Media and Environment Communication",
            "Desc": "This course will explore the role of media in enabling and/or inhibiting communication about the environment and climate change. After offering an overview of the field of environmental communication, it will engage in an analysis of key issues regarding the role of the media in relation to the environment, such as \"social license to operate,\" the role of alternative media practices, and the environmental impact of media systems themselves. The course will consider a range of different media genres in relation to the environment (e.g., public relations, governmental communication, news media, social media, NGO campaigns, documentaries). What are the primary objectives and strategies of different forms of environmental communication and how do these various media shape public understanding of environmental issues?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST490",
            "Name": "Selected Seminars in Speech Communication",
            "Desc": "Seminars in special areas of speech communication. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST491",
            "Name": "Selected Seminars in Speech Communication",
            "Desc": "Seminars in special areas of speech communication. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST499A",
            "Name": "Senior Seminar",
            "Desc": "This course is designed to give the student an opportunity to complete a comprehensive presentation in their major area of concentration. ",
            "Notes": "[Note: A grade for THPERF/COMMST 499A will be submitted only after the completion of THPERF/COMMST 499B.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Speech Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "COMMST499B",
            "Name": "Senior Seminar",
            "Desc": "This course is designed to give the student an opportunity to complete a comprehensive presentation in their major area of concentration. Second part of THPERF/COMMST 499.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Speech Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}