{
    "Name": "earthsciences",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "EARTH121",
            "Name": "Introductory Earth Sciences",
            "Desc": "This course will provide students with the foundational knowledge to become earth science literate, understanding Earth's influence on humans and human influence on the Earth. Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking. Systematically learning about rocks, geological time, natural resources, natural hazards, and water in this course will prepare students to address many challenges currently facing society and to identify future potential opportunities. ",
            "Notes": "[Note: EARTH 121L is recommended. Offered: F; also offered online S]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: CIVE 153, ENVE 153, GEOE 153",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "EARTH121L",
            "Name": "Introductory Earth Sciences Laboratory",
            "Desc": "For students taking EARTH 121. Laboratory exercises cover selected topics from EARTH 121 lectures. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: EARTH 121",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH122",
            "Name": "Introductory Environmental Sciences",
            "Desc": "This course presents a broad overview of earth system processes and their influence on humans. Course emphasis is placed on anthropogenic impacts on natural systems, the impacts of geologic, biologic, and atmospheric processes on humans, and the effects of human activities on the environment. Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes. ",
            "Notes": "[Note: EARTH 122L is recommended. Offered: W]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ENVS 195",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH122L",
            "Name": "Introductory Environmental Sciences Laboratory",
            "Desc": "For students taking EARTH 122. Laboratory exercises cover selected topics from EARTH 122 lectures. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: EARTH 122",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH123",
            "Name": "Introductory Hydrology",
            "Desc": "This course is intended to provide students with a practical overview of the hydrologic cycle and all of the interesting ways water flows and interacts with its environment, both surface and subsurface. The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems. Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH221",
            "Name": "Introductory Geochemistry",
            "Desc": "Origin, abundance, and geochemistry of elements. Introduction to environmental isotope geochemistry and radiometric dating. Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHEM 123, 125 or level at least 2A Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH223",
            "Name": "Field Methods in Hydrology",
            "Desc": "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques. Emphasis will be placed on the collection, analysis, and interpretation of field measurements. Field exercises will cover groundwater, surface water, meteorological, and water quality. ",
            "Notes": "[Note: Additional field trip fees will apply; Offered: F]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: EARTH 123;",
            "Antireqs": " Antireq: EARTH 123L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH231",
            "Name": "Mineralogy",
            "Desc": "This course provides a systematic study of the physical and chemical properties of the major rock-forming silicate minerals. Study of mineral chemistry, the internal geometry of crystalline solids and the interrelationship of crystal structure to the  physical and chemical properties of minerals. Laboratory work focuses on observing and evaluating the physical properties of minerals and rocks in hand sample in order to identity them. This course includes a weekend field trip to Bancroft, Ontario. ",
            "Notes": "[Note: Additional field trip fees will apply; Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: One of (EARTH 121, 121L), CIVE 153, GEOE 153, ENVE 153",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH232",
            "Name": "Introductory Petrography",
            "Desc": "This course provides an introduction to the petrogenesis of igneous, metamorphic, and sedimentary rocks. Overview of textural, mineralogical, and chemical classification schemes for rocks. Introduction to silicate phase equilibria and the use of mineral stability diagrams to understand petrogenetic processes. Major relationships between tectonic setting and rock types. Laboratory work focuses on using a transmitted light microscope to study the optic properties of minerals in order to identify them as well as observe rock textures and interpret geological histories. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 231",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH235",
            "Name": "Stratigraphic Approaches to Understanding Earth's History",
            "Desc": "An introduction to stratigraphic principles and methods used in deciphering geological history. Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data. Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code. The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations. Interrelating aspects of Earth's physical, chemical, and biological history. Examples are drawn primarily from Canadian geology. Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of (EARTH 121, 121L), CIVE 153, GEOE 153, ENVE 153",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH238",
            "Name": "Introductory Structural Geology",
            "Desc": "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis. Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (EARTH 121 and 121L) or EARTH 153/CIVE 153/GEOE 153/ENVE 153",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH260",
            "Name": "Introductory Applied Geophysics",
            "Desc": "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior. This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods). This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PHYS 112, 122, 125",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH270",
            "Name": "Disasters and Natural Hazards",
            "Desc": "The course will examine the physical causes and affects of natural disasters including landslides, snow avalanches, earthquakes, tsunamis, hurricanes, tornadoes, flooding, subsidence, volcanic eruptions, and asteroid impacts. Illustrated by case histories, the course will analyze the factors that lead to disasters. The effect of climate change, human activity, and population growth on the magnitude and frequency of disasters will be explored. The course will introduce the basic principles of Geo-Risk management and its applications in natural hazards engineering, in the development of mitigation strategies and in the re-insurance industry. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH281",
            "Name": "Geological Impacts on Human Health",
            "Desc": "The importance of geology to health. This includes examining the effects of volcanic gases and dust and other aerosols; tracing the sources and impacts of metals and other naturally occurring geological materials in the Earth's hydrosphere and crust; geology and the bioaccumulation of metals; and distinguishing natural versus anthropogenic processes on the geochemical distribution of toxic material in the near-surface environment. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH321",
            "Name": "Introduction to Geomicrobiology",
            "Desc": "This course will explore how microbial life influences geochemical cycles in natural environments and engineered systems. Emphasis will be on the interactions between microbial activity and environment geochemistry. Topics will include microbial life on early Earth, biomineralization, biosignature preservation, bioremediation, and geomicrobiological research methods. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH322",
            "Name": "Ecohydrology",
            "Desc": "This course examines the global fluxes and transformations of nutrient elements (C, N, P and Si) and metals along the aquatic continuum. Students explore both natural and anthropogenically-driven changes to the chemical composition of water that occur in the atmosphere, rivers, reservoirs, lakes, groundwater, estuaries and oceans. The content will be interdisciplinary and quantitative, with a strong focus on biogeochemical processes that influence the chemical composition and quality of water at different stages of the global water cycle; the content will also include aspects of microbiology, ecology, hydrology and geology. Students will be introduced to geochemical modelling tools used to interpret changes to water quality through the application of equilibrium thermodynamics. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 121, 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH331",
            "Name": "Volcanology and Igneous Petrology",
            "Desc": "Principles and theories of the origins of volcanic and plutonic igneous rocks. Topics include the physics and chemistry of magma; igneous hazards and implications; magmatic differentiation; and igneous tectonic associations. Laboratories focus on the identification, description, and classification of igneous rocks [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 232",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH332",
            "Name": "Metamorphic Petrology",
            "Desc": "Principles and theories of metamorphic rock genesis. Topics include static and dynamic metamorphism, recrystallization, metamorphic facies, thermodynamic equilibrium, metasomatism, and metamorphic signatures of global tectonics. Laboratories focus on the description, classification, and interpretation of metamorphic rocks. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 232",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH333",
            "Name": "Introductory Sedimentology",
            "Desc": "An introduction to sediment properties, sedimentation processes, and sedimentary deposits in a variety of depositional environments and climatic conditions. Processes affecting sediments after initial deposition, such as those involved in the transformation of sediments into sedimentary rocks are also examined. Laboratories will focus on the different methods to describe and interpret sediments and sedimentary rocks. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 232, 235",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH336",
            "Name": "Evolution 2: Fossil Record",
            "Desc": "An overview of the origin of life, how it evolved and diversified, modern principles of paleontology with particular emphasis on analytical tools to interpret ancient life forms. Patterns, processes of evolution and paleoecology of key groups of microfossils, invertebrates, plants, vertebrates and their trace fossils.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 121, CIVE/ENVE/GEOE 153, BIOL 359",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH342",
            "Name": "Geomorphology and GIS Applications",
            "Desc": "An introduction of geomorphology with emphasis on landscape-forming processes. Characteristics and development of various landforms (e.g. mountain belts, volcanoes, impact craters, and those created by erosion/deposition of rivers/glaciers) are introduced. Skills for interpreting landforms in air photos or satellite images (in Google Earth or ArcGIS) are practised in the lab work. Application of Geographic Information Systems (GIS) to Earth Sciences. Basic concepts of GIS and GIS applications in mineral exploration industry and in fieldwork are introduced. Laboratory work of GIS involves map construction and spatial analysis (e.g., landslide hazard assessment). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 121, 122, CIVE 153, ENVE 153, GEOE 153, SCI 250",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH355",
            "Name": "Water: Data to Decisions",
            "Desc": "This course explores approaches for interpreting environmental data to support water decisions using theoretical and computational techniques. These approaches focus on statistical methods, including descriptive statistics, probability, hypothesis testing, frequency and time series analyses, point patterns, and correlation and regression, and also include discussion of analytical and numerical approaches. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 121, EARTH 123, and EARTH 221.",
            "Coreqs": "None",
            "Antireqs": " Antireq: EARTH 491 (Topic: Data to Decisions) taken winter 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH358",
            "Name": "Earth System Science",
            "Desc": "Study of the Earth as a system, with a focus on global climate history and dynamics, biogeochemical cycling, and the impacts of human activity.  Critical analysis and synthesis are emphasized in the context of group presentations and discussions.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 121, 122; EARTH 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH390",
            "Name": "Methods in Geological Mapping",
            "Desc": "Field study in Sudbury and Whitefish Falls areas. Held for at least nine days at end of the winter term. Geological and geotechnical field techniques, map construction, and report writing. ",
            "Notes": "[Note: Additional field trip fees will apply to all students. Depending on availability of space, EARTH 390 is also open to students who do not require this course in their plan. There will be an additional fee for such students. Offered: W]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: EARTH 235.",
            "Coreqs": " Coreq: EARTH 238, 333",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH421",
            "Name": "Advanced Geochemistry",
            "Desc": "The application of chemical thermodynamics to geochemical problems. Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants. Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria. Laboratory session will involve various experiments related to mineral solubility, chemical kinetics, acid-base equilibria, and chemical modelling. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 221",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH435",
            "Name": "Advanced Structural Geology",
            "Desc": "Stress and strain; deformational behaviour of rocks; origin of folds, foliations, lineations, joints and faults; geometrical and kinematic analysis; relationships of structures from the microscopic to the megascopic scale. Labs will include simple experiments, advanced geometrical problems and observation and measurement of microstructure and fabric. ",
            "Notes": "[Note: EARTH 332 is recommended as a prerequisite. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 238",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH436A",
            "Name": "Thesis Proposal",
            "Desc": "The first term of a potential two-term supervised research project in which students prepare a research proposal and conduct research. Students will present their research proposal in an oral presentation and written report. ",
            "Notes": "[Note: In order to progress to a two-term project via EARTH 436B, a grade of 75% must be achieved in this course; Offered: F, S]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A; Honours Earth Sciences, Environmental Science - Geoscience Specialization, and Geochemistry students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH436B",
            "Name": "Honours Thesis",
            "Desc": "An optional second term of a two-term supervised research project in which students learn to gather and interpret data. Students will present their findings in a formal presentation and written thesis. [Offered: W]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: EARTH 436A with a grade of at least 75%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH437",
            "Name": "Rock Mechanics",
            "Desc": "Stress, strain and strength in geomaterials. Origins of stress and stress measurement methods, including hydraulic fracture and strain relief. Rock Mechanics principles and design procedures in areas of mining, civil engineering and petroleum engineering. Monitoring methods, including introduction to microseismic surveillance. Course includes laboratory and project work. ",
            "Notes": "[Note: Prerequisites are not listed for this course which is highly suitable for interested Engineering and Science students. However, some background in engineering, materials science, mechanics or structural geology is recommended; Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH438",
            "Name": "Engineering Geology",
            "Desc": "Review of basic concepts in engineering geology as applied to rock and soil, including material properties, variability in properties, external factors such as stress, and evaluation of design adequacy. Site investigation and characterization techniques used to define and characterize the properties of geological materials and their use in selected engineering geologic design and construction problems. Laboratory assignments will focus on the determination of physical properties and site assessment problems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 238",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH439",
            "Name": "Flow and Transport Through Fractured Rocks",
            "Desc": "Fractures are ubiquitous in geologic media and important in disciplines such as physical and contaminant hydrogeology, geotechnical engineering, civil and environmental engineering, and petroleum engineering among other areas. Despite the importance of fractures, its characterization and predictions of groundwater flow and contaminant transport are fraught with significant difficulties. Students are taught to deal with fractures in hydrogeology, to conceptualize them, and to build reliable models for predicting groundwater flow and contaminant transport. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 458",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH440",
            "Name": "Quaternary Geology",
            "Desc": "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.  Quaternary geochronology. Glacial sediment-land systems. Mineral exploration techniques pertaining to glaciated terrains and hydrostratigraphic analyses of Quaternary basins.  Local field trips.  Laboratory studies on glacial sediments. ",
            "Notes": "[Note: Additional field trip fees will apply. Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 333 or 342",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH444",
            "Name": "Applied Wetland Science",
            "Desc": "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology. Current issues in Canada and abroad will be examined. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH 221, 322, 358, BIOL 350, 351, ENVE 375, 376.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GEOG 405",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH456",
            "Name": "Numerical Methods in Hydrogeology",
            "Desc": "An introduction to the theory and practice of groundwater flow and contaminant transport modeling. Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity. Topics related to contaminant transport will focus on derivation of the contaminant transport equation, a control volume finite difference discretization along with various spatial and temporal weighting schemes and their associated accuracy, monotonicity, and material balance error. Hands-on experience is provided using software applied to industry-standard variably-saturated flow and transport problems, with an emphasis on visualization and interpretation of results. ",
            "Notes": "[Note: EARTH 458, a first-year linear algebra, and a second-year calculus course are recommended. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH458",
            "Name": "Physical Hydrogeology",
            "Desc": "An introduction to physical hydrogeology, including Darcy's law, the groundwater flow equations for steady-state and transient conditions, applications to flow nets, aquifer testing, groundwater resources, and groundwater protection. The role of groundwater in the hydrologic cycle is explored with emphasis on natural groundwater flow systems and their influence on stream flow. Physical processes controlling groundwater contamination are introduced. ",
            "Notes": "[Note:  EARTH 123 is recommended as a prerequisite. Offered: F,S]",
            "Consent": "None",
            "Prereqs": "Prereq: One of EARTH (121 and 121L), (122 and 122L), CIVE 153, ENVE 153, GEOE 153",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH458L",
            "Name": "Field Methods in Hydrogeology",
            "Desc": "An introduction to the principles and theories of mineral deposit genesis. Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered. Laboratories involve hand sample and ore petrology of suites from diverse deposits. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: EARTH 458",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH459",
            "Name": "Chemical Hydrogeology",
            "Desc": "An introduction to the chemical side of hydrogeology with emphasis on groundwater quality and contaminants in the groundwater zone, the geochemical origin of major ions in natural groundwater, causes of hardness, groundwater age determination using isotopes, common causes of groundwater contamination; processes governing contaminant behaviour including dispersion, diffusion and adsorption, hydrogeologic aspects of site selection for waste disposal. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 458; One of EARTH 221, CIVE 375, ENVE 375",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH460",
            "Name": "Geophysical Data Analysis",
            "Desc": "Geophysical data sets require the application of specialized analysis methods to extract information about the Earth's interior. This course covers commonly used concepts and techniques used in geophysical data analysis including spectral analysis, convolution, filtering, and sampling. Emphasis is given to the analysis and processing of radar and seismic reflection profiling data sets. ",
            "Notes": "[Note: A full credit in first-year Calculus is recommended as a prerequisite. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH461",
            "Name": "Near-Surface Geophysics",
            "Desc": "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications. This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods. Techniques for geophysical data acquisition and interpretation are studied and applied to field data. Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH471",
            "Name": "Mineral Deposits",
            "Desc": "An introduction to the principles and theories of mineral deposit genesis. Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered. Laboratories involve hand sample and ore petrology of suites from diverse deposits. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: EARTH 221, 232",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH490",
            "Name": "Field Course",
            "Desc": "One or more trips that emphasize field observations.  Specific trips may be organized to examine field aspects of any of the disciplines within Earth Sciences or Geological Engineering.  Field exercises and reports may be part of the requirements.  Additional field trip fees will apply.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A; Honours Earth Sciences or Environmental Science (Geoscience Specialization) or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "EARTH491",
            "Name": "Special Topics in Earth and Environmental Sciences",
            "Desc": "A lecture course offered in a particular area of Earth and Environmental Sciences, subject to availablity of instructor.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Earth and Environmental Sciences and Geological Engineering students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}