{
    "Name": "economics",
    "Notes": "Some of the courses listed are not offered in the current\r\nacademic year. Up-to-date information on planned course offerings for\r\neach term is available on the Department of Economics website.\nStudents\r\nwho fail to select their courses during the Course Selection Period\r\nmay be unable to take a particular course in their\r\nterm of preference.",
    "Courses": [
        {
            "courseCode": "ECON100",
            "Name": "Principles of Economics",
            "Desc": "This course provides an introduction to the basic concepts and tools of micro and macro economic analysis of individuals, businesses, and government in the global world. Topics may include consumers, producers, market structures, national income accounting, unemployment, and inflation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Mathematics/Chartered Professional Accountancy.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON101",
            "Name": "Introduction to Microeconomics",
            "Desc": "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy. The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Management Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 100/COMM 103",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ECON102",
            "Name": "Introduction to Macroeconomics",
            "Desc": "This course introduces students to the measurement and behaviour of key macroeconomic variables both in Canada and around the world. Topics include national accounts, inflation, interest rates, wages, international balance of payments, business cycles, growth, employment, unemployment, poverty, and inequality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ECON201",
            "Name": "Microeconomic Theory for Business and Policy",
            "Desc": "This course offers an introduction to the theory of market based economies. Topics include consumer choice, production, price and output under perfect and imperfect competition, price discrimination and two part pricing, vertical and horizontal firm boundaries and integration, and market structure.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON206",
            "Name": "Money and Banking 1",
            "Desc": "This course offers an overview of the functioning of the financial system both in Canada and abroad. It includes discussions of money and inflation, financial assets, and financial institutions and intermediaries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON207",
            "Name": "Economic Growth and Development 1",
            "Desc": "This course offers an overview of the enormous differences in living standards across countries and over time, and it considers how these can be traced to differences in economic productivity, investment, population, natural resources, government, inequality, and culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON211",
            "Name": "Introduction to Mathematical Economics",
            "Desc": "An introduction to mathematical techniques of particular use in economics. Topics include matrix algebra, differentation, partial derivatives, optimization techniques including constrained optimization - all developed within the context of economic problems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM103; one of MATH 104, 4U Advanced Functions, 4U Calculus and Vectors; Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON212",
            "Name": "Introduction to Game Theory",
            "Desc": "Game theory analyzes the strategic interaction between agents. It has applications in various fields including economics, law, political science, biology, and computer science. This course introduces the basic tools of game theoretic analysis and examines applications such as auctions, business strategy, and curbing carbon emissions. The course includes an experiential learning component where students play strategic games against each other.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON221",
            "Name": "Statistics for Economists",
            "Desc": "This course introduces students to describing economic data and drawing inferences from features of economic data. Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena. Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models. The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; Not open to students in the Faculty of Mathematics.",
            "Coreqs": " Coreq: ECON 211 or Science and Business students or Biotech/Chartered Professional Accountancy students.",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON231",
            "Name": "Introduction to International Economics",
            "Desc": "This course explores international trade in goods and services, as well as the international exchange of financial assets. Economic theories will be examined, which help explain how international transactions affect the world's economies. Topics include the theory of comparative advantage and the gains from trade, tariff theory, concepts and measurement of balance of payments, exchange rate systems, and the international monetary system.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON241",
            "Name": "Introduction to Public Economics",
            "Desc": "This course examines the scope and level of government involvement in economic activity. The main focus is on historical trends and recent developments in the extent and composition of government spending, taxation, and regulation in developed nations. A secondary focus is to introduce the current policy debates in these areas.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON254",
            "Name": "Economics of Sport",
            "Desc": "The course will develop fundamental economic concepts in the context of the sports industry. The course begins with an investigation of some of the primary aspects of the way that the sports industry is organized. The course then considers labour economics in the context of sport. Finally, the course examines the issues that arise with the introduction of various levels of government and/or regulatory bodies in the sports industry, looking at competition between cities for sports teams.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON255",
            "Name": "Introduction to the Economics of Natural Resources",
            "Desc": "This course uses the theory and tools of economics to explore key problems in natural resource use and management. The meaning and implications of natural resource scarcity are explored, as well as how the insights of economics can be used to guide policies to promote a more sustainable path for our future. The course examines issues of economic efficiency and equity in specific resource sectors such as energy resources, fisheries, forestry, and water.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON256",
            "Name": "Introduction to Health Economics",
            "Desc": "Why are some people healthy and others not? Why is health different from other goods and services? How do the many stakeholders interact in health care markets? Why do countries have different health care systems? This course introduces students to how the theories and tools of economics can be used when examining health, health care, and health care policies. Concepts such as supply and demand, uncertainty, and utility will be introduced in the context of health and health care markets. While international institutions may be discussed, the course will emphasize Canadian health care markets.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON261",
            "Name": "Philosophy of Economics",
            "Desc": "This course considers conceptual, methodological, foundational, and ethical issues in economic theory and practice. Questions include: What can philosophy teach us about economic methodology and justification? Are economic formalizations useful idealizations of human behaviour? Is economics a science? What role do values play in economic reasoning and policy-making?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON262",
            "Name": "History of Economic Thought",
            "Desc": "This course studies approaches to economic problems in historical context. Authors examined may include Smith, Malthus, Ricardo, Marx, J.S. Mill, Walras, Marshall, Veblen, Keynes, Hayek, Aumann, Debreu, and Stiglitz.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON290",
            "Name": "Models of Choice in Competitive Markets",
            "Desc": "Choice lies at the heart of all economic models. This course focuses on choice by consumers and firms. It explains the notion and use of utility functions and budgets, and shows how their interaction allows economists to make predictions about behaviour. The constrained maximization techniques from ECON 211 are used extensively, and extended to situations covering uncertainty (risk) and time. Profit maximization by firms is explored.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON101 or ECON100/COMM103;ECON211 or one of MATH128,138,148; ECON221 or one of ARTS280,ENVS278,KIN222,232,PSCI214/314,PSYCH292, REC371, SDS250R, SMF230, SOC/LS280,STAT202, 206,211,220,230,240, SWREN250R; or Math/FARM students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON306",
            "Name": "Macroeconomics",
            "Desc": "This course introduces students to the analysis of inter-temporal trade-offs in macroeconomics and macroeconomic policy. Its main objective is to show how economists use economic theory to analyze the role of incentives and general equilibrium considerations in the macro-economy. Applications include national savings and investment, business cycles, and monetary and fiscal policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 102; ECON 391",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON311",
            "Name": "Mathematical Economics",
            "Desc": "This course builds on and expands the material in ECON 211. Multi-variate calculus and optimization are covered in detail, with a focus on economic applications of the envelope theorem. The implicit function theorem and its uses in comparative statics are explored. Difference and differential equations and their application to dynamic models are introduced, culminating in an introduction to optimal control.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 201, 202, ECON 211; or ECON 391; Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON322",
            "Name": "Econometric Analysis 1",
            "Desc": "This course covers the core topics needed to estimate linear models using ordinary least squares and to interpret estimates for cross-sectional data. Students will learn to interpret the coefficients of linear models for continuous and discrete regressors, to conduct reliable inference for different specifications of the error term, and to determine which model is the most suitable among the class of linear models. Students will be introduced to a statistical software package and will be required to complete regular computer-based assignments throughout the course using economic data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 221; (or for Mathematics students (ECON 101 and 102) or (ECON 100/COMM 103); One of STAT 220, 230, 240) or for Accounting students, ECON 101, 102, STAT 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON323",
            "Name": "Econometric Analysis 2",
            "Desc": "This course covers the most important methods used in applied economics research beyond the least-squares estimator. It starts by exploring solutions to the endogeneity problem in detail, emphasizing proper ways of conducting causal inference. It extends the methods covered in ECON 322 to the case in which the data are observed over time. Students will learn how to estimate and interpret dynamic models and how these models affect our ability to do inference. The course also covers methods for data in which the response variable is either qualitative, with or without multiple levels, or count data. For that purpose, it introduces students to maximum likelihood estimation, and the estimation of models by probit, logit, and Poisson regressions. Assignments have the same data-based focus as in ECON 322.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 322",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON332",
            "Name": "International Finance",
            "Desc": "An analysis of the main issues in international finance. Topics include international borrowing and lending, intertemporal gains from trade, current account and balance of trade movements, the determination of exchange rates, and foreign exchange markets.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 206; ECON 201 or ECON 290",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON351",
            "Name": "Labour Economics",
            "Desc": "A study of the supply of labour by individuals (and unions) and the demand for labour by firms. Topics include the labour market effects of social assistance, unemployment insurance and minimum wages, discrimination in the labour market, efficient wage contracts, the determinants of wage inflation and unemployment.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON361",
            "Name": "Cost-Benefit Analysis and Project Evaluation",
            "Desc": "Methods for evaluating private and public projects; decision rules, efficiency conditions, and methods of conducting cost-benefit analysis. Application of the technique. This course assumes prior familiarity with probability, expected values, and variance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 201 or ECON 290; ECON 221 or any prior course in probability and/or basic statistics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ECON363",
            "Name": "The Economics of Social Problems",
            "Desc": "A topic-oriented course. Problems are selected from a list that includes regulatory economics, poverty, unemployment, industrial policy, safety, social policy, government deficits/debt, stabilization policy, and others. The format assists the student in gaining analytical skills through work on the selected topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 102; ECON 201 or 290",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON366",
            "Name": "Gender and Economics",
            "Desc": "This course explores historical trends and economic theories and models to investigate the development of gender norms and changes in those norms across time. It questions whether physiological differences, economic models (e.g., comparative advantage, specialization, or discrimination) or social constructs can explain gender differences in roles within the family, education, work, pay, and poverty and the changes in these differences across time. Social policies designed to diminish gender differences will be scrutinized. Some topics/questions that may be addressed include the rise in labour force participation of women post World War II; occupational and wage differences between men and women; changing educational attainment; and how men and women make decisions regarding marriage, fertility, child care, elder care, and divorce.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 102; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON371",
            "Name": "Business Finance 1",
            "Desc": "The course explores decisions faced by managers of firms. In particular, decision-makers must determine which long-term real investment opportunities to exploit. Once undertaken, managers must decide how to finance the projects, for example, by debt or equity. The course develops both the conceptual framework and the tools required for these decisions. The course assumes prior familiarity with probability, expected values, and variance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101 or ECON 100/COMM 103; ECON 221 or any prior course in probability and/or basic statistics; Level at least 2B.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 271/273, AFM 274/371, ACTSC 372 after fall 2014",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON372",
            "Name": "Business Finance 2",
            "Desc": "This course examines a number of topics relevant to financial practitioners. The topics examined may include options, derivatives securities, futures markets, swaps and hedging. The course assumes prior familiarity with probability, expected values, and variance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON371; ECON211 or one of MATH106/136/146; ECON 221 or any probability and/or basic statistics course; or students in the Faculty of Mathematics ECON101 or ECON100/COMM103, ECON102 and ACTSC372 after fall 2014.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ACTSC446 (ACTSC students)",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON381",
            "Name": "Special Topics",
            "Desc": "One or more special topics courses may be offered at different times as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON382",
            "Name": "Special Topics",
            "Desc": "One or more special topics courses may be offered at different times as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON391",
            "Name": "Equilibrium in Market Economies",
            "Desc": "Central to the study of economics is the concept of an equilibrium in which the actions of individuals are not only individually optimal, but are also consistent with each other; such as when the total amount of a good that individuals wish to purchase equals the total amount available. This course introduces students to the notion of equilibrium for a market and market economy. The properties of such equilibria are explored, both in terms of model logic (existence, uniqueness) as well as in terms of the desirability of the equilibrium outcomes (efficiency, welfare). Partial equilibrium (in a single market) as well as general equilibrium (in all markets at once) are covered for models with endowments, production, uncertainty, and time.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 290",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON392",
            "Name": "Strategic Situations and Welfare Economics",
            "Desc": "Many economic decisions are made in circumstances where there are no competitive markets. This course introduces students to individual and group choice in such settings. It covers how to model such settings as \"games\" in both the extensive and strategic form, and introduces the key equilibrium concepts associated with these models. An introduction to considerations in group decision making via co-operative game theory and welfare economics is provided in the last part of the course.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 290",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON393",
            "Name": "Market Failures",
            "Desc": "This course explores the many ways in which the assumptions of the perfectly competitive model are violated in the real world, and the consequences of these market failures for consumers and firms. The course examines potential government intervention to \"fix\" the failures as well as the limits of government intervention. Topics include monopoly/monopsony, externalities, the tragedy of the commons, public goods, asymmetric information, and incomplete information.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 391",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON406",
            "Name": "Money and Banking 2",
            "Desc": "This course examines the monetary and financial aspects of the macro-economy. It prepares students to conduct analyses of problems and policies in monetary economics. Topics may include analyses of the banking system, financial crises, and monetary policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306, ECON 393; ECON 323 or one of STAT 221, STAT 231, STAT 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON407",
            "Name": "Economic Growth and Development 2",
            "Desc": "The goal of this course is to understand the enormous differences in living standards across countries and over time. It uses economic analysis to understand the sources of investment and innovation, and the role of economic, social, and political institutions in economic growth and development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306, ECON 393; ECON 323 or one of STAT 221, STAT 231, STAT 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON408",
            "Name": "Business Cycles",
            "Desc": "This course prepares students to conduct analyses of problems and policies associated with macroeconomic fluctuations. It examines the empirical features of business cycles, and discusses how macroeconomic models help to understand business cycles and to assess the consequences of alternative macroeconomic policies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306, ECON 393; ECON 323 or one of STAT 221, STAT 231, STAT 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON409",
            "Name": "Workers, Jobs, and Wages",
            "Desc": "This course examines the role of labour markets in the macro-economy. It focuses on the analysis of aggregate employment, unemployment, labour force participation, and earnings inequality. The main goal of the course is to understand current labour-market outcomes both in Canada and around the world.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306, ECON 393; ECON 323 or one of STAT 221, STAT 231, STAT 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON412",
            "Name": "Topics in Game Theory",
            "Desc": "This course builds on ECON 392 to give students a broader exposure to game theory. Possible topics include extensive games with imperfect information, evolutionary games, repeated games, as well as applications of game theory such as auctions and negotiations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 392; Level at least 3B Honours Economics, Honours Mathematical Economics (BA and BMath), Joint Honours Economics or Science Biotechnology/Economics students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON421",
            "Name": "Econometric Theory",
            "Desc": "This course offers an advanced treatment of topics covered in ECON 322/323 through the extensive use of matrix algebra, statistical theory and numerical methods. After a review of the required mathematics, these tools will be used to derive the least-squares estimator for the standard linear model and to conduct inference about features of the model, checking the results of theory using regression software and economic data. Then this framework will be used for theoretical generalizations of the model and their estimation using regression software. By the end of the course, students will be able to estimate a linear model and conduct accurate inference in cases where economic data violate the assumptions of the standard linear regression model. This includes methods for dealing with heteroskedastic data, observations that may be dependent over time, response distributions with heavy tails or limited range (such as binary outcomes and count variables), and observations that may suffer from selection bias.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 323, STAT 221, 231, 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON422",
            "Name": "Microeconometric Analysis",
            "Desc": "This course investigates advanced estimation and inference techniques for microeconomic data. Students will learn about error components models that are used for economic data that exhibits significant unobserved heterogeneity. The estimation of treatment effects using fixed effects and difference-in-differences methods will be covered, and design-based methods of causal inference such as matching and regression discontinuity may be covered as well. Extensions such as multilevel or hierarchical models, limited dependent variable models, duration models or selection models may also be included. Students also learn how to apply these methods using computer software, and will use it to analyze complex data from household and firm-level surveys in assignments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 201 or ECON 290; One of ECON 323, STAT 221, 231, 241;\nHonours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON423",
            "Name": "Time Series Econometrics",
            "Desc": "This course introduces students to popular methods and practices of analyzing data that exhibit dependence over time. The topics may cover fundamental linear time series models (autoregressive processes, moving average processes and their generalizations), modelling time-varying volatility (the autoregressive conditional heteroskedasticity or ARCH family of models and stochastic volatility models), multivariate time series analysis, non-stationary models, and ongoing topics in modern time series econometric research. The course is designed to balance the introduction of statistical theory and applications with empirical data. A main component of this course consists of practical exercises and an empirical project with real data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 323, STAT 221, 231, 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON424",
            "Name": "Machine Learning in Economics",
            "Desc": "This course is an introduction to prediction in economics using machine learning. Topics may include supervised and unsupervised learning, text analysis, regression trees, penalized regression, classification, random forest, neural network, and boosting methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 323, STAT 221, STAT 231, STAT 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON425",
            "Name": "Non-Parametric Methods in Economics",
            "Desc": "This course explores estimation and inference techniques that do not impose any parametric assumption on the data. Topics may include kernel estimation and sieve estimation methods. Students may also be introduced to semi-parametric methods such as empirical likelihood.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 323, STAT 221, STAT 231, STAT 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON426",
            "Name": "Quantile Regression in Economics",
            "Desc": "This course explores techniques to estimate conditional quantiles of a responsive variable. As opposed to least squares methods, which estimate the conditional mean, it provides a more complete picture of relationships between variables.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 323, STAT 221, STAT 231, STAT 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON436",
            "Name": "International Trade",
            "Desc": "An examination of theories of international trade. Topics include the gains from trade, theories of trade determination (Ricardian, Heckscher-Ohlin, increasing returns to scale), the effects of tariffs, multinational corporation behaviour, and factor mobility.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 393; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON437",
            "Name": "Urban Economics",
            "Desc": "This course examines how spatial relationships inform many economic behaviours, and contribute to urban development and inequality. Topics include how geography, cumulative investments, and state structures influence the spatial distribution of economic activity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 206, 207, 231, 306; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 483 taken spring 2015, 2016, winter 2017, 2018, 2019, 2020",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON441",
            "Name": "Public Economics",
            "Desc": "This course examines to what extent government spending, taxation, and regulation policies in developed nations are driven by economic rationales for government involvement in economic activity. Both efficiency and distributional rationales are considered. Examined areas of government spending include education, pensions, infrastructure, health care, science, innovation, and social welfare programs. Examined areas of the tax structure include personal income taxes, corporate taxes, consumption taxes, and environmental taxes. Examined areas of regulation may include topics such as alcohol, organ transplants, and gasoline standards. A key aim of the course is to generate an appreciation of how theories of market failure guide public policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 323, 393",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON443",
            "Name": "Advanced Public Economics",
            "Desc": "This course covers advanced topics in public economics and introduces students to the current research frontier in public economics. Examined areas may include topics such as public choice and voting, dynamic tax policy modelling, tax competition, regulatory capture, policy reform, fiscal federalism, and equalization. Both theoretical and empirical recent research will be covered. For each research topic covered, the course provides an introduction to the relevant background literature. A key course aim is to gain an appreciation of how research can inform public policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 323, 393",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON445",
            "Name": "Industrial Organization and Public Policy",
            "Desc": "This course analyzes the structure of markets and how firms compete in them. The emphasis is on oligopoly markets and the use of game theory. The course focuses on differentiated goods, price discrimination, barriers to entry, vertical relationships, advertising, strategic behaviour, and empirical industrial organization including the estimation of demand and costs. Applications to competition policy emphasizing the evaluation of horizontal mergers are presented as well.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 323, ECON 391; Honours students or Economic majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON451",
            "Name": "Law and Economics",
            "Desc": "Legal rules and jurisprudence can have a significant effect on resource allocation. A key question is whether legal regimes affect the optimality of an equilibrium and succeed in bringing society closer to a welfare maximizing outcome. From another perspective, a relevant question is on the objective or motivation behind the enactment of specific legislation. Recent studies suggest that much legislation is consistent with simple welfare concepts developed by economists. The course focuses on these issues with examples drawn from property, contract, tort, and criminal law.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 201, 211; or ECON 391; Level at least 3A Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON452",
            "Name": "Topics in Labour Economics",
            "Desc": "This course presents an overview of the relevant theoretical and empirical research questions related to employment relationships (pay, mobility, workplace organization). The course will offer a combination of tools (theoretical or statistical) and applications of these tools to various topics. Each topic addresses research questions for which we will see the associated seminal papers and more recent papers providing the latest findings on the given topic. The findings may come from new theoretical arguments, data improvement and/or finer methodological tools, all offering a way to better address the question.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 391; One of ECON 323, STAT 221, 231, 241; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON456",
            "Name": "Topics in Health Economics",
            "Desc": "This course explores the theories and models developed to study the health and health-care sectors from an economic viewpoint. The course will focus on the economic tools necessary to evaluate the efficiency of the market for, and the efficient allocation of scarce resources in, health and health care. Examples of possible topics to be covered are the nature of the market, supply and demand of health care, asymmetries of information, externalities, principal-agent relationships, insurance, and cost-benefit analysis.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 393; One of ECON 323, STAT 221, STAT 231, STAT 241: Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON457",
            "Name": "Environmental Economics",
            "Desc": "Application of economic theory to problems of the environment, in particular, air, water, and land pollution. Emphasis is on the theory of the management of common property resources. ",
            "Notes": "[Note: Formerly ECON 357.]",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 102, ECON 391; One of ECON 323, STAT 221, STAT 231, STAT 241.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 357",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON458",
            "Name": "Water Resource Economics",
            "Desc": "The course combines water economic theory and practice, addressing major global water challenges such as climate change, water scarcity, flood risks, water quality, and resource recovery in a circular economy. Particular attention will be paid to water resource valuation and water pricing. Students will play water games and write an economic assessment paper about the costs and benefits of water, food, and energy security related to large-scale water infrastructure such as dam building in a transboundary river basin.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 101; ECON 221 or one of ARTS 280, ENVS 278, KIN 232, PSCI 314, PSYCH 292, REC 371, SDS 250R, SMF 230, SOC/LS280, STAT202, STAT206, STAT211, STAT220, STAT230, STAT240, SWREN250R; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 484, Topic 09: Water Economics",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON467",
            "Name": "Canadian Economic History",
            "Desc": "The course begins with an examination of the processes of state formation, trade, migration, borrowing, and transfer of technologies and institutions that contributed to the development of a settler colonial economy. It will study how the internal economic geography of Canada was differentiated, and how the economy modernized through changes in market and business organization and state development. An overarching concern will be with how a national economy could be articulated.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 206, 207, 231, 306; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 483 taken winter 2015, 2016, spring 2017, 2018, 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON471",
            "Name": "Computational Economics",
            "Desc": "Basic concepts and techniques of computational economics. Topics may include computable general equilibrium models, data and calibration, system sensitivity, and dynamic extensions. Depending on class backgrounds and interests, applications may cover areas such as economics of taxation, international trade, industrial organization, economic history, development, environment, dynamics, and finance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306; Honours students or Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON472",
            "Name": "Senior Honours Essay",
            "Desc": "Students are required to identify a research topic, conduct research independently, write a research paper, and attend class meetings. Each student is supervised by a member of the Economics faculty. Class meetings cover topics such as a general overview of research methods in economics, research ethics, finding reference material, citing practices, and effective writing and presentation.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Economics or Honours Mathematical Economics (BA and BMATH) students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON474",
            "Name": "Numerical Methods for Economists",
            "Desc": "This course covers important topics related to scientific computing through applications in microeconomics, macroeconomics, and econometrics. The topics include floating point arithmetic, nonlinear equations, constrained and unconstrained optimization, numerical derivatives and numerical integration, differential equations, and dynamic models. Students will also develop their programming skills by learning strategies to write structured and efficient programs.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 311, 392, 393; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON483",
            "Name": "Special Topics",
            "Desc": "Special topics that may vary with individual instructor's areas of research interest. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON484",
            "Name": "Special Topics",
            "Desc": "Special topics that may vary with individual instructor's areas of research interest. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Economics majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON487",
            "Name": "Special Studies",
            "Desc": "Research and reading course under the direction of individual instructors.  See Economics undergraduate officer for course registration.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON488",
            "Name": "Special Studies",
            "Desc": "Research and reading course under the direction of individual instructors. See Economics undergraduate officer for course registration.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON489",
            "Name": "Special Studies",
            "Desc": "Research and reading course under the direction of individual instructors. See Economics undergraduate officer for course registration.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON491",
            "Name": "Advanced Microeconomics",
            "Desc": "This course prepares students for graduate-level theory courses. Students will be exposed to a selection of topics treated with the mathematical rigour required for graduate work.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 392, 393; Level at least 4A Honours students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ECON496",
            "Name": "Advanced Macroeconomics",
            "Desc": "This course provides students with the methodological principles that underlie modern analyses of the macro-economy, and to prepare students for graduate-level macroeconomic theory courses.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ECON 306, ECON 393; One of ECON 323, STAT 221, STAT 231, STAT 241; Level at least 4A Honours students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}