{
    "Name": "environmentandbusiness",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ENBUS102",
            "Name": "Introduction to Environment and Business",
            "Desc": "Introduction of ways in which business has and is responding to environmental and business issues; business and sustainable development; issues of corporate/business greening.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: SFM 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS112",
            "Name": "Operationalizing Sustainable Development within Business",
            "Desc": "This course will explore organizational structures within business.  Discussions will focus on factors that deter organizational change along with the means of overcoming these issues. A variety of guest speakers will demonstrate how the greening of industry has affected organizational structure in different business sectors. This course includes a review of business case studies where environmental management changes have resulted. ",
            "Notes": "[Note: Formerly ENBUS 312]",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS202",
            "Name": "Environmental Management Systems",
            "Desc": "The examination and evaluation of environmental management systems such as ISO 14001. Alternate EMS systems will be compared and reviewed to identify their respective strengths and weaknesses. Case studies will be used to illustrate the ideas presented.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 102; Accounting and Financial Management or Environment and Business students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS203",
            "Name": "Green Entrepreneurship",
            "Desc": "This course examines the role of entrepreneurship in finding solutions to environmental challenges. Discussions will focus on understanding entrepreneurship and the forces that are shaping contemporary green entrepreneurship. Students will also be introduced to the entrepreneurship process by assessing an environmental challenge, finding a solution, and developing a green business model.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MGMT 220/ARBUS 200/201",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS204",
            "Name": "Principles of Industrial Ecology",
            "Desc": "The course presents the history of industrial ecology, defines its key concepts, presents its main methods, and discusses future directions. Local, national and international case studies will be discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS211",
            "Name": "Principles of Marketing for Sustainability Professionals",
            "Desc": "This course explores the principles of marketing with a focus on sustainability issues. Topics that will be explored include green consumerism; greenwashing, the incorporation of environmental considerations into successful products and services; the role of social marketing, government regulations, and other incentives related to green marketing. ",
            "Notes": "[Note: Formerly ENBUS 311]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: BUS 352W, ENBUS 311, MGMT/ECON 344, MGMT 244/ARBUS 302",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS302",
            "Name": "Strategies for Environment and Business",
            "Desc": "A review of the successes and failures of businesses which have attempted to adopt sustainability principles into their strategies and practices. Case studies will be reviewed to identify barriers to adopting environmental priorities and the processes which proved successful in overcoming these obstacles.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS304",
            "Name": "Circular Economy",
            "Desc": "Students will be equipped with the knowledge and expertise required to design and implement a circular economy initiative and monitor its progress through circularity indicators. In addition, students will be guided in assessing the business value of circular economy cases. Students will also gain a deep understanding by considering the individual circular economy cases from a system perspective to get a complete picture of environmental gains and losses.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 204; Level at least 2B.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 409 001 S19; ENBUS 375 041 S20",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS306",
            "Name": "Research Design",
            "Desc": "This course introduces students to the basic principles, concepts, and\nvalues of doing research in environment and business. It will examine\ndifferent research strategies and designs; define research questions; address ethical issues of involving human subjects in business research; identify primary and secondary data sources; and assess the effectiveness of various ways of communicating research results. This course takes stock of the quantitative research methods covered in earlier ENVS courses and introduces the basics of qualitative, quantitative, and mixed methods to provide further foundation for the fourth-year research projects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Environment and Business",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS308",
            "Name": "Sustainability Management Standards and Auditing",
            "Desc": "Standards and auditing approaches used for sustainability management are examined. Public standards, like those from the International Organization for Standardization, are contrasted with private standards, developed by specific industries for product transparency and accountability in supply-chains. Auditing practice, as defined by the ISO 19011 standard, is examined including principles, steps, reporting and important concepts. Examples of performance standards and management system standards are explored, covering industrial, social and environmental issues. Lectures may be supplemented by required field trip(s) and/or field work. ",
            "Notes": "[Note: Field trip fee: up to $50+HST]",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 202, 204",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS309",
            "Name": "Applied Social Marketing",
            "Desc": "Social marketing uses social psychology and marketing concepts to promote behavioural change (e.g. anti-smoking campaigns, promotion of household energy conservation, and so on). This course will focus on developing an understanding of social marketing and behavioural change models. These concepts will be applied in the context of sustainability issues, using case studies to demonstrate successful (and not so successful) social marketing programs.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS310",
            "Name": "Introduction to Sustainable Finance",
            "Desc": "In this course, the basics of sustainable finance will be explored. The course will cover topics such as green corporate finance, sustainability accounting, sustainable banking, climate finance, and social banking.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 409 081 W19, SFM 310",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENBUS314",
            "Name": "Sustainable Business Models",
            "Desc": "Development of alternative business models has important implications for sustainability. This course will explore the emergence of entirely new sustainable business models along with the revitalization of 'old' alternative business models from the past.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS315",
            "Name": "Fashion, Consumption, and Sustainability",
            "Desc": "A sustainability lens is used to explore the intersection of fashion and consumption. With a focus on textiles and cosmetics, we will explore aspects of design, diversity and inclusion, ecolabelling, waste, material innovations, and the culture of consumption.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 375 002 S20; ENBUS 375 041 S21",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS375",
            "Name": "Special Topics in Environment and Business",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in environment and business, including field courses. ",
            "Notes": "[Note: Field trip fee may be required.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENBUS402A",
            "Name": "Environment and Business Project",
            "Desc": "The application of the principles learned in earlier courses will focus on a particular project. Applications may include group projects of sufficient scope to demonstrate mastery of problem-solving, integration, and communication on a selected topic related to environment and business, or on selected environmental issues related to a specific business operation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Environment and Business or International Development students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 403A",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS402B",
            "Name": "Environment and Business Project",
            "Desc": "A continuation of ENBUS 402A. ",
            "Notes": "[Note: Course fee $30-$60]",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 402A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 403B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS403A",
            "Name": "Sustainable Entrepreneurship Project",
            "Desc": "A project course to integrate ideation, communication and problem-solving skills with venture proposal and prototype preparation. Students will learn about and be connected with various elements of the local entrepreneurship ecosystem. A sustainability lens will be used to assess the solution proposed. Teamwork is encouraged.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 4A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 402A, SVENT 225P, SVENT 325P",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS403B",
            "Name": "Sustainable Entrepreneurship Project",
            "Desc": "A continuation of ENBUS 403A.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 403A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 402B, SVENT 225P, SVENT 325P",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS405",
            "Name": "Introduction to Life Cycle Assessment",
            "Desc": "This course builds students' technical competencies in life cycle assessment (LCA) and in critical analysis of products' environmental impacts through an understanding of life cycle management. Course content covers the International Organization for Standardization (ISO) life-cycle assessment framework, how to conduct technical LCA (including applying quantitative approaches using LCA software and databases, as available and appropriate), challenges of application of LCA to a range of product systems, limitations of LCA, and product life cycle management concepts for business and policy decisions. Students will use the knowledge gained to conduct their own technical LCA. ",
            "Notes": "[Note: Formerly ENBUS 307]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 307",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS406",
            "Name": "Industrial Ecology: Sustainable Materials",
            "Desc": "Sustainability of industrial materials is examined, including resources, production, use, and end-of-life. Different types of industrial materials and major applications (buildings, transportation, communications, etc.) are covered. Industrial ecology and management approaches help restructure production systems and support sustainable development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENBUS 204; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS407",
            "Name": "Corporate Sustainability Accounting and Reporting",
            "Desc": "The course focuses on the environmental reporting mechanisms required of businesses in North America and overseas. The course will also evaluate best practices with reporting performance in different business sectors.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A; Accounting and Financial Management or Environment and Business students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS408",
            "Name": "Best Practices in Regulations",
            "Desc": "Well-crafted environmental regulations, smart regulations, can not only protect the environment but also enhance business competitiveness. This course will discuss issues with regard to smart regulations from the viewpoint of various stakeholders, for example, governments, businesses, and customers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS410",
            "Name": "Engaging Stakeholders",
            "Desc": "Business practices need to reflect responsibility not just to shareholders, customers and staff, but also towards the local community. This course discusses what this means for management, and the strategies and practices that are needed to express this responsibility successfully.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A; Accounting and Financial Management or Environment and Business students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS411",
            "Name": "Corporate Social Responsibility in Practice",
            "Desc": "The course will focus on corporate responsibility, including social and environmental obligations. The course will consider methods of creating a culture of integrity; examine and evaluate methods such as due-diligence processes, risk assessment, sustainability assessment to integrate responsibility into day-to-day business positions; and evaluate social and sustainability reports; evaluate methods to determine the link between responsibility and increased profitability and benchmark responsibility in different business sectors including non-profit organizations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENBUS475",
            "Name": "Special Topics in Environment and Business",
            "Desc": "This course will allow for additions to the program on a short-term basis, and for the development of future permanent courses. ",
            "Notes": "[Note: Field trip fee may be required]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        }
    ]
}