{
    "Name": "english",
    "Notes": "Not all courses are offered within an academic year. Please\r\nconsult with the Department of English Language and Literature\r\nregarding current course offerings.\nMany courses are also taught at St. Jerome's University.\n\"R\"courses are administered by Renison University College,\r\nand several of the other courses are also taught there.",
    "Courses": [
        {
            "courseCode": "ENGL100A",
            "Name": "Fiction",
            "Desc": "An introduction to fiction through the detailed examination of a range of novels and/or short stories.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL100B",
            "Name": "Poetry",
            "Desc": "An introduction to poetry through a detailed examination of a range of poetic texts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL100C",
            "Name": "Drama",
            "Desc": "An introduction to dramatic literature through the detailed examination of a range of dramatic texts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL101A",
            "Name": "Introduction to Literary Studies",
            "Desc": "An introduction to the study of literature, covering such areas of enquiry as literary history, genre, criticism, analysis, and theory.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL101B",
            "Name": "Introduction to Rhetorical Studies",
            "Desc": "This course introduces students to rhetoric: the art of persuasion. The history, theory, practice, and impacts of rhetoric will be considered. Students will analyze persuasive artifacts including propaganda, advertisements, political texts, and scientific communications. Students will also act as rhetors (users of rhetoric) to craft persuasive arguments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL101C",
            "Name": "Introduction to Literature and Rhetoric",
            "Desc": "This course examines the interrelationships between literature and rhetoric through the study of a range of literary and rhetorical genres and elements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL103B",
            "Name": "Varieties of English",
            "Desc": "Introduction to the study of varieties of the English language - regional, social, temporal, functional, and stylistic. The relations of languages and literature and of speech and writing will be discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL104",
            "Name": "Rhetoric in Popular Culture",
            "Desc": "This course examines the role of persuasion in contemporary society by focusing on one or more topic areas:  film, television, video games, comic books, music, fashion, etc.  Students will explore the topic area(s) in depth using a variety of rhetorical theories and methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108A",
            "Name": "The Superhero",
            "Desc": "An examination of hero figures, ranging broadly from ancient characters such as Gilgamesh to the modern comic book superhero. Literary as well as non-literary materials (e.g., film, comics, games) will be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108B",
            "Name": "Global English Literatures",
            "Desc": "An exploration of texts from a range of geographical locations, such as South Africa, Australia, the Caribbean, India, New Zealand, and Pakistan.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108D",
            "Name": "Digital Lives",
            "Desc": "An examination of how digital communication technologies create and promote online identities and social spaces, as well as interpersonal and communal interactions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108E",
            "Name": "Gender and Representation",
            "Desc": "A study of the ways gender in all its diversity is constructed and gendered experience is expressed in literature, rhetoric, and a variety of media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108F",
            "Name": "The Rebel",
            "Desc": "A study of various works of literature in which the protagonist is a rebel against existing norms. The course will examine a number of rebel types and concepts, moral implications, and final outcomes either in successful realization or in tragic defeat.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108G",
            "Name": "Horror",
            "Desc": "A study of the contemporary horror genre in literature and film. Topics may include the history of horror, the construction of fear, and the development of horror archetypes. Authors and creators may include H.P. Lovecraft, Shirley Jackson, George Romero, and Stephen King.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108P",
            "Name": "Popular Potter",
            "Desc": "This course examines all seven of J.K. Rowling's Harry Potter novels.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL108T",
            "Name": "Tolkien: From Book to Film",
            "Desc": "A study of J.R.R. Tolkien's The Hobbit (1937) and The Lord of the Rings (1954-55), and their film adaptations by Peter Jackson (2001-03, 2012-14).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL108X",
            "Name": "Literature and Medicine",
            "Desc": "How can literature help us understand the body, illness, and healing? The course considers the perspectives of patients and medical practitioners across a range of works, including poetry, fiction, medical texts, and other nonfiction.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL109",
            "Name": "Introduction to Academic Writing",
            "Desc": "The course will explore a variety of issues in academic writing such as style, argument, and the presentation of information. Frequent written exercises will be required.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL119",
            "Name": "Communications in Mathematics and Computer Science",
            "Desc": "This course aims to build students' oral and written communication skills to prepare them for academic and workplace demands. Working independently and in collaboration with others, students will analyze and produce various written and spoken forms of communication. Projects and assignments will draw on materials for Mathematics and Computer Science students.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Honours Mathematics students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL129R",
            "Name": "Written Academic English",
            "Desc": "Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation. ",
            "Notes": "[Note: Not open to fluent writers of English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL132R",
            "Name": "Introduction to Modern Arab and Muslim Drama",
            "Desc": "The course explores contemporary Arab and Muslim drama in English (1940s-present) from multiple perspectives, including literary, social, economic, and political.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL140R",
            "Name": "The Use of English",
            "Desc": "This course examines the use of English in a variety of contexts (colloquial, scientific, legal, political, commercial, journalistic, literary, etc.) to increase critical awareness of the language and help students write more clearly and effectively.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL190",
            "Name": "Shakespeare",
            "Desc": "Designed for students in all faculties, the course examines some of Shakespeare's comedies, history plays, and tragedies. Shakespeare's variety and flexibility in developing characters and dramatic structures are stressed, as are significant themes. ",
            "Notes": "[Note: No previous work in Shakespeare is required.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL191",
            "Name": "Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE)",
            "Desc": "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Architectural, Civil, Environmental, and Geological Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GENE 199 taken fall 2017 or fall 2018",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL192",
            "Name": "Communication in the Engineering Profession (COMPE, ELE, MGTE)",
            "Desc": "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Computer, Electrical, and Management Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GENE 191",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL193",
            "Name": "Communication in the Sciences",
            "Desc": "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences. ",
            "Notes": "[Note: This course requires department consent to enrol and to drop or swap the course. Please consult the Science Undergraduate Office who administer this course.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: BSc students in the Faculty of Science.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SCCOM 100",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL200A",
            "Name": "English Literatures 1",
            "Desc": "An introduction to the diverse forms and voices of literature written in English from the Middle Ages to the late 18th century, focussing on key writers and works, including works by women and people of colour. Students will explore literary techniques, historical and cultural contexts, and the question of the canon.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL200B",
            "Name": "English Literatures 2",
            "Desc": "An introduction to the diverse forms and voices of literature written in English from the late 18th century to the present, focussing on key writers and works from Britain and North America, and including works by women and people of colour. Students will explore literary techniques, historical and cultural contexts, and the question of the canon.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL200C",
            "Name": "English Literatures 3",
            "Desc": "An introduction to literature written by people of colour and Indigenous and Black authors. Using a postcolonial and anti-racist framework, this course examines historical and contemporary issues of race, racism, and colonialism in a variety of literary texts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL201",
            "Name": "The Short Story",
            "Desc": "This course deals with the history and techniques of the short story, with emphasis upon works by such British, American, and Canadian writers as Henry James, James Joyce, D.H. Lawrence, Ernest Hemingway, and Alice Munro.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL202A",
            "Name": "The Bible and Literature 1",
            "Desc": "A study of the major stories, themes, and literary characteristics of the Old Testament of the King James Bible (also known as the Hebrew Scripture), and of its influence on other English literature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL202B",
            "Name": "The Bible and Literature 2",
            "Desc": "A study of the major stories, themes, and literary characteristics of the New Testament of the King James Bible and of its influence on English literature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL203",
            "Name": "Designing Digital Media",
            "Desc": "This course draws on multiple theoretical perspectives to introduce students to the fundamental principles of multi-modal communication design in its social context. Students will analyze, design, and produce digital media for use in a variety of platforms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Honours English students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GBDA 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL204",
            "Name": "Designing Digital Video",
            "Desc": "This course introduces students to the principles of designing time-based multi-modal communication in a social context. Students will analyze, design, and produce video for use in a variety of digital platforms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: GBDA 201, 202",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL205R",
            "Name": "The Canadian Short Story",
            "Desc": "The short story is Canada's most vibrant literary form. Students will examine short stories from the 19th century to the present. Topics to be covered may include national, regional and Indigenous identity, mythology, multiculturalism and cosmopolitanism, as well as explorations of contemporary social justice issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL206",
            "Name": "Writing Lives",
            "Desc": "This course studies the ways the self is constructed through text by examining a variety of life-writing approaches, organized from youth to old age, along with theories of identity, memory, gender, narrative, cultural studies, and autobiography as a genre.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208A",
            "Name": "Forms of Fantasy",
            "Desc": "A study of fantasy literature, including some subgenres such as romances, fairy tales, fables, and gothic and horror fiction.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208B",
            "Name": "Science Fiction",
            "Desc": "Various examples drawn, for instance, from Utopian and anti-Utopian science fiction, social science fiction, \"gadget\" science fiction, parapsychology, and alternate worlds and beings will be considered. Some attention will be given to the historical development of the genre.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208C",
            "Name": "Studies in Children's Literature",
            "Desc": "A critical examination of works of children's literature. Specific readings may range broadly, encompassing works as diverse as ancient folk tales and novels and poetry from the 18th century to the present day.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208E",
            "Name": "Women's Writing",
            "Desc": "This course explores a range of women's writing and the social and cultural contexts in which they made their voices heard.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 208E",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208G",
            "Name": "Gothic Monsters",
            "Desc": "A study of monstrosity, fear, terror, and horror in the gothic mode from its origins to the present, with attention to the ways various genres (from the novel to new media) represent gothic sexualities, genders, politics, and aesthetics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208H",
            "Name": "Arthurian Legend",
            "Desc": "The story of Arthur and his knights of the Round Table will be discussed as it is treated at various times in various works and genres. Such matters will be considered as the character of Arthur, the concept of Camelot, and the Fellowship of the Round Table.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208K",
            "Name": "Detective Fiction",
            "Desc": "A study of the detective novel, the novel of crime, the thriller, the novel of intrigue, and of espionage with texts drawn from various time periods and national literatures. The course includes the examination of critical approaches to the form of detective fiction.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208L",
            "Name": "Race and the Literary Tradition",
            "Desc": "How have ideas of race been represented, transmitted, and resisted in the canon of literature in English over the centuries? Topics may include the invention of race, Eurocentrism and imaginative geography, racial beauty myths, internalized racism, and issues of gender, sexuality, and colonialism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208M",
            "Name": "Travel Literature",
            "Desc": "The course examines the forms and functions of travel literature as a genre. Topics will include the representation of travel as adventure, discovery, pilgrimage, and escape; travel and tourism; travel and gender; travel and colonialism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL208N",
            "Name": "Sex in Literature",
            "Desc": "This course examines how varieties of sexual desire, sexual activity, and cultural attitudes to sex are represented in a selection of literary works from the middle ages to the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL209",
            "Name": "Advanced Academic Writing",
            "Desc": "This course will explore relationships between audience, situation, purpose, and form in academic writing in the disciplines. Students will explore the rhetorical features of knowledge creation across fields of study. They will practice situated inquiry and argumentation through a variety of research-based written exercises, including a significant research project in a field of their choice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210C",
            "Name": "Genres of Creative Writing",
            "Desc": "This course introduces students to both contemporary and historical forms of creative writing. Students will explore genres of poetry, prose, and/or drama through their own writing. Students will also investigate the culture of publishing, learn key revision strategies, and workshop the writing of their peers to develop their critical abilities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210E",
            "Name": "Genres of Technical Communication",
            "Desc": "This course explores writing, presentation, and design across various genres of technical communication, with a primary focus on printed and/or online computer documentation. Other assignments might include white papers, product specifications, help-desk communication, etc.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210F",
            "Name": "Genres of Business Communication",
            "Desc": "This course explores the genres of communication in business and other organizations. Students will study and produce instances from several of the following: reports (of several kinds), letters, email messages, marketing materials, public relations materials, and any other types of organizational communication.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL210G",
            "Name": "Grant Writing",
            "Desc": "The course covers researching, organizing, drafting, and editing proposals and applications for government grants for organizations. Topics may include interviews with domain experts, working with proposal guidelines and checklists, establishing milestones and expectations, using past proposals as models, treating individual sections as separate sub-genres, and creating coherence and flow in the final draft.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210H",
            "Name": "Arts Writing",
            "Desc": "A study of the various forms, processes, and modes of publication of professional writing in the arts. The course will consider both free-lance writing and writing within institutional contexts. Practice in research, writing, and editing will be emphasized.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210I",
            "Name": "Legal Writing",
            "Desc": "A study of the principles, processes, and various forms of writing used in the practice of law and drafting of legislation.  The history and structure of legal writing, including current debates about plain language, will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL210J",
            "Name": "Technical Editing",
            "Desc": "This course will introduce students to practices and tools of technical editing, such as language and format editing, verification and fact-checking, style guide consistency, discourse appropriateness, and the use of profession-specific software.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL211",
            "Name": "First Nations, Metis, and Inuit Literatures",
            "Desc": "This course examines literary works in a variety of genres by First Nations, Metis, and Inuit authors in Canada. Students will study the literature in relation to key concepts that recur in Indigenous literary criticism such as land, teaching, and respect.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL213",
            "Name": "Literature and the Law",
            "Desc": "A study of literary works that involve legal matters and/or have led to litigation on such grounds as obscenity, treason, heresy, libel, and plagiarism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL217",
            "Name": "Canadian Children's Literature",
            "Desc": "A study of 19th- and 20th-century Canadian literature for children.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL225",
            "Name": "Introduction to Anti-Racist Communication",
            "Desc": "This course surveys the rhetorical strategies of both more recent and historical civil rights and anti-racist activists. Students will use Black rhetorical theory and will examine work by international historical figures such as Franz Fanon, Aime Cesaire, Edouard Glissant, Albert Memmi, and Mohandas Gandhi, Frederick Douglas, WEB Dubois, Martin Luther King, Fannie Lou Hamer, Malcolm X, Angela Davis, Stokely Carmichael, Fred Hampton, Robert Hill, and Walter Rodney and such recent figures as Kimberle Crenshaw, Robyn Maynard, Brittney Cooper, Desmond Cole, Feminista Jones, Rinaldo Walcott, and Idil Abdillahi. The objective for students is to understand the evolution of liberatory, anti-racist rhetoric and the rhetorical successes and failures of key anti-racist activists.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, 102, 103; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL230",
            "Name": "The Pleasure of Poetry",
            "Desc": "This course is an introduction to the enjoyment of poetry: what we like about it, what makes it fun, and how we can enjoy it more. Students will have an opportunity to expand their understanding of poetry. A range of poems will be sampled, and students will have opportunities to share poems that they like.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL232",
            "Name": "Graphic Narrative",
            "Desc": "A study of graphic narrative (such as comics, graphic novels, and alternative modes) from the eighteenth century to the present. This course addresses issues such as the history and formal conventions of the medium as well as the unique rhetoric of comics-based storytelling. Topics of interest may include graphic memoir, multimodality, cross-cultural influence, and the comics-as-literature movement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL240R",
            "Name": "Migration, Diaspora, and Exile in Muslim Narratives",
            "Desc": "This course examines Muslim narratives written in the diaspora, such as from North America or the United Kingdom. It investigates the diversity of Islamic culture and expression in diasporic contexts, exploring an array of experiences and issues written from various sociocultural locations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL241R",
            "Name": "Sacred Spaces and Human Geographies in Muslim Literary Expressions",
            "Desc": "Using the Muslim dimension as a central theme, this course explores the social, cultural, and political implications to be found in a range of postcolonial literatures from Africa, South Asia, and the Middle East. Students investigate issues such as identities, nationalism and politics, cultural memory, and sacred space and place.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL242",
            "Name": "Literature, Rhetoric, and the Visual Arts",
            "Desc": "This course will study literature and rhetoric in dialogue with the visual arts, including potential materials such as paintings, photography, illustrations, sculpture, monuments and memorials, installation art, multimedia and digital media. Course material will draw on a variety of literary and rhetorical genres, historical periods, and forms of visual art.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL243",
            "Name": "Literature, Rhetoric, and Music",
            "Desc": "This course explores the cultural, historical, and aesthetic relationships between literature, rhetoric, and music. Course materials may draw on a range of historical periods and themes, as well as a variety of literary, lyrical, and musical genres. Attention will be paid to ways that literary, rhetorical, and musical arts exist in artistic dialogue.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL247",
            "Name": "American Literature and Popular Culture",
            "Desc": "An introduction to American literary and cultural studies through the examination of selected movements, moments, topics, or figures, drawing on both literature and other media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL248",
            "Name": "Literature for an Ailing Planet",
            "Desc": "Can the humanities change how cultures relate to environments and the natural world? This course surveys environmental thought in works of literature and in popular culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL251",
            "Name": "Literary Theory and Criticism",
            "Desc": "What exactly are we doing when we study literature? By examining a selection of critical methods and theoretical approaches, this course will enhance understanding of the many different emphases, values, and priorities critics bring to literature, and the many available perspectives on what constitutes literature's significance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENGL 251A, ENGL 251B",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL260",
            "Name": "Irish Literature",
            "Desc": "A study of modern and contemporary Irish literature in English. This course will introduce students to a range of Irish writing in its often turbulent historical and cultural context. The international dimensions of Irish writers and their work will be explored.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL262",
            "Name": "Manga",
            "Desc": "Manga is graphic narrative from Japan that draws on complex historical contexts, global influences, and stylistic conventions in order to create a unique storytelling medium. By studying manga texts such as Dororo, Akira, and Deathnote, students in this course will be encouraged to think critically about visual narrative, cultural values in a global marketplace, and literature as a concept.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL275",
            "Name": "Fiction and Film",
            "Desc": "A study of the relationships between written and cinematic narrative focusing on adaptations of fiction to film and the different narrative techniques of each medium.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL280",
            "Name": "Literatures of Migration",
            "Desc": "This course explores the literatures and cultures of diasporic and immigrant communities in North America, such as African, Asian, Caribbean, Middle Eastern, and Latin American. Topics to be covered may include memory, race, hybridity, home, and belonging.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL290",
            "Name": "Global Shakespeare",
            "Desc": "An introduction to Shakespeare's continuing influence, focusing on adaptations and appropriations of his works in various media by contemporary writers, artists, and directors around the globe.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL291",
            "Name": "Global Literatures",
            "Desc": "How have cultural exchange, border crossings, and globalization shaped English language and literature? In this course students will discuss literary and cultural productions from around the world and explore themes such as colonialism, transnationalism, and globalization.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL292",
            "Name": "Rhetorical Theory and Criticism",
            "Desc": "This course provides a survey of the multidisciplinary field of rhetorical studies. In addition to introducing key concepts, theoretical frameworks, and critical debates, this course examines the role of rhetoric in a range of academic disciplines and social contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL293",
            "Name": "Introduction to Digital Media Studies",
            "Desc": "A study of theories of digital media, including critical, rhetorical, and semiotic approaches, and of the interpretation and creation of digital media artifacts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL294",
            "Name": "Introduction to Critical Game Studies",
            "Desc": "This course introduces students to the field of humanities-based game studies. Topics may include the debate between ludological (rules-based) and narratological (story-based) approaches, procedural studies, platform and software studies, gamification, games and adaptation studies, and games as rhetorical objects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL295",
            "Name": "Social Media",
            "Desc": "This course surveys the popular social media landscape and charts scholarly approaches, both methodological and theoretical, to understanding and analyzing social media texts. Topics to be addressed may include memes, social networks, fan communities and texts, digital identity, and other emergent social media forms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL303",
            "Name": "Special Topics in Digital Design",
            "Desc": "In this course students will learn advanced digital design theory. They will participate in workshops with professional designers, develop specialized digital materials, and contribute signature work to their digital portfolio. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL304",
            "Name": "Designing Digital Sound",
            "Desc": "In this course students will be introduced to sound production and analysis. Students will learn to record, edit, and implement sound in a variety of genres and formats, with possible areas of investigation including podcasting, documentary, digital games, music, and audio art.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: DAC 301",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL305A",
            "Name": "Old English Language and Literature",
            "Desc": "An introduction to the English language in its earliest form, and study of selected prose and poetry from pre-Conquest England in the original language, with attention to historical, cultural, and religious contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL305B",
            "Name": "The Age of Beowulf",
            "Desc": "A study of the earliest English literature in translation. The heroic epic Beowulf will be studied in depth, along with a selection of Old English poetry and prose, such as lyrics, riddles, and historical and religious writing.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL306A",
            "Name": "Introduction to Linguistics",
            "Desc": "Introduction to linguistics and the principles of linguistic analysis through an examination of English phonology, forms, syntax, and discourse.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL306B",
            "Name": "How English Grammar Works",
            "Desc": "This course analyzes English grammar structures, \"grammar rules,\" and the reasoning behind them. The course then examines English-language change, and considers grammar in pedagogical and multicultural contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL306D",
            "Name": "The History of the English Language",
            "Desc": "This course explores the history of the English language, from Anglo-Saxon dialects (\"Old English\"), through the combining of Anglo-Saxon and Norman French, its evolution in medieval and early modern Britain, up to its transformation within multilingual and multicultural contexts. The course examines not only the evolving vocabulary and grammar of the language, but also its social history.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL306F",
            "Name": "Introduction to Semiotics",
            "Desc": "A study of systems of signs, codes, and signification in language, culture, and literature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL306G",
            "Name": "Critical Discourse Analysis",
            "Desc": "This course provides an introduction to the theory and practice of critical discourse analysis (CDA), the close study of language and its effects in social context. Students will learn to apply discourse-analytical tools to a wide range of texts, conversations, images, and other artifacts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL308",
            "Name": "Race and Resistance",
            "Desc": "An examination of how contemporary literary and cultural texts represent, reconfigure, and resist ideas of race. Analyzing literature, film, art, popular culture, and social movements, this course covers major debates in critical race theory and anti-racist practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL309A",
            "Name": "Rhetoric, Classical to Enlightenment",
            "Desc": "A study of rhetorical theories from antiquity through the Renaissance to the 18th century, with an emphasis on how these theories reflect changing attitudes towards language, society, and the self.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENGL 309B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL309C",
            "Name": "Contemporary Rhetoric",
            "Desc": "An examination of contemporary rhetorical theory and its relationships to criticism, interdisciplinary studies, and digital applications.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL309E",
            "Name": "Speech Writing",
            "Desc": "The analysis, writing, and editing of speeches. This course considers how genre and style impact the creation, reception, and implications of meaning. Students practice writing, as form and style, in the construction of arguments and other genres of speech making.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A English Rhetoric and Professional Writing or English Rhetoric, Media, and Professional Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL309G",
            "Name": "The Discourse of Dissent",
            "Desc": "A study of the social, historical, and rhetorical dimensions of collective action. Topics may include health and welfare movements, civil rights and anti-war protests, and environmentalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL310A",
            "Name": "Middle English Literature",
            "Desc": "A study of English writings during the later Middle Ages. Possible representative works include romances such as Sir Gawain and the Green Knight; alliterative literature, such as The Vision of Piers Plowman; selections from Chaucer; spiritual prose writings; Middle English lyrics and verse.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL310B",
            "Name": "Chaucer",
            "Desc": "A study of Geoffrey Chaucer's writings. Depending on the instructor, this course may focus on a single work such as The Canterbury Tales, or a selection.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL313",
            "Name": "Early Canadian Literatures",
            "Desc": "This course examines a selection of pre-1920 Canadian texts concerning first contact, imperialism, colonization, incipient nationhood, and early multi-racial immigration that participate in the ongoing invention of Canada.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL315",
            "Name": "Modern Canadian Literature",
            "Desc": "This course focuses on the varied ways in which 20th-century writers of poetry and prose participate in the shaping of Canadian literary culture, with emphasis on the literature of the middle decades.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL316",
            "Name": "Canadian Drama",
            "Desc": "This course explores traditions and experiments in Canadian drama through an analysis of Canadian plays, especially those from 1960 to the present, in their historical and theatrical contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL318",
            "Name": "Contemporary Canadian Literature",
            "Desc": "This course examines Canadian Literature written in the latter decades of the 20th century and into the 21st century. Literary works are studied in relation to relevant contemporary social, cultural and political topics, such as nationalism, indigeneity, multiculturalism, and diaspora.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL319",
            "Name": "History and Theory of Writing and Print Media",
            "Desc": "This course explores the social, political, and cultural contexts and consequences of the media technologies of writing and print (including the book) from their beginnings to the 20th century.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL320",
            "Name": "History and Theory of Pre-Internet Media",
            "Desc": "This course explores the social, political, and cultural contexts and consequences of media technologies such as newspapers, photography and film, radio, recorded music, television, and early computing.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL322",
            "Name": "Postcolonial Literature of the Americas",
            "Desc": "This course examines postcolonial literature in English from Canada, the U.S., and the Caribbean. Through study of both written and oral genres, we will discuss how language practices adapt to and are created in colonial and postcolonial contexts.  Topics may include diaspora and migration, nationalism, gender, neo-colonialism, and multiculturalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL324",
            "Name": "Modern and Contemporary American Drama",
            "Desc": "This course explores traditions and experiments in American drama through an analysis of American plays, especially those from the 1940s to the present, in their historical, textual, and theatrical contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL325",
            "Name": "Austen",
            "Desc": "A study of selected novels by Jane Austen, including Pride and Prejudice and Emma. Her letters and juvenilia may also be considered, as well as some of the films based on or inspired by her novels.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL326",
            "Name": "Language, Life, and Literature in the Caribbean",
            "Desc": "This course introduces students to the ways in which language shapes and sustains various forms of cultural expressions in the Caribbean region. Students will use the creative output of storytellers, poets, DJs, and playwrights as a lens to investigate and trace the evolution of a distinctly Caribbean identity from the post-colonial period (1960s) up to the present. Students are also introduced to the social dynamics of Creole language use in the Caribbean and an exploration of the ways in which these languages are implicated in diverse cultural art forms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL327",
            "Name": "Black Diasporic Lives: 1740-1900",
            "Desc": "An introduction to cultural productions of the Black diaspora pre-1900, with an emphasis on political writing, memoir, fiction, and journalism. Students will engage works from a variety of regions, situated in their historical and cultural contexts, even as connections will be drawn to later social movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL328",
            "Name": "Introduction to Black Canadian Writing",
            "Desc": "An analysis of Black writing and cultural achievement in Canada. Theoretical and literary texts will be studied to explore how contributions from this field have helped to shape Canada from the 18th century to the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL330A",
            "Name": "Sixteenth-Century Literature 1",
            "Desc": "A study of short poems by such writers as Wyatt, Gascoigne, Whitney, Ralegh, Spenser, the Sidneys, Shakespeare, and Donne.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL330B",
            "Name": "Sixteenth-Century Literature 2",
            "Desc": "A study of selected genres, topics, and works from Tudor literature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL332",
            "Name": "Topics in Creative Writing",
            "Desc": "This course will focus on a selected genre, approach, creative method, or other aspect of creative writing. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL335",
            "Name": "Creative Writing 1",
            "Desc": "Designed to assist students with an interest in developing their creative writing skills in various genres, this course consists of supervised practice, discussions of craft, and peer critiques.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL336",
            "Name": "Creative Writing 2",
            "Desc": "This course is designed to assist advanced creative writers in developing a body of work in one or more genres by means of supervised practice, discussions of craft, and peer critiques. ",
            "Notes": "[Note: Admission by portfolio review]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A and ENGL 335",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL342",
            "Name": "American Literature to 1860",
            "Desc": "A study of developments in early American Literature. Texts may be drawn from Anglo-European movements such as gothicism and romanticism; captivity narratives and other colonial writings; African American, Native American, and other minority traditions; sentimental and domestic fiction; and American forms such as the frontier romance, and other minority literatures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL343",
            "Name": "American Literature 1860-1910",
            "Desc": "A survey of literary developments in America from the Civil War through the turn of the 20th century, including significant movements of the period such as realism, regionalism, and naturalism; the New Woman's writing and other developments in women's literatures; popular forms such as the Western; and minority literatures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL344",
            "Name": "Modern American Literature",
            "Desc": "A study of American Literature from the early twentieth century through the second world war, emphasizing aesthetic innovation in the modernist movement, and its aftermath in the social writings of the 1930s.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL345",
            "Name": "American Literature in a Global Context",
            "Desc": "A study of the ways in which movements of peoples and cultures have shaped American literature. Topics may include colonialism, immigration and migration, literary influence across borders and languages, nativism and internationalism, racial and ethnic styles and exchanges.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL346",
            "Name": "American Fiction",
            "Desc": "A study of four to five writers.  Topics may include the evolution of narrative style, realism and anti-realism, literature and story, fiction and history, the novel and film, gender and ethnicity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL346R",
            "Name": "Global Asian Diasporas",
            "Desc": "This course explores the literature and culture from one or more global Asian diasporas, with particular emphasis on cultures of East Asian origin. Topics may include identity, transnationalism, imperialism, war, labour, migration, and popular culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL347",
            "Name": "American Literature Since 1945",
            "Desc": "A study of the movements of American Literature following the second world war.  The course will consider the formal and cultural diversity of writing in this period, with attention to topics such as avant-garde experiment, the persistence of realism, counter-cultural politics, feminism and literature, postmodernism, and the emergence of minority writers in the mainstream.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL348",
            "Name": "American Poetry Since 1850",
            "Desc": "A study of poems, poets, ideas, and movements, contributing to the growth of a distinctive American poetry from Whitman and Dickinson to the 21st century.  Texts will be drawn from popular and avant-garde contexts, as well as the literary mainstream.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL350A",
            "Name": "Seventeenth-Century Literature 1",
            "Desc": "A study of literature by such writers as Jonson, Donne, Wroth, Herbert, Bacon, Milton, Behn, and Dryden.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL350B",
            "Name": "Seventeenth-Century Literature 2",
            "Desc": "An intensive study of Milton's epic, Paradise Lost, in its historical and literary contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL361",
            "Name": "Early Modern Worlds on Stage",
            "Desc": "This course explores plays from the English Renaissance in their historical and theatrical contexts. Topics may include playhouses and staging, censorship, and collaboration.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL362",
            "Name": "Shakespeare 1",
            "Desc": "A study of the plays written before 1599-1600, excluding Julius Caesar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: DRAMA 386",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL363",
            "Name": "Shakespeare 2",
            "Desc": "A study of the plays written after 1599-1600, including Julius Caesar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: DRAMA 387",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENGL364",
            "Name": "Shakespeare in Performance at The Stratford Festival",
            "Desc": "A historical, theoretical, and analytical introduction to Shakespeare's plays in performance, both on stage and screen, this course focuses on specific problems and decisive issues of past productions and of those in the current Stratford Festival season. ",
            "Notes": "[Note: This is a block course that meets in Stratford for two weeks in May, and may be taken with ENGL 367, as the two courses are offered at complementary times. The course is offered as part of a consortium with faculty from five universities. Students are required to arrange their own transportation to Stratford.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL365",
            "Name": "Selected Studies",
            "Desc": "Designed to provide an in-depth study of problems and/or authors selected by the instructor. Students interested in initiating such courses are encouraged to do so by bringing their ideas to the attention of individual instructors.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL366",
            "Name": "Selected Studies",
            "Desc": "Designed to provide a study in-depth of problems and/or authors selected by the instructor. Students interested in initiating such courses are encouraged to do so by bringing their ideas to the attention of individual instructors.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL367",
            "Name": "Voice and Text at the Stratford Festival",
            "Desc": "Taught by faculty and Stratford Festival coaches, this practical course invites students to explore acting techniques and exercises to develop their stage voice with a particular focus on Shakespeare's plays. This is a block course that meets in Stratford for two weeks in May, and may be taken with ENGL 364, as the two courses are offered at complementary times. The course is offered as part of a consortium with faculty from five universities. Students are required to arrange their own transportation to Stratford.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 390 taken spring 2019 or spring 2020",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL371",
            "Name": "Editing Literary Works",
            "Desc": "Investigating scholarly, educational,  popular, and electronic editions, this course explores the theory and practice of editing literary texts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL373",
            "Name": "Writing Anti-Racism",
            "Desc": "In this course students will be introduced to counterstory as research method, genre, and organizing rhetoric within anti-racist movements. Students will examine counterstory in the context of Critical Race Theory and read classic counterstories by figures such as Derrick Bell, Patricia Williams, Richard Delgado, Bryan Brayboy, Tomson Highway, and Lee Maracle. Course activities will challenge students to assess and assert the value and truth of the Black lived experience, Black epistemologies, and Black knowledge production, including that of Black Canadians and their Indigenous and Allies of Colour. Students will write, workshop, revise, and publish their own actionable anti-racist commitments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103, BLKST 203; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL375",
            "Name": "Topics in Black Language and Linguistics",
            "Desc": "This course focuses on the formal linguistic, sociolinguistic, and communicative aspects of either a single Black language or a combination of Black languages or language varieties spoken within the contemporary African diaspora, e.g., in Africa, the Caribbean, Canada, or the United States. Attention will be given to the ways in which Black language has developed, how it is deployed by speakers and writers, and attitudes and debates about Black language use in culture, education, and society. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, 102, 103; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL378",
            "Name": "Professional Communications in Statistics and Actuarial Science",
            "Desc": "This course introduces students to oral and written communication in the fields of statistics and actuarial science. With emphasis on the public presentation of technical knowledge, the ability to give and receive constructive feedback, and communication in a collaborative environment, this course helps students develop proficiencies in critical workplace skills. This course is writing intensive and includes extensive collaborative assignments. ",
            "Notes": "[Note: Students are encouraged to complete this course by their 4A term. Offered: F,W,S]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: At least 70% in one of EMLS 101R, 102R, EMLS/ENGL 129R, ENGL 109, COMMST 100, 223; one of STAT 331, 371, ACTSC 331; Actuarial Science or Statistics major students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL392A",
            "Name": "Information Design",
            "Desc": "The theory and practice of design for print and digital media, including the study of design concepts such as space, colour, typography, interactivity, immersion, motion, and presence. Students produce designs using professional software tools.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL392B",
            "Name": "Visual Rhetoric",
            "Desc": "This course introduces students to the study of images from a rhetorical perspective, including the interaction of texts and images in such professional writing fields as advertising, book illustration, technical documentation, journalism, and public relations. Issues may include visual and textual literacy, the semiotics and rhetoric of design, and the ideological basis of social communication.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL403",
            "Name": "Digital Design Research Project",
            "Desc": "Students work in small groups under the supervision of a faculty researcher on an ongoing, large-scale, digital design project. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL405",
            "Name": "African American Rhetoric",
            "Desc": "This course examines the artistic, cultural, political, and disciplinary histories of African American rhetoric, discourse, and persuasion. Students will study various genealogies of African American rhetoric through primary texts such as dialogues, essays, folklore, music, song lyrics, dance, interviews, news stories, raps, videos, and speeches by African Americans. Special attention will be given to the economic, gendered, and social conditions of African Americans from the enslavement period in North America to the present, as well as to the Black diaspora.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BLKST 101, BLKST 102, BLKST 103; Level at least 3A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL406",
            "Name": "Advanced Rhetorical Study",
            "Desc": "Topics may include communication, media, politics, science, and social movements.  Students will explore the topic(s) in depth using a variety of rhetorical theories and methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL407",
            "Name": "Language and Politics",
            "Desc": "This course explores how language shapes and is shaped by the unequal distribution of power in modern societies. The role of language will be considered in, for example, the maintenance of sexual difference, the establishment and maintenance of national identity, and the conflict between social classes. The reading will consist of literary and theoretical texts, the latter including such writers as Bourdieu, Bakhtin, Foucault, Cameron, Lakoff, Ngugi wa Thion'go, and Paulin.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL408A",
            "Name": "Writing for the Media",
            "Desc": "This course examines the genres and strategies of both journalism and public relations. With a strong orientation towards rhetorical and linguistic theories, this course will cover audience concerns from both within and outside organizations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL408B",
            "Name": "The Discourse of Advertising",
            "Desc": "This course introduces students to writing and editing advertising copy. Students will also be introduced to models of discourse and rhetorical analysis of advertising texts. Assignments include creating a portfolio of advertising copy and an extensive analysis of sample advertising discourse.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL408C",
            "Name": "The Rhetoric of Digital Design: Theory and Practice",
            "Desc": "Students apply a variety of analytic perspectives - design discourse, multimodal discourse, rhetorical theory, social semiotics - to the design and production of a major digital project (or compilation of projects) using professional software and hardware tools.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL409A",
            "Name": "Rhetoric of Argumentation",
            "Desc": "This course studies the discursive, social, and rhetorical principles of argumentation, including topics such as evidence, reasoning, and the organization and presentation of arguments. Scholars studied may include Richard Whatley, Jurgen Habermas, Stephen Toulmin, Chaim Perelman, Lucie Olbrecht-Tyteca, Kenneth Burke, and Pierre Bourdieu.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL410",
            "Name": "Eighteenth-Century Women Writers",
            "Desc": "A selection of writing by women such as Behn, Finch, Montagu, Fielding, Edgeworth, and Austen. Topics may include the culture of sensibility, romance and the gothic, and the interaction of women's writing with discourses of race and colonialism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 410F",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL411",
            "Name": "Eighteenth-Century Literature: Sex, Satire, and Sentiment",
            "Desc": "A selection of writing embracing the themes of sex, satire, and sentiment that characterize the Restoration and 18th century. Authors may include Behn, Swift, Finch, Pope, Defoe, and Radcliffe.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL412",
            "Name": "Eighteenth-Century Literature and Media",
            "Desc": "A study of oral, printed, and popular media and literature (such as ballads, fiction, and newspapers) in the Restoration and 18th century. Topics may include the role of women in the rise of print culture, the social role of popular print forms, and the literary reception of new media technologies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL425",
            "Name": "Transnational Feminisms and Contemporary Narratives",
            "Desc": "This course examines the dialogue between transnational feminist theories and literary practices. Drawing on a range of literary and media genres from the late 20th and early 21st centuries, this course considers the historical developments, as well as contemporary contexts (e.g., migration, globalization), that gave rise to the framework of transnational feminism and its negotiations with Anglo-American and European feminist literary theories.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL430A",
            "Name": "Literature of the Romantic Period 1",
            "Desc": "An examination of the first generation of Romantic writers, including such authors as Barbauld, Blake, Wollstonecraft, Wordsworth, and Coleridge.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL430B",
            "Name": "Literature of the Romantic Period 2",
            "Desc": "An examination of the second generation of Romantic writers, including such authors as Byron, P. B. Shelley, Mary Shelley, Keats, and Hemans.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL451A",
            "Name": "Literature of the Victorian Age 1",
            "Desc": "A critical study of early to mid-Victorian literature, including authors such as Carlyle, Arnold, Tennyson, the Brontës, Elizabeth Barrett Browning, Robert Browning, Gaskell, Ruskin, and Dickens. Topics may include liberty, work, gender, class, imperialism, and poetry.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL451B",
            "Name": "Literature of the Victorian Age 2",
            "Desc": "A critical study of mid to late Victorian literature, including authors such as Christina Rossetti, Dante Gabriel Rossetti, George Eliot, Newman, Hopkins, Michael Field, Wilde, and Hardy. Topics may include the \"Woman Question,\" the crisis in religious faith, and aestheticism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL460A",
            "Name": "Early Literature of the Modernist Period in the United Kingdom and Ireland",
            "Desc": "A study of the literatures of the United Kingdom before and after World War I, including such writers as Conrad, Forster, Hopkins, Mansfield, Shaw, Synge, Wilde, and Yeats.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL460B",
            "Name": "Literature of the Modernist Period in the United Kingdom and Ireland",
            "Desc": "A study of the literatures of the United Kingdom and Ireland from World War I to World War II, including such writers as Auden, Eliot, Isherwood, Joyce, Lawrence, Orwell, West, and Woolf.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL460C",
            "Name": "Literature of the Postwar Period in the United Kingdom and Ireland",
            "Desc": "A study of the literatures of the United Kingdom and Ireland after World War II, including such writers as Beckett, Greene, Larkin, Murdoch, Osborne, Pinter, and Spark.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL460D",
            "Name": "Contemporary Literature of the United Kingdom and Ireland",
            "Desc": "A study of the contemporary literatures of the United Kingdom and Ireland, including such writers as Byatt, Boland, Drabble, Heaney, Hughes, Rushdie, and Stoppard.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL463",
            "Name": "Postcolonial Literatures",
            "Desc": "This course examines postcolonial literature (fiction, poetry, and drama) from Africa, Australia, Britain, India, New Zealand, and Pakistan. Topics may include the range of creative forms and language use in texts; indigeneity and migration; intersections of gender, sexuality, and race; and resistance, nationalism, and history.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL470A",
            "Name": "Contemporary Critical Theory",
            "Desc": "Contemporary critical theory offers an array of competing constructions of text and culture. This course examines several topics in recent critical theory, such as gender, race, subjectivity, textuality, and popular culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL470B",
            "Name": "History of Literary Criticism",
            "Desc": "An historical survey of major critical texts and movements from the Greek and Roman classics to the New Criticism of the mid-20th century, examining different critical theories and practices in a context of cultural changes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL470C",
            "Name": "Literary Studies in Digital Forms",
            "Desc": "A critical examination of literary publication, research, and criticism in digital forms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL471",
            "Name": "Adapting Literary Works",
            "Desc": "Focusing on modern and contemporary adaptation of works of literature in English, this course examines the problems, possibilities, and principles of representing such works in other literary forms and in other media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL472",
            "Name": "Research Methods in Technical Communication",
            "Desc": "This course teaches students the practice and theory of research methods in the field of technical and professional communication. Topics may include resource validity and renewal cycles, data-gathering techniques and analytics, interview techniques for subject-matter experts, rapid research skills, and user-experience design.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL481",
            "Name": "Topics in the History and Theory of Language",
            "Desc": "A special study of a selected topic in the history and theory of language. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL484",
            "Name": "Topics in Literatures Medieval to Romantic",
            "Desc": "A special study of a selected topic, author, genre, or period in Medieval to Romantic literatures. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL485",
            "Name": "Topics in Literatures Romantic to Modern",
            "Desc": "A special study of a selected topic, author, genre, or period in Romantic to Modern literatures. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL486",
            "Name": "Topics in Literatures Modern to Contemporary",
            "Desc": "A special study of a selected topic, author, genre, or period in Modern to Contemporary literatures. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL491",
            "Name": "Topics in Literature and Rhetoric",
            "Desc": "A special study of a selected topic in literature and rhetoric. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL492",
            "Name": "Topics in the History and Theory of Rhetoric",
            "Desc": "A special study of a selected topic in the history and theory of rhetoric. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL493",
            "Name": "Topics in Professional Writing and Communication Design",
            "Desc": "A special study of a selected topic in professional writing and communication design. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL494",
            "Name": "Topics in Forms of Media and Critical Analysis",
            "Desc": "A special study of a selected topic in forms of media and critical analysis. Please see course instructor for details. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A English majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL495A",
            "Name": "Supervision of Honours Essay",
            "Desc": "Senior honours essay will be completed under supervision. ",
            "Notes": "[Note: A grade for ENGL 495A will be submitted only after the completion of ENGL 495B.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENGL495B",
            "Name": "Supervision of Honours Essay",
            "Desc": "Senior honours essay will be completed under supervision.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENGL 495A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}