{
    "Name": "environmentalengineering",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ENVE100",
            "Name": "Environmental and Geological Engineering Concepts",
            "Desc": "An introduction to the fundamental methods, principles and skills of environmental and geological engineering. Fundamentals of technical communication, the engineering design process and problem solving. Completion of a pre-design study and report for an environmental engineering project. Independent and team work. Fundamentals of engineering computation units, data collection, measurement, and error analysis. Field surveying (automatic level, engineer's transit, differential global positioning system (GPS), total station). Laboratory on engineering graphics auto-computer assisted diagnosis (AutoCAD) and computational software (Excel, Matlab). Aspects of the engineering profession (code of ethics, negligence, misconduct, role of the Professional Engineers Ontario (PEO), etc.), diversity in the workplace, and professional development. Preparation for the University of Waterloo co-operative education program (Co-operative Education and Career Action (CECA), résumé writing, job search and interview skills). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE115",
            "Name": "Linear Algebra",
            "Desc": "Linear systems of equations, matrices and determinants. Introduction to the eigenvalue problem. Applications. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1A Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 115, 136, 146",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE121",
            "Name": "Computational Methods",
            "Desc": "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations. Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications. The language of instruction will be Matlab. [Offered as: CIVE 121 (W), ENVE 121 (S), GEOE 121 (S)]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CHE 121, ECE 150, MTE 121/GENE 121, SYDE 121",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE123",
            "Name": "Electrical Circuits and Instrumentation",
            "Desc": "Charge, current, and voltage. Voltage and current sources, resistors, capacitors, and inductors. Ohm's Law, Kirchhoff's Laws, nodal analysis, instrumentation amplifier circuits, impedance. Function and characteristics of basic electrical transducers. Resolution, precision, and accuracy. Basics of data acquisition. ",
            "Notes": "[Note: Normally labs are held alternate weeks. Offered: AE 123 (S), CIVE 123 (W), ENVE 123 (S), GEOE 123 (S)]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GENE 123, ME 123",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE153",
            "Name": "Earth Engineering",
            "Desc": "This course studies earth materials and processes from an engineering point of view through case histories and problem sets. The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment. Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind. Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history. [Offered as: CIVE 153 (W), ENVE 153 (S), GEOE 153 (S)]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE223",
            "Name": "Differential Equations and Balance Laws",
            "Desc": "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering. Standard methods of solution of first and second order linear equations with constant coefficients. Numerical methods for solving ordinary differential equations. Partial differential equations. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CIVE 222, MATH 218",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE224",
            "Name": "Probability and Statistics",
            "Desc": "Role of probability in engineering and decision-making under uncertainty. Basic probability concepts. Probability distributions. Functions of random variables. Data analysis. Confidence intervals and hypothesis testing. Introduction to regression analysis. Introduction to design of experiments and statistical quality control. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 116; Level at least 2B Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CHE 220, CIVE 224",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE225",
            "Name": "Environmental Modelling",
            "Desc": "Modelling of environmental engineering processes via the solution of differential equations. Mass transfer processes in continuum and discrete systems, with applications to natural and engineered systems. Reactor theory. Understanding initial and boundary conditions. Classical and numerical solution techniques for solving differential equations. Volume and surface integration. Reynolds transport theorem. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVE 115, 223; 2B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE275",
            "Name": "Environmental Chemistry",
            "Desc": "Overview of risk, biosphere compartments and contaminant fate. Composition of water. Electroneutrality and activity. Reactions and speciation including reaction kinetics, mass transfer, vapor pressure, equilibrium, and chemical thermodynamics. Equilibrium chemistry including Log-concentration diagrams, titration and buffering intensity, dissolution/precipitation, carbonate system, hardness, and complex formation. Classification, nomenclature, physical/chemical parameters and partitioning of organic compounds. Basic redox chemistry including: half cell reactions, Faraday and Nernst equations, and pE-pH diagrams. Four labs. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHE 102; 2A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE277",
            "Name": "Air Quality Engineering",
            "Desc": "Quantitative introduction to indoor and outdoor air pollution sources, and major processes including emission rates, atmospheric dispersion, chemistry, and deposition. Air quality standards and regulations. Basic atmospheric science and meteorology to support the fate and transport of air pollutants. Overview of control and treatment methods. Indoor air exposure estimates and the function of the HVAC components. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Civil, Environmental or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE279",
            "Name": "Energy and the Environment",
            "Desc": "Conservation of energy, energy balances on closed systems. Steady-state and transient heat transfer via convection, radiation, and conduction. Mechanical and electrical work. Internal energy, enthalpy, and specific heats of solids, liquids and gases. Phase change in natural environmental systems; The basics of heat engines, refrigerators, and heat pumps. Function, evaluation, and design of energy resource technology: wind and hydroelectric turbines, photovoltaics, geothermal energy, biomass and biofuel, natural gas and petroleum extraction, and tidal energy. Renewable energy policy and implications. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Civil, Environmental, or Geological Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CHE 330, ECE 309, ME 250, SYDE 381",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE280",
            "Name": "Fluid Mechanics",
            "Desc": "An introduction to fluid mechanics. Fluid properties. Review of fluid statics. Buoyancy. Bernoulli equation. The momentum equation and applications. Laminar and turbulent flow. Dimensionless numbers. Closed conduit flow including friction losses. Pipe network analysis including energy losses and efficiencies. Four lab sessions. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CIVE 105; Level at least 2A Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CIVE 280",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE298",
            "Name": "Seminar",
            "Desc": "General Seminar. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE299",
            "Name": "Seminar",
            "Desc": "General Seminar. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE330",
            "Name": "Lab Analysis and Field Sampling Techniques",
            "Desc": "An introduction to the fundamental concepts of physical and chemical measurement of the environment. Review of basic statistics, quality assurance and control, sources of error, seasonal effects, sample preservation. Practical and essential elements of water, soil and air sampling. Introduction to measurement techniques including: colorimetry, chromatography, spectroscopy, electrochemical probes, remote sensing. Design of monitoring strategies, and use of methods to assess validity of laboratory data. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE335",
            "Name": "Decision Making for Environmental Engineers",
            "Desc": "Decision-making, optimization, and assessment of environmental and water resource systems, and the design process in environmental engineering. Multi-criteria decision-making methods for concept and embodiment engineering design phases. Risk-based system performance metrics and trend tests. Uncertainty estimation via First-Order Uncertainty Analysis and Monte Carlo Simulation. Formulation and solution of linear, integer, and nonlinear optimization models. Multi-objective optimization methods. Sensitivity analysis for decision-making and descriptive (numerical) models. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CIVE 332, MSCI 331",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE375",
            "Name": "Physico-Chemical Processes",
            "Desc": "Fundamentals of coagulation, flocculation, clarification, sedimentation, filtration, adsorption, air stripping, membrane technologies, chemical reduction/oxidation, and disinfection processes with applications to natural and various engineered systems. Quantitative analysis and design of processes and applications to the treatment of drinking water, wastewater, stormwater, groundwater and soils. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHE 102, ENVE 280; 3A Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CIVE 375",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE376",
            "Name": "Biological Processes",
            "Desc": "Common microbial substrates and metabolisms in engineered and natural systems, kinetics of microbial growth, stoichiometry of nutrient uptake, continuous flow stirred tanks with/without recycle, aeration system design, applications to wastewater treatment, solid waste management, groundwater, and soil remediation. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (Level at least 3B Chemical Engineering) or (CIVE 375; Level at least 4A Civil Engineering) or (ENVE 375; Level at least 3B Environmental Engineering)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE382",
            "Name": "Hydrology and Open Channel Flow",
            "Desc": "Introduction to the water cycle, flood frequency analysis, design storms. Analysis of hydrographs and rainfall-runoff response mechanisms in urban and natural systems. Mass continuity and water budgets at the watershed scale. Impact of land use change on hydrologic response. Quantification of open channel flow; subcritical and supercritical flow regimes. Dynamic forces on submerged structures and low/scour beneath bridges. [Offered as: CIVE 382 (W), ENVE 382 (F,W)]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CIVE 105, (ENVE or GEOE 224), (ENVE or GEOE 280); Level at least 2B Environmental or 3B Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE383",
            "Name": "Advanced Hydrology and Hydraulics",
            "Desc": "Physical and mathematical models of hydrological processes at the landscape scale, and hydraulic phenomena in channels. Advanced models of evapotranspiration and snow energy balances. Hydrologic modelling: parameterization, boundary conditions, calibration. Simulation of energy losses, backwater effects, and gradually varying flow profiles in open channels. Sediment transport, scour, and erosion. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CIVE 382 or ENVE 382; Level at least 3B Civil, Environmental, or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE391",
            "Name": "Law and Ethics for Environmental and Geological Engineers",
            "Desc": "Philosophy of environmental controls; introduction to national and international regulatory structures relevant to industrial planning, emissions control, environmental impact assessment, occupational health; stance of government, industry and community pressure groups. Contract law. Professional ethics, including the social responsibility of engineers, conflicts of interest. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE392",
            "Name": "Economics and Life Cycle Cost Analysis",
            "Desc": "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 116; Level at least 3A Environmental Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MSCI 261, SYDE 262",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE398",
            "Name": "Seminar",
            "Desc": "General seminar. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE399",
            "Name": "Seminar",
            "Desc": "General seminar. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE400",
            "Name": "Environmental Engineering Design Project 1",
            "Desc": "Students undertake an independent environmental engineering design project during the last two terms of their plan. The purpose of the project is to demonstrate students' abilities to practise in an environmental engineering capacity in their chosen area of expertise, using knowledge gained from their academic and employment experiences. The first part of the project (ENVE 400) will include problem identification, generation and selection of solutions, and time management. Incorporation of technical, ecological, social, political, and economic issues in the solution for the project will be required. A basic requirement of the proposed solution is that it must be compatible with the principles of sustainability. Requirements include proposal, progress report, and a final report containing recommendations for part two of the project, ENVE 401. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE401",
            "Name": "Environmental Engineering Design Project 2",
            "Desc": "A continuation of ENVE 400. The final design of the major environmental engineering project proposed in ENVE 400 will be undertaken. The purpose of this phase of the project is to carry out a detailed technical design of the solution proposed in ENVE 400. Requirements of this part of the two-term project include a symposium presentation and a final report. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE495",
            "Name": "Design Intensive Special Topics in Environmental Engineering",
            "Desc": "A special topics course on design intensive advanced topics in environmental engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE497",
            "Name": "Special Topics in Environmental Engineering",
            "Desc": "A special topics course on advanced topics in environmental engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE498",
            "Name": "Seminar",
            "Desc": "General seminar. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE499",
            "Name": "Seminar",
            "Desc": "General seminar. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Environmental Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE573",
            "Name": "Contaminant Transport",
            "Desc": "Importance and complications associated with environmental modelling, the model building process, limitations, and measures of success. Types of contaminants; transport phenomena with a focus on advection-dispersive transport; development of governing equations; types and utility of boundary and initial conditions; and mass balance considerations. Review of completely mixed systems including lakes, streams, source functions, feedback systems, and toxic substance models. Model calibration, sensitivity, and uncertainty; methods and approaches. Solute transport models and solution techniques including random walk, method of characteristics, finite difference method and finite volume method. Aspects of multiphase flow (gas/water and NAPL/water systems) with an emphasis on groundwater problems. Introduction to mass removal technologies for remediation of soil and groundwater systems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVE 225, 375; (Level at least 3B Environmental Engineering) or (4B Chemical, Civil, or Geological Engineering)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE577",
            "Name": "Engineering for Solid Waste Management",
            "Desc": "The engineering aspects of solid waste management are examined. Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site. Design of natural attenuation sites and system reliability features for landfill designs. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Chemical, Civil, Environmental or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVE583",
            "Name": "Design of Urban Water Systems",
            "Desc": "Design of water supply and distribution systems. Design of waste and storm water collection systems. Storm water management. The course consists of 24 hours of lectures and a subdivision design project. The emphasis is on computer aided design and sustainability, using commonly used software packages. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVE 382; 4B Environmental or Geological Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}