{
    "Name": "environment",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ENVS105",
            "Name": "Environmental Sustainability and Ethics",
            "Desc": "This course examines and evaluates the reasons why the compatibility of commercial activity, ethics and environmental stewardship has been challenged or defended by stakeholders in government, business and civil society organizations. Concepts and activities by which stakeholders describe and debate this compatibility will be discussed. Different cultural perspectives on the compatibility debate will be considered, compared and evaluated. Case studies will test whether and to what extent compatibility may be defended adequately. Private and non-profit enterprises will be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; not open to Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS131",
            "Name": "Communications for Environmental Professions",
            "Desc": "This course provides an introduction to strategies and tools that enhance the effectiveness and impact of communications for environmental professionals. The course focuses on topics such as effective presentation methods in small or large group settings, digital presentation techniques, media relations, and corporate communications strategies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS178",
            "Name": "Environmental Applications of Data Management and Statistics",
            "Desc": "This course introduces techniques for collecting, evaluating, and using data-based evidence in environmental research, including descriptive statistics (measures of centre, variation and shape, and measures of association between two variables), statistical research designs, sampling theory, and fundamental probability theory for inferential statistics. The course also develops skills in using statistical software for data display and analysis.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS195",
            "Name": "Introduction to Environmental Studies",
            "Desc": "This course introduces the field of environmental studies through an exploration of environmental issues that contribute to crises and challenges at the global, national and local levels. The course provides an overview of human ecological aspects of environmental studies from an inter-cultural and global perspective, and offers an integrative framework for understanding them.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: EARTH 122",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS200",
            "Name": "Field Ecology",
            "Desc": "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities. The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology. ",
            "Notes": "[Note: Field trip fee normally $30+HST; will not exceed $60+HST. WHMIS required.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS201",
            "Name": "Introduction to Canadian Environmental Law",
            "Desc": "Introduction to the basic legal framework that regulates the natural environment in Canada. The course provides students with an understanding of the foundational legal institutions in Canada and their respective roles in environmental regulation. The course includes both public and private law approaches to environmental regulation, and covers the principal regulatory tools used to protect the environment.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS205",
            "Name": "Sustainability: The Future We Want",
            "Desc": "This course introduces students to the goals, principles, and practices of sustainability. Sustainability thinking, policies, and programs aim to increase and maintain human well-being by integrating or reconciling current social and economic goals (e.g., economic growth; poverty alleviation; gender inequality) with long-term environmental objectives (e.g., improved environmental quality; climate stability; biodiversity conservation; and managing resources to ensure future access). Case studies are used to illustrate solutions for realizing sustainability, emphasizing efforts underway for reaching the United Nations Sustainable Development Goals (SDGs). The course assesses four intersecting and sometimes competing approaches for realizing sustainability: technological innovation; market-based approaches; state regulation and investment; and individual and collective ('grassroots') action. Key values underlying sustainability are explored, including notions of the \"good life\", democracy, social justice, and efficiency.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Sustainability and Financial Management students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENVS 274 081 S19",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ENVS210",
            "Name": "Future Studies",
            "Desc": "Different ways of thinking about the future are considered by looking across genres, disciplines, and modes of expression. The course is structured into two parts: the first concentrates on representations of the future ranging from utopian to dystopian visions including their influence on collective perceptions and policy-making; the second centres on methods relied upon to anticipate the future.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENVS 274 (003) winter 2022",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS220",
            "Name": "Ecological Economics",
            "Desc": "Evaluation of various economic approaches to the environment. The links between economics, systems and the natural environment will be explored and future directions examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: SFM 102",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS274",
            "Name": "Special Topics in Environment",
            "Desc": "This special topics course covers material relevant to all students in the Faculty of Environment. Course content is not specific to an individual program and is specified by the instructor at the level indicated by the course number.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS278",
            "Name": "Applied Statistics for Environmental Research",
            "Desc": "This course examines further techniques for collecting, evaluating, and using data-based evidence in environmental research. It builds upon ENVS 178, with a focus on inferential statistics, including sampling distributions, confidence intervals, parametric and nonparametric hypothesis tests, and linear regression models. It further develops skills in using statistical software for data analysis and modeling of environmental data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 178; Environment students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 280, ECON 221, SDS 250R, PSCI 314, PSYCH 292, REC 371,  SOC 280, STAT 202, 206, 211, 221, 231, 241",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS300",
            "Name": "Vascular Plants of Southern Ontario",
            "Desc": "This is an applied course where students will learn to identify vascular plants using botanical keys. Through lab work and field trips, students will understand vascular plant structure and associated terminology as the basis for plant identification. Students will also learn how to collect specimens to create a herbarium collection and how to conduct vegetation community assessments.",
            "Notes": "[Note: Field trip fee normally $60+HST; will not exceed $80+HST]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENVS 474 001 S15; ENVS 474 001 S16; ENVS 474 001 S17",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS310",
            "Name": "Future Cities: Integrating Future Thinking into Urban Decisions",
            "Desc": "Students will draw on ways of thinking about the future including methods for exploring future cities. Students will be challenged to understand the implications of uncertainty and disruption for the achievement of visions focused on smart, just, green, sustainable, and resilient futures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 210",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS350",
            "Name": "Complexity in Nature and Society",
            "Desc": "A survey of core concepts, theory, and research in complexity science as they apply to natural and social systems. Emphasis on the practical utility of these ideas for environmental, economic, and global-security policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS374",
            "Name": "Special Topics in Environment",
            "Desc": "This special topics course covers material relevant to all students in the Faculty of Environment. Course content is not specific to an individual program and is specified by the instructor at the level indicated by the course number.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS395",
            "Name": "Study Abroad",
            "Desc": "Study abroad for academic transfer credit under a Faculty of Environment Exchange Program.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS401",
            "Name": "Canadian Law, Indigenous Peoples, and Natural Resource Development",
            "Desc": "The course examines the historical development of the constitutional relationship between the Crown (the Canadian and provincial governments) and Indigenous Peoples, and the current impact of this constitutional relationship on the development of resources in Canada. Particular focus will be paid to the judicial development of Aboriginal rights and Aboriginal title, the duty to consult and accommodate Indigenous Peoples in the context of resource development, and the future trajectory of the relationship between the Crown, Indigenous Peoples, and resource developers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS410",
            "Name": "Urban Futures Project",
            "Desc": "Methods for future studies are reviewed. Students will then produce a research or design project focused on an urban futures theme.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 210; ENVS 310 or STV 305",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS433",
            "Name": "Ecotourism and Communities",
            "Desc": "This blended course includes a field and online learning experience and focuses on the philosophical, socio-cultural, health, and ecological dimensions of ecotourism, and the skills and practices necessary for planning and managing ecotourism for community development and well-being. The course will involve one or more overnight excursions to ecotourism destinations in Ontario (e.g., Muskoka or Haliburton region). ",
            "Notes": "[Note: Field trip fee: $500.00+HST to $1,500.00+HST]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: REC 230",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS444",
            "Name": "Ecosystem and Resource Management in Parks/Natural Areas",
            "Desc": "From the local to the national level, this course examines the role of protecting and managing terrestrial, aquatic and marine ecosystems. This course also examines the tension between the development of natural resources and conservation by exploring a variety of major themes including biodiversity, ecological integrity and restoration. Normally analytical and field-based activities will be included as well as guest lectures from professionals working in the fields of conservation and protected areas. ",
            "Notes": "[Note: WHMIS may be required pending project lab analysis.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS469",
            "Name": "Landscape Ecology, Restoration and Rehabilitation",
            "Desc": "Survey of the major concepts and theories of landscape ecology. Application of these concepts to case studies in restoration and/or rehabilitation. Interaction with professionals from government, NGOs or private industry on ecological issues will also be part of the course. The course includes a practical component on the planning of ecological restoration or rehabilitation projects. ",
            "Notes": "[Note: Field trip fee based on destination; will not exceed $100+HST. WHMIS may be required pending project lab analysis.]",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 335; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ENVS474",
            "Name": "Special Topics in Environment",
            "Desc": "This course allows for additions to the program on a short-term basis, and for the development of future permanent courses. ",
            "Notes": "[Note: Field trip fee may be required]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}