{
    "Name": "environment,resourcesandsustainability",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "ERS100",
            "Name": "Foundations: Environment, Resources and Sustainability",
            "Desc": "Introduces analytical approaches for problem definition and problem solving that are appropriate for a wide range of environment and resource issues. Considers the limitations of approaches that perceive and attempt to manage issues as isolated phenomena. Also examines alternative approaches that recognize the broader context and underlying roots in ethical positions and ecological, economic, and institutional systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS101",
            "Name": "Approaches: Environment, Resources and Sustainability",
            "Desc": "This course is one of 'solutions-based education' designed to use environmental case studies from local, provincial, national and international communities. We will analyze historical and contemporary cases and consider the interdisciplinary lessons that can be learned from them within the context of climate and technological change, political and economic constraints, community engagement and communication. The specific cases may change year by year depending on current events. Students will be encouraged to critically engage the scholarly, non-governmental, public media literatures and personalities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Environment, Resources and Sustainability students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS102",
            "Name": "Sustainability and the Really Long View",
            "Desc": "Focusing on the relationship between complexity and energy in bio-physical, ecological and social contexts, we review  trends in 'Big History' as it has unfolded from the Big Bang to the Internet. \nThe course explores the implications of this 'deep-time' perspective for our understanding of the great challenge of sustainability.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Environment, Resources and Sustainability students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS200",
            "Name": "Indigenous Sustainability Entrepreneurship",
            "Desc": "An overview and introduction to environmental sustainability is provided through the lens of Indigenous entrepreneurship. Through a series of case studies students will be introduced to Indigenous sustainability entrepreneurs addressing pressing environmental challenges for Indigenous Peoples and communities. Ultimately, students will be charged with identifying an environmental challenge facing an Indigenous community and developing a business innovation that is a cultural match to protect the planet and future generations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ERS 275 001 W23, ERS 275 001 W21",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS201",
            "Name": "Environmental Policy, Politics and Governance",
            "Desc": "This course provides students with an introduction to processes of environmental policy, politics and governance. The roles of various actors, discourses and institutions involved in environmental policy-making and governance will be examined. These processes will be illustrated through an examination of a range of environmental issues from the local to the global level.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Environment, Resources and Sustainability students only;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 210, ERS 275 001 F15",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS202",
            "Name": "Natural Resources Ecology",
            "Desc": "This course explores the ecology and context of Canada's main natural resources including mining, forestry, energy and agriculture. In addition, this course presents alternatives to status-quo approaches including organic agriculture, sustainable forestry and a movement away from traditional energy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Environment, Resources and Sustainability students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 275 001 F16",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS215",
            "Name": "Environmental and Sustainability Assessment 1",
            "Desc": "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects. The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings. The main focus is on the purposes and design of environmental assessment processes, with particular reference to the Canadian federal and Ontario provincial legal mandates, and the evolution of assessment into a sustainability framework.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ERS222",
            "Name": "War and the Environment",
            "Desc": "This course examines environmental security and the political ecology of violence. War, colonialism, and other forms of social conflict are discussed as both drivers and consequences of environmental change including the extraction, consumption, and depletion of resources. Topics may include nuclear war and emerging technologies as existential threats to humanity; (neo) environmental determinism; eco-fascism and totalitarianism; and eco-terrorism. Hopeful insights for transitioning towards sustainability are drawn from rapid societal mobilization and transformation during wartimes and the role of the environment and environmentalism in peacebuilding.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ERS 275 S18, ERS 275 S19",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS225",
            "Name": "Gendering Environmental Politics",
            "Desc": "Social identities such as gender, race, and class shape our interactions with our environment. This course provides the tools to analyze gender and other forms of social difference in the context of environmental and resource issues. This course also examines how governance, policy, and politics can be used to create social and environmental change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 275 001 W16, ERS 275 001 W17",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS234",
            "Name": "Forest Ecosystems",
            "Desc": "This course examines the fundamental concepts of forest ecology and the role of forests in terrestrial ecosystems.  The course will be divided into four sections, and will integrate case studies to introduce the student to current research problems in the study of forest ecology.   Topics include: impacts/dependence of humans on forests;  transfer and cycling of energy and nutrients; biophysical interactions;  and forest management practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS253",
            "Name": "Communities and Sustainability",
            "Desc": "Exploration of the interconnected roles that communities at various scales\ncan play in a transition towards sustainability. Examination of structures, options, initiatives, and decision-making processes involving a wide range of concerns, opportunities, and applications. Illustrative cases include largely urban communities, the urban periphery, and the broader influences that affect them.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS265",
            "Name": "Water: Environmental History and Change",
            "Desc": "This course explores issues of water management from ancient to recent history.  Tensions related to water supply and demand, agriculture and urbanization, health and sanitation, gender and household access to water resources, urban water and wastewater infrastructure, trans-boundary politics, and water privatization debates are considered. Readings and detailed assessments of national and international cases from Europe, Western Asia, and North America are used as a basis for in-class discussion and research projects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS270",
            "Name": "Introduction to Sustainable Agroecosystems",
            "Desc": "This course introduces and discusses the fundamental concepts of agroecology, the integration of agriculture and society, and the transition to sustainability. Topics include the impact of biotic and abiotic factors - including the use of genetically modified organisms - on crops, soil, and the agroecosystems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS275",
            "Name": "Special Readings/Seminar on Select Topics",
            "Desc": "Background reading and study in consultation with faculty. Typically utilized when a student must study a topic in connection with other work, but no course offering in that topic is available.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS283",
            "Name": "Ontario Natural History: Species and Patterns",
            "Desc": "An introduction to natural history, the art and science of identifying organisms, and observing their behaviour and ecological interactions.  The students will reside for approximately nine days in a location in Ontario that has exceptional biodiversity.  They will learn about local species (with an emphasis on insects, plants, and terrestrial vertebrates), human history and conservation initiatives.  Each student must complete a project on an ecological \"pattern\" in consultation with the professor. ",
            "Notes": "[Note: Field trip fee normally $350+HST; will not exceed $440+HST.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: ENVS 200; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS288",
            "Name": "Literature for an Ailing Planet",
            "Desc": "Can the humanities change how cultures relate to environments and the natural world? This course surveys environmental thought in works of literature and in popular culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS294",
            "Name": "The Sacred Earth: Religion and Ecology",
            "Desc": "An examination of the past and present effects of Christianity and other world religions on human treatment of the natural world. Historical background, recent debates, and contemporary approaches to the ethical issues will be investigated. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS300",
            "Name": "Social Ecological Systems Analysis",
            "Desc": "This course provides an opportunity to learn and begin to apply systems-based tools in the context of an interdisciplinary research problem defined by the student in cooperation with the teaching-team. Students are provided with an introduction to the conceptual tools of systems thinking and resilience that help understand the dynamics of social change and social innovation. These conceptual tools will then be applied by students to provide a framework for interdisciplinary research and to develop a richer understanding of a case study of fostering social change and building adaptive capacity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Environment, Resources and Sustainability students only;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 311",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS301",
            "Name": "Sustainability Thought, Practice and Prospects",
            "Desc": "A survey of humans making a living and otherwise interacting with each other and the biophysical environment in a complex world from ancient times to the present. Emphasis on the great agricultural and industrial transitions, reactions to their consequences, the rise of current sustainability concerns, and implications for transitions today in the pursuit of desirable and viable futures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Environment, Resources and Sustainability students only;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 310",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS315",
            "Name": "Environmental and Sustainability Assessment 2",
            "Desc": "Continuing from concepts developed in ERS 215, this course places more emphasis on case studies and projects by students. The course provides a synthesis of ecological, physical, economic, socio-cultural, and institutional concerns, as well as experience in the use of impact assessment methodologies and approaches, as a key element in achieving more informed and responsible decision making.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 215; ENVS 200 or International Development students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS316",
            "Name": "Urban Water and Wastewater Systems: Integrated Planning and Management",
            "Desc": "Focus on urban water management in North America, Australia, Western Asia, and the Global South as illustrative systems or cases. Given changing climate conditions, there is increased likelihood of extreme events (e.g., urban flooding and drought) and new water management challenges. Development and maintenance of urban water and wastewater systems, along with demand and supply management planning, efficiency mechanisms, development and equity concerns, will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS317",
            "Name": "Waste Management",
            "Desc": "This course will deal with the solid waste system, landfilling, incineration, energy from waste, recycling, composting, reduction and reuse. The context will be primarily Ontario and municipal waste management.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS318",
            "Name": "Photography for Sustainability",
            "Desc": "Use digital photography to communicate perspectives on sustainability topics; develop and strengthen creative photography and digital image processing skills. ",
            "Notes": "[Note:  Course fee required, will not exceed $50 + HST; some digital photography experience beneficial; access to a RAW-capable digital camera essential.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 375 001 F16; ERS 375 001 F17",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS320",
            "Name": "Economics and Sustainability",
            "Desc": "This course offers an examination of relationship between the economy, the environment and sustainability. The course aims to provide students with an understanding of the differing viewpoints on the economy-environment relationship and their associated methods, including their strengths, weaknesses and applicability in a policy context.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 464",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS321",
            "Name": "Coastal Social-Ecological Systems",
            "Desc": "This interdisciplinary course integrates science and policy issues to consider coastal systems as dynamic and linked systems of people and nature. Course content and case studies emphasize key challenges and drivers of change in coastal systems, as well as frameworks and approaches to understand and sustainably govern coastal settings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 375 002 F16",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS328",
            "Name": "Environmental Politics and System Change",
            "Desc": "Incremental, transformative and revolutionary system change is seen to derive from a variety of (technological, ecological, institutional, political) drivers. Exploring the history and sociology of environmental politics, the course reviews the drivers of disruptive system change focusing on the role of exogenous shocks, the cumulative impact of environmental science, radical ideas, disruptive  technology, mainstream party politics and institutional adaptation, social innovation and traditional `revolutionary' politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS335",
            "Name": "Restoration Ecology",
            "Desc": "This course will promote class discussion of the theoretical foundations of restoration ecology and their relationship to project implementation, current academic and professional practice, and forecast trends in the discipline. There will be an emphasis on how restoration ecology is changing in the face of small and large scale ecosystem and cultural dynamics. Class will include instruction and experience on how consultants and private or NGO sectors address restoration ecology. The course will emphasize experiential education in the form of a project scoped for time allotted and involve site design, experimental design, project implementation, statistical analysis of data, and professional level writing for academic and practitioner audiences.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ENVS 200, BIOL150, BIOL 251; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 211",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS337",
            "Name": "ReWilding and Ecological Restoration",
            "Desc": "Focus is on restoration and conservation at landscape scale, including an emphasis on connectivity, reintroduction of keystone species, novel ecosystems, re-introduction of apex predators, herbivores, and omnivores. Because ReWilding can be infused with various political agendas and ideologies, technocratic issues, policy ambitions, and governance issues, students can expect to experience a course focused on ecology and technical skills but contextualized and connected to the larger concepts of socioecological change and resilience. There may be opportunities for field experiences.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 375 001 W17, ERS 375 001  W18",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS340",
            "Name": "Ecosystem Assessment",
            "Desc": "An applied ecology course for those interested in becoming professional ecologists. In keeping with the Ecological Society of America's Professional Ecologist Certification and the Society for Ecological Restoration's Certification Programme, intensive, multiple-weeks of field skill exercises are undertaken including advanced ecological sampling and experimental design, ecological sample analysis, use of provincially recommended protocols such as VSP (Vegetative Sampling Protocol), and intermediate to advanced taxonomic identification skills. May include certification and accreditation opportunities such as the Ontario Benthos Biomonitoring Network (OBBN) and the Ontario Stream Assessment Protocol and training in Electrofishing and Boating (for research). Location of the course will be within southern Ontario. ",
            "Notes": "[Note: Field trip fee normally is $700 +HST; it will not exceed $1000+HST. WHMIS required.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS341",
            "Name": "Professional Conservation and Restoration Practice 1",
            "Desc": "An applied ecology course for those interested in becoming professional ecologists. In keeping with the Ecological Society of America's Professional Ecologist Certification and the Society for Ecological Restoration's Certification Programme, an intensive, multiple-weeks field ecology project that students help design and then implement; students learn how to manage and perform ecosystem restoration and conservation projects. Students also will improve practical site inventory and assessment skills for restoration and conservation goals. Projects may involve site constraints, and potential for bioengineering, bioremediation, vegetation installation, and erosion-control measures. Location of the course will be within southern Ontario. ",
            "Notes": "[Note: Field trip fee normally $700+HST; will not exceed $1000+HST. WHMIS required.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS342",
            "Name": "Professional Conservation and  Restoration Practice 2",
            "Desc": "An applied ecology course that is designed for those interested in becoming professional ecologists. In keeping with the Ecological Society of America's Professional Ecologist Certification and the Society for Ecological Restoration's Certification Programme, the core vehicle is a 7-10 day field trip that involves on-site discussions of the successes and challenges of ecological restoration and/or conservation projects with practitioners. Normally, these projects are located in the Carolinian Zone and have some focus on coastal areas of Lake Erie. The course will provide a platform for learning the advanced and professional principles of restoration and conservation ecology and the restoration of ecosystem services.\n",
            "Notes": "[Note: Field trip fee normally $750+HST; will not exceed $1000+HST.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS346",
            "Name": "Wildlife Ecology",
            "Desc": "This course introduces the main concepts and principles of wildlife ecology. Topics  include: population dynamics, animal behavior, habitats, genetics, predation, and habitat use. The lab component will introduce students to wildlife data collection, analysis, and interpretation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 178 or STAT 202; One of ENVS 200, BIOL 150, BIOL 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS361",
            "Name": "Food Systems and Sustainability",
            "Desc": "This course examines dimensions of food systems sustainability and food security, from production to consumption, from local to global scales, in the Global North and South. Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems. [Formerly: GEOG/ERS 461]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ERS 461/GEOG 461/ERS 489/PSCI 489/GEOG 429",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ERS365",
            "Name": "Water Governance",
            "Desc": "Water governance refers to the processes and institutions through which societies make decisions and take actions that affect water. A profound, world-wide shift in the nature of water governance is occurring because governments can no longer be the primary source of decision-making authority regarding water. Instead, through mechanisms that range from markets to co-management arrangements, citizens, non-government organizations, and corporations are now playing key roles in water governance. The course explores major water governance challenges in Canada, and assesses different ways of addressing or resolving them.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 201; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS370",
            "Name": "Corporate Sustainability: Issues and Prospects",
            "Desc": "A course that examines the ways in which sustainability issues and business operations have interacted, considering progressively 'greener' corporate responses and broader sustainability challenges.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B; Not open to Environment and Business students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS372",
            "Name": "First Nations and the  Environment",
            "Desc": "First Nation environmental issues are often complex and require a holistic approach where the lines between different disciplines (e.g. natural, physical, health, and social sciences) are often obscured.  The environment, as described in this course, includes the natural (biological) and built (social, political) settings.  Case studies will be used to illustrate significant issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS373",
            "Name": "Special Topics in Environment, Resources and Sustainability",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in environment, resources and sustainability and may include field courses. ",
            "Notes": "[Note: Field trip fee may be charged.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS374",
            "Name": "Special Topics in Environment, Resources and Sustainability",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in environment, resources and sustainability and may include field courses. ",
            "Notes": "[Note: Field trip fee may be charged.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS375",
            "Name": "Special Readings/Seminar on Select Topics",
            "Desc": "Background reading and study in consultation with faculty. Typically utilized when a student must study a topic in connection with other work, but no course offering that topic is available.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS382",
            "Name": "Ecological Monitoring",
            "Desc": "Through online readings and a 10-day field trip, this course provides students with theoretical and practical knowledge of ecological monitoring through active participation in programs applying protocols developed by the Smithsonian Institute/Man and the Biosphere Program. The course is a collaborative effort with professional staff from selected governmental agencies, and independent organizations. ",
            "Notes": "[Note: Field trip fee normally $750+HST; will not exceed $1000+HST. Offered: After spring examinations, prior to the fall term.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS383",
            "Name": "Tropical Ecosystems",
            "Desc": "This course examines the fundamental concepts of terrestrial ecosystems in tropical climates. The course has three sections: (1) biophysical aspects (climate, location, landforms, soil, vegetation), (2) tropical resource systems (forest- and agroecosystems) within the framework of conventional and sustainable resource extraction, and (3) current conservation issues. Case studies are presented.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS400",
            "Name": "Social-Ecological Approaches to Sustainability",
            "Desc": "This course examines how societies and organizations deal with and respond to social-ecological system complexity, uncertainty and change, and emphasizes tools, strategies and approaches to foster environment and resource sustainability.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A; Environment, Resources and Sustainability students only;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 410",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS401",
            "Name": "Translational Ecology",
            "Desc": "Translational ecology analyses ecosystems in a manner that leads to better policies, decision-making, and action. It is where environmental sciences meet environmental policy and governance. Translational ecology further embraces how the arts, media, and culture can act upon what emerges from analysis of socioecological systems. ERS 401 will focus student efforts on action-based and innovative modules and projects that provide a path to students designing their short- and long-term careers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 400",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS402",
            "Name": "Senior Honours Research Seminar",
            "Desc": "This course focuses upon research on complex problems that are typical when examining how to foster environmental sustainability and sustainable use of resources. The seminar format is designed to allow students to engage in deeper discussions about how to approach and attempt to resolve these complex problems. There will be tutorials to facilitate discussion in smaller groups. Learning opportunities will vary from term to term and may include small projects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A; Environment, Resources and Sustainability students only;",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 413",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS403A",
            "Name": "Senior Honours Thesis",
            "Desc": "This course is for students who have defined a problem, which fits within the scope of research in the School of Environment, Resources and Sustainability, and will undertake original research that leads to production of a thesis. ERS 403A normally leads to the production of a research proposal and the beginning of the research tasks; this process may vary slightly, depending on the nature of the research. The research process and thesis write-up will continue and be concluded in ERS 403B. ",
            "Notes": "[Note: Students who wish to take this course should begin intensive planning and discussion with potential advisors in a field relevant to their intended research 6-12 months prior to the course. Students must secure agreement with a professor in SERS to act as the thesis advisor no later than 4 months prior to the start of the course. WHMIS may be required pending project lab analysis.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 4A Environment, Resources and Sustainability.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 402, ERS 411A",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS403B",
            "Name": "Senior Honours Thesis",
            "Desc": "This course is a continuation of ERS 403A. It normally consists of a continuation of the research process that began in ERS 403A and leads to the completion of the research and the thesis write-up. It is for students who have defined a problem related to the mission and scope of the School of Environment, Resources and Sustainability and will undertake original research that leads to production of a thesis. The procedures outlined in ERS 403A must be followed. ",
            "Notes": "[Note: WHMIS may be required pending project lab analysis.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 4A; Environment, Resources and Sustainability.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ERS 402, ERS 411B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS404",
            "Name": "Global Environmental Governance",
            "Desc": "Examination of the ways in which world society is striving to address environmental challenges by means of \"global governance\" - that is, international organizations and institutions intended to deal with these challenges. The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS406",
            "Name": "Paths to Sustainability",
            "Desc": "Experiential and reflective course examines everyday significance of several 'metaphors we live by' both as citizens and as environmentalists.  Examines links between language, worldview and sustainability by contrasting metaphors used in sustainability discourse, including ecological balance and health, ecosystem services, planetary boundaries, resilience and restoration.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS415",
            "Name": "Environmental and Sustainability Assessment 3",
            "Desc": "Continuing from concepts developed in ERS 215 and ERS 315, this course will focus on the latest concepts and applications of assessment principles and practices. The course focus will vary from year to year following development in the field. Topics may include assessment into land use planning and community design, policy and program assessment, and assessment of new technologies and alternative futures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 315",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS422",
            "Name": "Biosphere Reserves as Social-Ecological Systems",
            "Desc": "A term-long reading course introducing students to social-ecological systems, using the UNESCO Biosphere Reserve in Georgian Bay.  Internationally known as \"experiments in sustainable development,\" biosphere reserves pursue conservation of biodiversity, sustainable resource management, and aim to build social and ecological resilience.  Students will link theories from their readings to guest lectures and excursions that address aquatic ecosystems, sustainable forestry, species at risk management, and indigenous knowledge.  ",
            "Notes": "[Note: Field trip fee normally $400+HST; will not exceed $450+HST.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS431",
            "Name": "Ecological Consequences of Climate Change",
            "Desc": "This course focuses on the ecological consequences of climate change and associated effects on biodiversity. This course examines the challenges a changing climate poses for ecology, conservation biology research and management. The evidence that we will use in this course will be taken from scientific papers, expert knowledge systems and a variety of alternative approaches.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS443",
            "Name": "Ecosystem Field Research",
            "Desc": "This field research course is designed to involve students in high level intensive research on the function and/or structure of ecosystems as they change because of successional and human processes. Students will normally undertake an experimental approach to an ecosystem-based problem and evaluation outcomes of their experiment or long-term data sets. The course will be focused on one ecosystem per offering, e.g. marine, aquatic, terrestrial forest, mountain. It is expected that the course will be off-campus at a field station or protected area within North America but there may be opportunities to deliver it outside of North America. When offered, the syllabus will provide details on exact location. ",
            "Notes": "[Note: Field trip fee normally $2500+HST; will not exceed $3125+HST.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: ENVS 178 or STAT 202; One of ENVS 200, BIOL 150, BIOL 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS446",
            "Name": "Wildlife Management",
            "Desc": "This course introduces the main concepts and principles for the management of wildlife species. This course builds on ERS 346 and explores the application of the principles from that course to the management of wildlife.  The lab component will build on the skills of wildlife data collection, analysis, and interpretation presented in ERS 346.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ERS 346; ENVS 178 or STAT 202; One of ENVS 200, BIOL 150, BIOL 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS454",
            "Name": "Parks and Protected Areas: Issues and Trends",
            "Desc": "Government decisions to conserve rather than develop natural resources are nationally and internationally significant, but are often controversial. This course examines public policy objectives, issues and diverse perspectives related to the conservation of marine and terrestrial environments through the establishment and ongoing management of parks and protected areas. Lectures, seminar discussions and assignments engage students in the exploration of key public policy conservation issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS460",
            "Name": "Sustainable Food: Regional Case Study",
            "Desc": "Agriculture has destabilized the Earth's ecosystems at the planetary scale. Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our global and local food systems. This seminar course takes a regional focus to ground our discussions of pertinent concepts, challenges, and opportunities. We will explore regional issues and initiatives linked to food security, food sovereignty, resilient agriculture and agro-ecology, the energy-water-food nexus, food policy, food supply chains, urban food systems, alternative food initiatives, sustainable diets, and food waste reduction all within the context of the case study region.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG/ERS 361;",
            "Coreqs": "None",
            "Antireqs": " Antireq: GEOG 474 001 F18, ERS 475 001 F18",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS462",
            "Name": "Global Food and Agricultural Politics",
            "Desc": "This course examines the global food and agriculture system. Specific themes to be covered include political and governance issues related to the Green Revolution, global food corporations, agricultural trade liberalization, food aid, international agricultural assistance, the global agro-chemical industry, and agricultural bio-technology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS473",
            "Name": "Special Topics in Environment, Resources and Sustainability",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in environment, resources and sustainability and may include field courses. ",
            "Notes": "[Note: Field trip fee may be charged.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS474",
            "Name": "Special Topics in Environment, Resources and Sustainability",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in environment, resources and sustainability and may include field courses. ",
            "Notes": "[Note: Field trip fee may be charged.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS475",
            "Name": "Special Readings/Seminar on Select Topics",
            "Desc": "Background reading and study in consultation with faculty. Typically utilized when a student must study a topic in connection with other work, but no course offering that topic is available.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ERS484",
            "Name": "Soil Ecosystem Dynamics",
            "Desc": "This course examines the role of soil in the environment, its importance as a natural resource in agricultural and forest productivity, and the effects on soil resources as a result of different management practices. It is divided into three sections: 1) introduction to soil composition, formation, and physical, chemical and biological characteristics of soil; 2) soil degradation and management approaches to rehabilitation; 3) soil pollution and the role of soil in maintaining environmental integrity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}