{
    "Name": "finearts",
    "Notes": "Students should consult the Fine Arts course offerings\r\nlists or the undergraduate co-ordinator, before each term,\r\nto ensure that the courses they select are offered. Budget\r\nrestrictions, enrolment, and availability of faculty may cause some\r\ncourses to be withdrawn.\nStudents should expect material costs to range between $60\r\nand $200 per studio course.\nAll students enrolled in any Fine Arts studio course must have appropriate safety instruction. The University of Waterloo's WHMIS online course satisfies this requirement. WHMIS must be completed by the end of the third week of the first term of enrolment in Fine Arts studio courses or the student's enrolment in the course will be cancelled. For further information about the WHMIS course, see the Safety Office website.\nFor 100-level introductory courses in art history, film, and\r\nmedia, please see VCULT (Visual\r\nCulture) or contact the Undergraduate Studies co-ordinator.\nStudents should be aware that many studio courses include a significant component of mandatory study from the live nude model.",
    "Courses": [
        {
            "courseCode": "FINE100",
            "Name": "Studio Fundamentals",
            "Desc": "This course introduces the basic principles of drawing as it relates to concepts of 2D, 3D, and time-based media, through a series of drawing exercises and projects. ",
            "Notes": "[Note: This course is primarily for students who are considering a Fine Arts studio academic plan. It includes a significant component of mandatory life drawing from the nude model. Please see the Fine Arts academic plans concerning admission to upper-level studio courses.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE101",
            "Name": "Art History and Visual Culture",
            "Desc": "This course takes a case study approach to examining the role of the art object as a means of communication within the history of visual culture. Particular attention will also be paid to the unique properties of a range of diverse media, both traditional and new.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE102",
            "Name": "World Cinema and Visual Culture",
            "Desc": "Introduction to film analysis via national cinemas and their worldwide reception, taking into account the role of new technologies. This course acknowledges not only the importance of multiple languages and cultures on the planet today but also the rapidly growing international contexts, complicated chains of production and distribution, and vastly different cultures of spectatorship. ",
            "Notes": "[Note: All films will be shown with subtitles; no second language expertise is required.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE112",
            "Name": "Modern Art: 1874-1945",
            "Desc": "A study of the culture of Europe and North America from 1874 (Impressionism) to 1945 (Nazi propaganda) with particular focus on the visual arts. Topics such as primitivism, Cubism, abstraction, artists' reactions to calamitous world events such as World War 1, and various methodologies, including semiotic and Marxist analyses, will be explored through reading and writing assignments. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE130",
            "Name": "Introduction to Digital Imaging",
            "Desc": "This online course is an introduction to current imaging software that students use to explore contemporary topics through digital imaging. This course is taught from a fine arts perspective. ",
            "Notes": "[Note: Studio course. Not open to students who have completed FINE/GBDA 228 or FINE/GBDA 229.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "FINE150",
            "Name": "Appreciation and Expression",
            "Desc": "The course delivers an introduction to a variety of basic techniques and concepts relevant to contemporary 2D, 3D, and digital art practices, through a series of structured studio exercises and assignments. ",
            "Notes": "[Note: Studio Course. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE201",
            "Name": "Special Topics in Studio for Non-Fine Arts Majors",
            "Desc": "This course consists of topics in studio practice and is intended for non-Fine Arts majors. The topics can change from term to term. ",
            "Notes": "[Note: Studio Course. This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE202",
            "Name": "Painting",
            "Desc": "Students will explore acrylic paint techniques through a series of lectures, demonstrations, and projects that address pictorial organization and representation as well as abstraction. An emphasis is placed on an introduction to skills development, such as building and preparing substrates for paint application, paint mixing, and colour relationships. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE204",
            "Name": "Topics in Studio Practice",
            "Desc": "This course consists of topics in studio practice. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE205",
            "Name": "Topics in Art History",
            "Desc": "This course consists of topics in art history. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE206",
            "Name": "Topics in Film Studies",
            "Desc": "This course consists of topics in film studies. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE209",
            "Name": "Global Modernisms: 1940-1970",
            "Desc": "This course introduces students to a thematically, materially, and geographically varied set of art practices which developed across the world from 1940-1970 and are referred to, under different monikers, as high modernism, mid-century modernism, and more recently global modernism. These variants of global art production are explored by analyzing theoretical and aesthetic ideas, as well as art movements and styles such as Socialist Realism, Gutai, Postcolonial Modernism, Cannibalist Aesthetic, Brutalism, Abstract Expressionism, Pop Art, Négritude, Indigenous Modernism, and others. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "Prereq: VCULT 101/FINE 101 or Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE210",
            "Name": "Art: 1780-1875",
            "Desc": "A study of art and architecture in European and American culture between 1780 and 1875. Some of the pertinent themes discussed include art and revolutions, art and the Industrial Revolution, the rise of landscape painting, the urban environment, the exotic, and the erotic. Cross-cultural influences and the complex relationship between the traditional and the 'modern' are particularly emphasized. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE212",
            "Name": "Renaissance Art: 1300-1500",
            "Desc": "An examination of the art of the 14th and 15th centuries in Europe. Amongst the many themes that will be explored in this course are mediums (including exploitation of oil paint), scientific perspective, humanism, court structures, art and mercantile sectors, and prominent collectors. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE213",
            "Name": "Art of the 16th Century in Europe",
            "Desc": "Some of the finest works of art in the western world were produced and some of the most successful artists flourished in this tumultuous century that saw the split in the western Christian Church and the continued rise of extraordinarily powerful court families and monarchs. This course will examine these works of art and the artists against this backdrop. Arranged according to patrons, the course also examines particular stylistic trends (Mannerism, the persistence of the Gothic, etc.) as well as other pertinent issues such as collecting, the writing of art history, the teaching of art, and the role of the artist in society. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE214",
            "Name": "Visual Culture of Medieval Europe",
            "Desc": "This course explores the visual culture of medieval Europe from the fourth century to the 13th century. The primary focus of this course is the dynamic intersection of cultures and faiths with particular emphasis on emergent and evolving Christianity, Islam, and Judaism, as expressed in architecture, sculpture, manuscripts, metalwork, textiles, and more. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE215",
            "Name": "Art of the 17th Century in Europe",
            "Desc": "Art of the 17th century. This course focuses on art produced in Italy, Spain, France, England, and the Netherlands in the 17th century. Various types of art (history painting, portraiture, still life, etc.) and architecture (churches, palaces, city homes, etc.) are discussed in relation to the primary political, religious, and societal concerns that characterize the different geographical regions. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE216",
            "Name": "Indigenous Visual Culture in Canada",
            "Desc": "This course will introduce students to issues in contemporary Indigenous visual culture within the Canadian context. Special attention will be paid to the complexities of contemporary art and cultural practices. The course will examine both practice and relevant theoretical paradigms. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE217",
            "Name": "Art of the 18th Century in Europe",
            "Desc": "This course is designed to introduce students to the culture of 18th-century Europe. Particular attention is paid to France and Britain but these countries are discussed within the wider context of Europe and, at times, much of the world. By looking at the art, artists, patrons, and collectors, some of the issues that will be discussed include cosmopolitanism, nationalism, empire-building, \"taste\", consumerism, and women in society. ",
            "Notes": "[Note: Art History course. Formerly FINE 331]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: FINE 331",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE220",
            "Name": "Oil Painting",
            "Desc": "Various technical methodologies of oil painting and pictorial composition are developed in this course through a series of explorations in observation and abstraction. The plurality of approaches available to painters today is set within a contemporary critical context. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE221",
            "Name": "Acrylic and Mixed Media",
            "Desc": "Through this course students will take a materially specific approach to painting through research and experimentation with acrylic paints, paint mediums, and supports. Students will engage with the concepts and techniques of contemporary painting through a series of exercises, lectures, and demonstrations. Projects and assignments will emphasize creative problem solving through an interdisciplinary approach to painting. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE222",
            "Name": "Principles of Sculpture",
            "Desc": "This studio course is designed to introduce students to a variety of traditional and contemporary approaches, materials, processes, and conceptual concerns related to working in sculpture. Through demonstrations, presentations, critiques, and discussions, students gain expertise and develop a sculptural vocabulary. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE223",
            "Name": "Methods and Materials of Sculpture",
            "Desc": "This studio course emphasizes practical applications of traditional and contemporary materials, processes, and conceptual concerns. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE224",
            "Name": "Expressive Drawing",
            "Desc": "Expressive drawing techniques are emphasized through study with the life model. Conceptual drawing projects provide the student with the opportunity to produce bodies of work. ",
            "Notes": "[Note: Studio course. This course includes a significant component of mandatory life drawing from the nude model.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE225",
            "Name": "Observational Drawing",
            "Desc": "Observational techniques are used to develop an understanding of the principles and concepts of drawing practice. ",
            "Notes": "[Note: Studio course. This course includes a significant component of mandatory life drawing from the nude model.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE226",
            "Name": "Experimental Drawing",
            "Desc": "Experimental drawing is a course for those who wish to challenge their ideas about drawing and image making. An emphasis will be placed on contemporary approaches to drawing and the development of individual forms of expression. ",
            "Notes": "[Note: Studio course. This course includes a significant component of mandatory life drawing from the nude model.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE227",
            "Name": "Photography",
            "Desc": "In this introductory course students will engage with the concepts and techniques of contemporary photographic practices covering a range of studio, documentary, experimental, and street photography. The focus is on still imaging, allowing students to explore digital and analogue processes through a series of exercises, lectures, and demonstrations. ",
            "Notes": "[Note: Studio course. Students may need to have access to a fully manual 35mm film camera and/or digital camera, depending on instructor.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE228",
            "Name": "Design and Imaging",
            "Desc": "In this course students will explore the fundamentals of design through a series of exercises and assignments that cultivate artistic expression and technical skill. Through an exploration of both analogue and digital processes, students will learn to apply the principles of aesthetic design to a variety of contexts, including two-dimensional space, three-dimensional form, and digital frameworks. ",
            "Notes": "[Note: Studio course. Previous experience with digital imaging software is useful.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100 or 130; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone.",
            "Coreqs": "None",
            "Antireqs": " Antireq: DAC 201; GBDA 101; FINE 228/GBDA 228 taken prior to fall 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE230",
            "Name": "Printmaking",
            "Desc": "Students are introduced to a variety of printmaking processes. Techniques explored include etching, engraving, monoprinting, collograph, and lithography. Training in traditional skills is combined with opportunities for individual expression. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE231",
            "Name": "Mixed Multiples",
            "Desc": "The course examines the field of traditional printmaking which has expanded to include new and emerging photo-based technologies and ideas that focus on the concept of the multiple. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE232",
            "Name": "Video and Sound",
            "Desc": "This course explores time-based media within a contemporary art context focusing on video and sound. Students learn how to record and edit material through a series of short self-directed projects. Approaches range from stop-motion animation, live-action, and performance to sound and installation. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE241",
            "Name": "Survey of Greek Art and Architecture",
            "Desc": "A survey of Greek art and architecture from the earliest times to the coming of the Romans. Material studied may include the art of the Bronze Age, the development of Greek sculpture, the evolution of the Acropolis at Athens, and the change in art and architecture after Alexander the Great.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE242",
            "Name": "Survey of Roman Art and Architecture",
            "Desc": "A survey of Roman art and architecture from the earliest times to the age of Constantine the Great. Material studied may include the art of the Etruscans, the evolution of Roman portraiture, innovations in architectural materials and forms, the use of art and architecture by the Emperors, and the change to Late Antique art.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE243",
            "Name": "Topics in Fine Arts Experiential Learning",
            "Desc": "This course enables Fine Arts students to gain valuable work experience within an art-related environment. Collaboration between students, professional artists, and art institutions creates a unique learning experience that complements the student's program of study. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis. A minor field trip fee may apply. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A Fine Arts students; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE244",
            "Name": "History of Visual Media to 1910",
            "Desc": "This course provides a chronological and thematic overview of the history of visual media examining technologies such as the printing press, photography, early cinema, and the representation of perspective.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE245",
            "Name": "History of Film and Visual Media from 1900 to Today",
            "Desc": "The course provides a chronological and thematic overview of the history of visual media in Modernity and Postmodernity. It starts at the beginning of the 20th century with the rise of cinema and ends with discussion of the digital age.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE246",
            "Name": "Expanded Media: Site and Intervention",
            "Desc": "In this course students will use an interdisciplinary approach to explore expanded media practices such as performance art, relational art, social practice, land-based art, and site-specific intervention. Content may centre on diverse approaches through issues of Indigeneity, gender, sexuality, race, and/or diasporias, depending on the instructor. Students will be encouraged to engage in experimental and experiential approaches to produce artworks for both inside and outside of the studio and gallery setting. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE247",
            "Name": "Expanded Media: Interaction",
            "Desc": "In this course students will learn to create interactive artworks using a variety of hardware and software. Following an interdisciplinary approach, students will explore topics such as kinetic sculpture, wearable technologies, and responsive environments. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE252",
            "Name": "Religion in Popular Film",
            "Desc": "This course examines how religion has been a central concern and inspiration for filmmakers and how popular films have informed and shaped our understanding of religion. ",
            "Notes": "[Note: Film Studies course. This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 270R",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "FINE253",
            "Name": "Special Topics in Religion and Film",
            "Desc": "This course focuses on a specific genre or theme to explore the complex\nrelationship between cinema and religion. ",
            "Notes": "[Note: Film Studies course. This\ncourse fulfils an Area 3 requirement for Religious Studies majors. This\ncourse is repeatable up to five times, subject to different content. RS 271\nwas formerly RS 271R.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 271R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE256",
            "Name": "Experimental Film",
            "Desc": "The course introduces students to the history, methodologies, theories, and aesthetics of non-narrative experimental film with a focus on intersections between film and visual and performing arts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE257",
            "Name": "Video, New Media and the Digital Turn",
            "Desc": "This course analyzes the shift in visual practices of the 20th century transformed by the arrival of various digital technologies. An emphasis is placed on the increasing interdisciplinarity of new media, as well as their multi-sensory nature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE258",
            "Name": "Aspects of the Cinemas of the Americas",
            "Desc": "This course takes a historical and thematic approach to analyzing the history, context, and various practices of cinema in the Americas.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE259",
            "Name": "Aspects of European Cinema",
            "Desc": "This course offers a wide-ranging set of approaches to historical, contextual, and practical topics in the history of European cinema production.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE262",
            "Name": "Global Queer Cinema",
            "Desc": "This course introduces the varied production of world-wide gay, lesbian, bisexual, and transgender cinema. Inquiry will focus on how queer cinematic production serves as a vehicle for documentation and education, aesthetic and sexual experimentation, as well as cultural export and self-inquiry.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 262",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE271",
            "Name": "Ceramics: Studies in Material Practice",
            "Desc": "Students will explore ceramic material practice as a method for creative expression. The course will focus on visual and conceptual problem solving, while acquiring technical skills and knowledge of ceramic material. The assignments will incorporate hand building, mold making, surface treatments, and glazing techniques. ",
            "Notes": "[Note: Studio course]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE272",
            "Name": "Clay Studies",
            "Desc": "Students will explore the creative development of clay and examine cultural, historical, and personal modes of expression using a variety of construction techniques. Students will explore figurative and abstract sculptural concepts to develop a working knowledge of clay as a sculptural medium. The emphasis is on design, form, and visual thinking. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 100; Fine Arts Health and Safety Milestone; Fine Arts Woodshop Workshop Milestone",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE275",
            "Name": "Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts",
            "Desc": "Exploring the history of Islamic and East Asian calligraphic arts and the study of Eastern and Western artists, this course examines multiple ways in which writing and other forms of visible language are incorporated into visual arts. Through studio projects, students explore conceptual approaches to text-based image making.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: FINE 204 (STU 001) taken winter 2014 or SI 375R (LEC 001) taken winter 2014",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE281",
            "Name": "Art and Gender",
            "Desc": "A study of selected themes dealing with gender in the history of art: e.g., the representation of the human body; portrayal of mythological, spiritual, and allegorical figures; professional and amateur artists and their status within societies; etc. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE282",
            "Name": "Canadian Art from the 17th Century to 1940",
            "Desc": "This course examines art in Canada from the beginning of the European settlement in the 17th century to the Group of Seven and the Canadian Group of Painters. Some of the issues that will be investigated include the perception of Canada from abroad, the \"new world\", nation and nationhood, and the invention and appropriation of culture. ",
            "Notes": "[Note: Art History course]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE293",
            "Name": "Fine Arts Abroad",
            "Desc": "This is a topics course that provides students with an introduction to and a familiarity with the art and culture of a particular destination. Working in the field with landscape, cityscape, and monuments of art, students will employ a variety of media to develop techniques for visual reportage, documentation, note-taking, and journal-keeping. Individual aesthetic responses to a wide range of subject matter will be encouraged. ",
            "Notes": "[Note: Information about current offerings can be obtained from the department. This is a repeatable course, subject to different content; it may be completed a total of two times. A field trip fee will apply.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE302",
            "Name": "Analysis and Research",
            "Desc": "This course hones critical analysis skills and develops research practices (by exploring artists, materials, techniques, readings, etc.) that will enhance the student's knowledge of contemporary art practice, as well as equiping students to articulate their area of interest within contemporary art. Gallery visits and artists' talks are components of this course. ",
            "Notes": "[Note: A field trip fee of $100 may be required.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 209; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE304",
            "Name": "Topics in Studio Practice",
            "Desc": "This special topics course addresses a variety of themes and practices in studio art which can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 209; At least 2.0 units of FINE 200-level studio courses; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE305",
            "Name": "Topics in Art History",
            "Desc": "This course consists of topics in art history. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE306",
            "Name": "Topics in Film Studies",
            "Desc": "This course consists of topics in film studies. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE309",
            "Name": "Advanced Topics in Two-Dimensional Media",
            "Desc": "This course will broaden the scope of students' ideas and techniques in two-dimensional media (including, but not limited to printmaking, drawing, collage, photography, painting). Through experimentation and individual research, students will be encouraged to take a personal approach to developing thematically connected independent works. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 209; At least 2.0 units of FINE 200-level studio courses; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE312",
            "Name": "Advanced Topics in Three-Dimensional Media",
            "Desc": "This advanced course exposes students to the expansive field of three-dimensional artistic expression. Students can choose to work in the areas including, but not limited to ceramics, sculpture, installation, site specific work, and kinetic sculpture. Through thematically driven prompts, individual research, and experimentation students will develop an independent body of works. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 209; At least 2.0 units of FINE 200-level studio courses; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE315",
            "Name": "Advanced Topics in Expanded Media",
            "Desc": "The course will expand students' engagement with interdisciplinarity across media, techniques, and practices. Working in response to thematic assignments provided by the instructor, students will create artworks in the area(s) of their choosing, including, but not limited to performance, time-based media, media art, and others. Designed to expand artistic vocabulary, the course encourages independent, experimental, and ambitious approaches to art making. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 209; At least 2.0 units of FINE 200-level studio courses; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE319",
            "Name": "Contemporary Art",
            "Desc": "A survey of contemporary international art movements with emphasis on work since 1970. Readings in contemporary criticism and gallery visits are an integral part of the course. ",
            "Notes": "[Note: Art History course.]",
            "Consent": "None",
            "Prereqs": "Prereq: VCULT 101/FINE 101; FINE 209",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE327",
            "Name": "Open Studio",
            "Desc": "This advanced studio course is designed to support students as they pursue self-directed studio-led research. Building on previous experience in studio practice, and under the guidance of the instructor, students will be encouraged to develop independent approaches to studio practice, and to present their work through individual and group critiques. ",
            "Notes": "[Note: Studio course.]",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 209; At least 2.0 units of FINE 200-level studio courses; Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE330",
            "Name": "Topics Course in Museums, Galleries, Curatorship",
            "Desc": "Often taught by the University of Waterloo Curator, this course explores a range of topics dealing with museums, galleries, and curatorial practices. Field visits may be a required component of this course. ",
            "Notes": "[Note: A field trip fee of up to $100 may be required. This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE332",
            "Name": "History of Art Academies",
            "Desc": "This course examines the history of the institutionalization of the teaching of art.  The course is organized as a series of case studies dealing with various formal academies of art and less formal gatherings of artists from the Renaissance to the 20th century. The aims of the course are to analyze why these institutions were formed, how they were organized, what were their mandates, and what was their status in their contemporary worlds. Some of the themes that will be investigated throughout the course include: art in the service of power and politics, the status of the artist, the ideal human form, the classical and medieval traditions, the impact of the avant-garde, the conflict with authority, and the academy as community. ",
            "Notes": "[Note: Art History course]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Fine Arts or History",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE338",
            "Name": "Philosophy of Art",
            "Desc": "What is art? What is beauty? What do the two have to do with each other? This course introduces students to some fundamental issues in the philosophy of art, and to a variety of philosophical views on these issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE341",
            "Name": "Advanced Studies in Greek Art and Architecture",
            "Desc": "An advanced survey of the art and architecture from a selected time period of Greek history. Material studied may include the art and architecture of the Aegean Bronze Age, and the Archaic, Classical, and Hellenistic periods. Archaeological, historical, and cultural issues specific to each time period will be discussed through the important media of the day. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 241/FINE 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE342",
            "Name": "Advanced Studies in Roman Art and Architecture",
            "Desc": "An advanced survey of the art and architecture from a selected time period of Roman History. Material studied may include the art and architecture of the Etruscans, the Roman Republic, and the Roman Empire. Archaeological, historical, and cultural issues specific to each time period will be discussed through the important media of the day. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: CLAS 241/FINE 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE343",
            "Name": "Topics in Fine Arts Experiential Learning",
            "Desc": "This course enables Fine Arts students to gain valuable work experience within an art-related environment. Collaboration between students, professional artists, and art institutions creates a unique learning experience that complements the student's program of study. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis. A minor field trip fee may apply. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE344",
            "Name": "Fine Arts Internship",
            "Desc": "This experiential learning course is intended to enable Fine Arts students to gain valuable work experience within an art related environment. The course is designed to complement the student's academic program by providing an opportunity for the practical application of skills and concepts. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis. A minor field trip fee may apply.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 343; Fine Arts majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE359",
            "Name": "Topics in German Film",
            "Desc": "Selected topics in German film. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE362",
            "Name": "German Film Classics",
            "Desc": "Masterpieces of German film from the silent era to present. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE363",
            "Name": "German Filmmakers in Hollywood",
            "Desc": "An examination of the work of filmmakers who have made a mark in both European and American cinema. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE364",
            "Name": "German and Russian Film Pioneers",
            "Desc": "An examination of early German and Russian cinema, and the way these two film industries influenced each other. Influential theories of film from the period will also be studied. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE368",
            "Name": "International Comics and Animation Film",
            "Desc": "This course will examine the interconnections of comics (graphic novels, manga, etc.) and animated film, forms of visual communication particular to the 20th and 21st centuries, in the historical and social contexts of various national traditions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE377",
            "Name": "Religion in Science Fiction Films and Television",
            "Desc": "This course examines how religion, religious themes, and the religious imagination are explored in and through science fiction film and television. Topics include the use of science fiction to discuss questions of transcendence, humanity, and divinity, as well as the challenge of extraterrestrial and artificial lifeforms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE383",
            "Name": "Computational Digital Art Studio",
            "Desc": "An upper-level studio course to create computational projects that function as art works and aesthetic experiences. Students will work in an interdisciplinary environment to combine computer science principles with fine art technical and conceptual skills.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CS 105, CS 106; One of FINE 228, FINE 229, FINE 247; FINE 257 or VCULT 200; One of CS 100, CS 200, CS 230; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE392",
            "Name": "Technology Art Studio",
            "Desc": "This unique upper-level course is focused on interdisciplinary collaboration. Students work in teams to create aesthetically and technically engaging works of art that bridge the worlds of fine art and engineering. Students learn about conceptual development and critical analysis, prototyping, iterative design, and interactivity.  The course provides the opportunity for students to share knowledge and develop skills outside of their discipline. Through lectures and presentations students are exposed to a history of art that uses different forms of technology and interactivity.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE393",
            "Name": "Fine Arts Abroad",
            "Desc": "This is a topics course that provides students with an introduction to and a familiarity with the arts and culture of a particular destination. Working in the field with landscape, cityscape, and monuments of art, students will employ a variety of media to develop techniques for visual reportage, documentation, note-taking, and journal-keeping. Individual aesthetic responses to a wide range of subject matter will be encouraged. ",
            "Notes": "[Note: Information about current offerings can be obtained from the department. This is a repeatable course, subject to different content; it may be completed a total of two times. A significant field trip fee will\napply.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE402",
            "Name": "Directed Study",
            "Desc": "This course is intended to help Fine Arts students make the transition from art school to professional practice by providing an opportunity to examine their own practice within the larger context of the professional art world. ",
            "Notes": "[Note: A field trip fee of $100 may be required.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE404",
            "Name": "Topics in Studio Practice",
            "Desc": "The subject and content for this course will vary, depending on the instructor. These special topics studio courses can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times. Studio course.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 319, FINE 327; 1.0 unit of FINE 300-level studio courses; Level at least 4A Honours Fine Arts Studio Practice",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE405",
            "Name": "Topics in Art History",
            "Desc": "This course consists of topics in art history. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE406",
            "Name": "Topics in Film Studies",
            "Desc": "This course consists of topics in film studies. The topics can change from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Fine Arts students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE407",
            "Name": "Honours Concept and Research",
            "Desc": "This seminar course explores aspects of art theory, history, and visual culture that will assist students in situating their work within contemporary art practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: FINE 319; Level at least 4A Honours Fine Arts Studio Practice",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE472",
            "Name": "Fine Arts Honours Thesis 1",
            "Desc": "This thesis course involves an intensive exploration and development of individual studio research through practice and experimentation, resulting in the production of a significant body of work. Students will be guided by the work of relevant artists and theorists. In addition to embedded professional practice, an important part of the culminating year is critiques by other faculty members, graduate students, visiting artists, and fellow students. ",
            "Notes": "[Note: Studio course]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 319, FINE 327; 1.0 unit of FINE 300-level studio courses; Level at least 4A Honours Fine Arts Studio Practice",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE473",
            "Name": "Fine Arts Honours Thesis 2",
            "Desc": "This thesis course will continue to guide students in the development of their individual studio research as they work towards completion of a significant body of work supported and complemented by appropriate documentation. In addition to embedded professional practice, an important part of the culminating year is critiques by other faculty members, graduate students, visiting artists, and fellow students. ",
            "Notes": "[Note: Studio course]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 319, FINE 327; 1.0 unit of FINE 300-level studio courses; Level at least 4A Honours Fine Arts Studio Practice",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE474",
            "Name": "Honours Studio Practicum 1",
            "Desc": "This course provides Fine Arts students with an opportunity to study a range of topics that will explore, expand, and refine personal areas of interest in studio practice. Students will be required to undertake a range of classroom assignments in addition to working independently on an area of focus. Submitted studio work will be evaluated by a committee of Fine Arts faculty.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Fine Arts Studio Practice",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "FINE475",
            "Name": "Honours Studio Practicum 2",
            "Desc": "Students will research and execute a series of self-directed projects, addressing historical precedents in the context of the concerns of contemporary art practice, and supported and complemented by appropriate documentation. Submitted studio work will be evaluated by a committee of Fine Arts faculty. ",
            "Notes": "[Note: Studio course]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: FINE 474",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}