{
    "Name": "german",
    "Notes": "Courses in German are offered through the Department of Germanic and Slavic Studies.\nA number of German language courses can be taken concurrently, for example\nGER 201 and GER 211 together; GER 202 and GER 211 together; GER 331 together with any of GER 303,\nGER 304, GER 307, GER 308.\nGER and CI courses count towards the Cultural Identities (CI) Minor; for further information, please ask\nthe Germanic\nand Slavic Studies undergraduate advisor.\nStudents with advanced German-language skills interested in\ntaking literary or cultural studies courses, but who do not have the\nnecessary prerequisite courses, should contact the undergraduate\nofficer for departmental approval to take these courses.",
    "Courses": [
        {
            "courseCode": "GER100",
            "Name": "Zeitgeist and Popular Culture",
            "Desc": "An introduction to life, society, and culture in modern Germany, Austria, and Switzerland. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER101",
            "Name": "Elementary German 1",
            "Desc": "This course aims to bring German language, culture, and everyday life into the classroom. Students with little or no prior knowledge are introduced to the structure of German and develop their listening/comprehension, speaking, reading, and writing skills. Classes are communicative and emphasize interaction in German. Online exercises and audio/video materials accompany each chapter of the textbook. ",
            "Notes": "[Note: GER 101 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: 4U German",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER102",
            "Name": "Elementary German 2",
            "Desc": "A continuation of GER 101. ",
            "Notes": "[Note: GER 102 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "Prereq: GER 101.",
            "Coreqs": "None",
            "Antireqs": " Antireq: 4U German",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER120",
            "Name": "Once Upon a Fairy Tale: Fairy Tales, Then and Now",
            "Desc": "This course studies fairy tales in the broader context of the history of childhood and practices of education and socialization. The course will focus on fairy tales of German and Russian origins and consider their interpretations and reinterpretations in different historical periods. This may include figures from the Brothers Grimm and Alexander Afanasyev, such as Snow White, Sleeping Beauty, Red Riding Hood, and the Firebird. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER130",
            "Name": "Norse Mythology",
            "Desc": "This course introduces students to the medieval myths and legends of the Norse peoples using original sources. It explores Norse mythology in the context of historical and archaeological evidence and reflects on the purposes served by contemporary adaptations such as the television series \"Vikings: Valhalla\" or the \"Thor\" movies, which are ubiquitous in popular culture, but bear little resemblance to the myths they purport to represent. Through close reading/viewing, writing, and discussions, the course builds historical, cross-cultural, and literary competencies. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER180",
            "Name": "German and Russian Literary Masterpieces",
            "Desc": "An examination of major Russian and German literary works that have influenced world literature. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER200",
            "Name": "Transcultural Studies",
            "Desc": "This course provides an introduction to transcultural views of literature, film, language, and literature and media culture (e.g., fairy tales and their adaptation in other cultures, authors who work in multiple languages, transcultural comics, multilingual and transcultural films, local cultures' interaction with global arts and media scenes, etc.). ",
            "Notes": "[Note: Lectures and readings in English. No knowledge of German required.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER201",
            "Name": "Intermediate German 1",
            "Desc": "This course continues the work of GER 101/102. It offers practice in speaking, reading, and writing, with vocabulary building, grammar, and exercises in comprehension. ",
            "Notes": "[Note: GER 201 and GER 211 can be taken concurrently. GER 201 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "Prereq: GER 102 or 4U German",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER202",
            "Name": "Intermediate German 2",
            "Desc": "Strengthening of communicative skills, grammar review, vocabulary building, written practice, and conversation on issues of contemporary life in German-speaking countries. ",
            "Notes": "[Note: GER 202 and GER 211 can be taken concurrently. GER 202 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "Prereq: GER 201",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER211",
            "Name": "Contemporary German Language and Culture",
            "Desc": "This course develops reading, writing, and oral skills, and intercultural competence. ",
            "Notes": "[Note: Students may take GER 201 and 211 concurrently.]",
            "Consent": "None",
            "Prereqs": "Prereq: GER 102 or 4U German",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER230",
            "Name": "Vikings!",
            "Desc": "This course will examine the Viking Age cultures, which flourished in Northern Europe and beyond from c. 800 to 1100 CE. The goal of this course is to familiarize students with the Viking Age and to deepen students' understanding of the processes through which peoples in the present give meaning to the past. ",
            "Notes": "[Note: Taught in English; no knowledge of other languages required.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: GER 298 taken fall 2015",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER250",
            "Name": "Performance German 1",
            "Desc": "This course improves students' oral and written skills via creative performances in our everyday life. Students will be actively involved in marketing products, conducting job interviews, writing résumés, improvising theatre skits, hosting poetry slams, or even instructing yoga - all in German.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GER 101 or 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: 4U German",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER261",
            "Name": "Understanding Conversation",
            "Desc": "This course examines the connection between conversation and cultural identities. Looking at conversation means looking at language structures and language choice but also at gesture, gaze, laughter, and emojis. We will analyze everyday conversation as well as interaction in digital contexts, with the goal of discovering how linguistic and multimodal choices convey and construct who we are. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER262",
            "Name": "Multilingualism",
            "Desc": "This course examines the concept of multilingualism in society from a social, cultural, and linguistic perspective. It covers topics such as multilingualism in the media, endangered languages, language and identities, language maintenance and loss, language planning and politics, and multilingual education. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER271",
            "Name": "German Thought and Culture: Objects",
            "Desc": "An exploration of human-made objects that open up perspectives on German-speaking society and culture. Objects to be studied might include the Berlin Wall, the swastika, Luther's Bible, donairs, and Volkswagens. Students acquire skills in cultural analysis and learn about major developments in literature, philosophy, religion, art, architecture, and music. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER272",
            "Name": "German Thought and Culture: People",
            "Desc": "An exploration of key figures whose contributions to the arts and intellectual life have shaped German-speaking society and culture. Persons to be studied might include Friedrich Nietzsche, Sigmund Freud, Leni Riefenstahl, and Hannah Arendt. Students acquire skills in cultural analysis and learn about major developments in literature, philosophy, religion, art, architecture, and music. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER283",
            "Name": "The Holocaust and Film",
            "Desc": "An examination of the Holocaust as portrayed in feature films and documentaries. Do cinematic attempts capture the horror of the Holocaust faithfully, or trivialize it? The background to anti-semitism, use of religious imagery in propaganda films, and what counts as success or failure in cinematic representations are discussed. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER286",
            "Name": "Great German Thinkers",
            "Desc": "An introduction to and examination of the thought of one important figure (such as Leibniz, Kant, Nietzsche, or Heidegger) or school (such as Idealism, Romanticism, or phenomenology) of German philosophy. The choice of the philosopher(s) studied varies from term to term. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER298",
            "Name": "Topics in Cultural Studies",
            "Desc": "Selected topics in cultural studies. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER299",
            "Name": "German Abroad",
            "Desc": "This immersion course provides students with an introduction to and a familiarity with selected topics in German-speaking environments. The topics range from history and culture, to language and linguistic varieties in the German-speaking world, as well as arts and the German-speaking media landscape. Course offerings include classes abroad as well as field trips. ",
            "Notes": "[Note: Information about current offerings can be obtained from the department. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER301",
            "Name": "Language, Culture, and Identity",
            "Desc": "This course provides an introductory overview of fundamental concepts of language, culture, and identity and relates them to foreign/second language learning and teaching. The course is not language-specific but rather addresses general questions related to learning and using more than one language. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER303",
            "Name": "Interactive German Language and Culture",
            "Desc": "This course develops German language skills and cultural awareness. Discussions include such topics as Heimat, nation, migration, and study abroad. Students will engage with and reflect on different social and cultural perspectives through interviews, videos, and texts. Online interactions, including with people in and from Germany, form an integral part of the course. ",
            "Notes": "[Note: Offered through University of Guelph in alternating years, but always available to both University of Waterloo and University of Guelph students.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of GER 201, 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER304",
            "Name": "Reading and Translating",
            "Desc": "Students learn strategies for understanding a variety of texts such as newspaper reports, manuals, and fiction. Translation exercises are used to improve language skills.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GER 202 or GER 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER307",
            "Name": "German for Professional Purposes",
            "Desc": "This language course teaches students the skills needed to function in German business and professional environments. Praxis-oriented language and intercultural training are combined with a discussion of the German business world.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GER 202 or GER 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER308",
            "Name": "German Through Comics",
            "Desc": "German-language comic strips and graphic novels enable students to explore modern language use. Colloquial German language skills are sharpened in this course, and the place of the comic strip and graphic novel in society is discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GER 202 or GER 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER330",
            "Name": "Infamous Lovers",
            "Desc": "Enduring and contemporary works of German culture and literature guide our exploration of transgressive, requited, passionate, sexual love across the centuries, its historical and social locatedness, and the concepts of art and knowledge each work develops that orient the loving self in the world. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER331",
            "Name": "Exploring German Language and Literature",
            "Desc": "An introduction to German studies through close engagement with one specific topic. This course prepares students for advanced undergraduate courses in German studies by developing historical, theoretical, and methodological knowledge as well as the language skills necessary for reading literature and analyzing language. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of GER 211, GER 299, GER 303, GER 304, GER 307, GER 308, GER 350, GER 399",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER350",
            "Name": "Performance German 2",
            "Desc": "This course improves students' more advanced oral and written skills via creative performances in our everyday life. Students will be actively involved in marketing products, conducting job interviews, writing résumés, improvising theatre skits, hosting poetry slams, or even\ninstructing yoga - all in German.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GER 201 or 4U German",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER359",
            "Name": "Topics in German Film",
            "Desc": "Selected topics in German film. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER362",
            "Name": "German Film Classics",
            "Desc": "Masterpieces of German film from the silent era to present. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER363",
            "Name": "German Filmmakers in Hollywood",
            "Desc": "An examination of the work of filmmakers who have made a mark in both European and American cinema. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER364",
            "Name": "German and Russian Film Pioneers",
            "Desc": "An examination of early German and Russian cinema, and the way these two film industries influenced each other. Influential theories of film from the period will also be studied. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER383",
            "Name": "Culture in the Third Reich: Racism, Resistance, Legacy",
            "Desc": "An examination of German culture during the Nazi period (1933-1945). The course will analyze representations of Nazi ideology in the arts (film, art, architecture, and propaganda), the literature of exile and \"inner emigration,\" and the impact of the Nazi legacy on post-war German culture. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GER385",
            "Name": "Culture Behind the Iron Curtain",
            "Desc": "An examination of the culture of the Soviet Union, the German Democratic Republic, and other states that experimented with socialism in the 20th century. Representations of Marxist-Leninist and Stalinist ideologies in literature, cinema, and the arts; the role of the state in directing cultural expression; and resistance to totalitarian control of culture are examined. Western representations of the Cold War are also studied. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER395",
            "Name": "Waterloo in Germany Program",
            "Desc": "Study abroad at a German university in the fall term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER396",
            "Name": "Waterloo in Germany Program",
            "Desc": "Study abroad at a German university in the winter term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER397",
            "Name": "Waterloo in Germany Program",
            "Desc": "Study abroad at a German university in the spring term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER398",
            "Name": "Topics in Cultural Studies",
            "Desc": "Selected topics in cultural studies. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER399",
            "Name": "German Abroad",
            "Desc": "This immersion course provides students with an introduction to and a familiarity with selected topics in German-speaking environments. The topics range from history and culture, to language and linguistic varieties in the German-speaking world, as well as arts and the German-speaking media landscape. Course offerings include classes abroad as well as field trips. ",
            "Notes": "[Note: Information about current offerings can be obtained from the department. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER407",
            "Name": "Experiential Learning and Transcultural Skills Development",
            "Desc": "This course offers an immersive experience in a professional setting in a German-speaking country, company, or community partner. Through extensive written reflection on work tasks, experiences and their cultural environment, students develop German language skills; transcultural skills; and their ability to identify the skills developed in and out of the classroom. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis. Due to the costs involved with working in a foreign country, paid positions are eligible for credit in the course.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER431",
            "Name": "Senior Seminar",
            "Desc": "Topics in German literary and cultural studies and linguistics chosen by the instructor in consultation with the department. These courses reflect research interests of the faculty and form part of a well-rounded undergraduate education in \"Germanistik\". ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: GER 331",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER490",
            "Name": "Senior Honours Project",
            "Desc": "German Honours students in their third or fourth year may complete, with departmental permission, a major project, the results of which must be presented in a substantial essay. The topic should reflect the student's field of interest.  ",
            "Notes": "[Note: Requests for permission should be submitted to the undergraduate officer, in consultation with the intended faculty advisor, and should include an outline of the project and a bibliography. The project will be assessed and graded by two faculty members.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GER495",
            "Name": "Reading Course in Approved Topics",
            "Desc": "Reading course in topics chosen in consultation with an advisor. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}