{
    "Name": "genderandsocialjustice",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "GSJ101",
            "Name": "Introduction to Gender and Social Justice: the Global North",
            "Desc": "This course surveys contemporary issues and theories relating to the intersection of gender with race, ethnicity, sexual identity, (dis)ability, class, religion, and other axes of oppression in the Global North. What injustices are attendant upon membership in these groups? How are these injustices produced? How can we combat them? What are the possibilities of alliance and solidarities across differences of gender, race, etc.?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ102",
            "Name": "Introduction to Gender and Social Justice: The Global South",
            "Desc": "This course examines the dynamics of gender and its intersection with race, ethnicity, sexual identity, (dis)ability, class, religion, and other axes of oppression in the Global South. Special emphasis will be given to women in developing world contexts and to the effects of globalization on members of oppressed and marginalized groups.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 102",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ108",
            "Name": "Gender and Representation",
            "Desc": "A study of the ways gender in all its diversity is constructed and gendered experience is expressed in literature, rhetoric, and a variety of media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 108E",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ201",
            "Name": "Gender and Social Justice in Popular Culture",
            "Desc": "From film, television and the internet to fashion magazines, computer games and music videos, popular culture is a ubiquitous part of people's lives. This course examines popular representations of gender, race, ethnicity, sexual identity, (dis)ability, class, religion, and other axes of oppression. How does popular culture reinforce norms and stereotypes that disadvantage people in virtue of their gender or other identity? How can popular culture help to address such disadvantages? At the end of the day, is popular culture a force for justice or for injustice (or both)?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 201",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ203",
            "Name": "The Waves of Feminist Thought",
            "Desc": "This course surveys the history of feminist theory and activism from the 19th century to the present through the familiar metaphors of first-, second- and third-wave feminism. Upon which principles or methods do the waves agree? Disagree? Is the wave metaphor helpful or harmful? What wave, if any, are we in today?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ205",
            "Name": "Technology, Gender, and Social Justice",
            "Desc": "This course explores the interaction of gender and other axes of oppression with technology. From condoms to the internet, from vacuum cleaners to space shuttles, we will examine the ways in which the design, engineering, production, and consumption of various technologies differentially affect people based on their demographic features. We will survey feminist and other technology scholars to consider the ways in which technology can both oppress and liberate.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 205",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ206",
            "Name": "Women and the Law",
            "Desc": "This course provides an introduction to feminist legal thought with a particular focus on Canadian cases, legislation, law reform, and legal literature. Included is an analysis of the ways in which law contributes to women's legal, social, political, and economic status as well as the manner in which the law is used as a mechanism of social change for women. The intersection of gender with age, race, ethnicity, religion, and class will be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 206",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ207",
            "Name": "Entrepreneurship, Gender, and Social Justice",
            "Desc": "This course examines how race, ethnicity, sexual identity, (dis)ability, class, religion, and other axes of oppression influence the way people have engaged in labour and entrepreneurial activities from the 19th century to the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 207",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ208E",
            "Name": "Women's Writing",
            "Desc": "This course explores a range of women's writing and the social and cultural contexts in which they made their voices heard.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 208E",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ208L",
            "Name": "Race and the Literary Tradition",
            "Desc": "How have ideas of race been represented, transmitted, and resisted in the canon of literature in English over the centuries? Topics may include the invention of race, Eurocentrism and imaginative geography, racial beauty myths, internalized racism, and issues of gender, sexuality, and colonialism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ211",
            "Name": "First Nations, Metis, and Inuit Literatures",
            "Desc": "This course examines literary works in a variety of genres by First Nations, Metis, and Inuit authors in Canada. Students will study the literature in relation to key concepts that recur in Indigenous literary criticism such as land, teaching, and respect.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ221",
            "Name": "Language and Society",
            "Desc": "This course introduces students to the study of language and culture. Topics covered include language socialization, narrative, the politics of multilingualism, and hate speech.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ARTS 290 (LEC 001) taken fall 2014, ANTH 400 (SEM 001) taken fall 2016",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ222",
            "Name": "Gender Issues",
            "Desc": "Philosophical analysis of issues relating to sex/gender. Questions considered might include the following: What, if anything, is the difference between sex and gender? How much of a role do facts about biology play in our ideas about sex and gender? How many sexes are there? What ethical issues arise for us in virtue of our gender?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 222",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "GSJ232",
            "Name": "Anthropologies of the Body",
            "Desc": "Drawing upon diverse anthropological perspectives, this course takes a holistic biocultural approach to exploring what human bodies are, what they are used for, by whom, for what purposes, and how we come to know such things.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ260",
            "Name": "Social Determinants of Health",
            "Desc": "Enormous inequalities in health persist both within and between countries. These inequalities can be seen across various axes including gender, ethnicity, and access to material resources. As such, those relatively deprived/underprivileged have substantially poorer health than those better off. The course will demonstrate the extent of inequalities in health, and it will explore current theories explaining how inequalities arise, focusing on behavioural/cultural, psychosocial, and structural/material explanations. The course will also investigate the role of various approaches to economic and social policy in creating or reducing inequalities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ261",
            "Name": "Gender and the Great Religions",
            "Desc": "Through a review of the teachings of the great religious traditions about gender, this course aims to arrive at a global view of the situation of beliefs and practices related to gender \"in the world of religion\". It will examine the role of religion as an important influence on gender and human development. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 261",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ262",
            "Name": "Global Queer Cinema",
            "Desc": "This course introduces the varied production of world-wide gay, lesbian, bisexual, and transgender cinema. Inquiry will focus on how queer cinematic production serves as a vehicle for documentation and education, aesthetic and sexual experimentation, as well as cultural export and self-inquiry.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 262",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ271",
            "Name": "Special Topics in Gender and Social Justice",
            "Desc": "Special topics as announced by the department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ301",
            "Name": "Engaged Buddhism",
            "Desc": "This course examines Buddhist - including mindfulness - engagement with contemporary social issues, such as peacemaking, environmentalism, political reform, race and gender concerns, and LGBTTTQQIPA+ rights.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ302",
            "Name": "Thinking Through Gender: Feminist Perspectives",
            "Desc": "This course presents students with an opportunity to engage with a range of feminist theories and approaches to better understand gender in relation to the body, identity, law, sexuality, space, the State, and/or subjectivity. Queer and transgender theories and issues will also be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 302",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ304",
            "Name": "Research as Resistance",
            "Desc": "This course considers the potential for research as a form of feminist and social justice praxis. The first half of the course is comprised of a basic introduction to qualitative and quantitative research methods in the humanities and social sciences. In the second half of the course, students will be introduced to a range of feminist and other challenges to the research methods \"status quo,\" and will explore radical research methods that straddle the line with social justice activism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ306",
            "Name": "Gender and Health",
            "Desc": "This course draws on a range of feminist theories and frameworks to examine the interconnections between gender and health in local, national, and international contexts. Topics may include the medicalization of gendered bodies; reproductive experiences, choices, technologies and rights; health care systems and institutions; health policy; and the links with leisure, recreation, and health. Intersections of gender with race, ethnicity, sexual identity, (dis)ability, class, religion, aging, and other axes of oppression will also be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 306",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ307",
            "Name": "Race and Resistance",
            "Desc": "An examination of how contemporary literary and cultural texts represent, reconfigure, and resist ideas of race. Analyzing literature, film, art, popular culture, and social movements, this course covers major debates in critical race theory and anti-racist practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ309",
            "Name": "The Discourse of Dissent",
            "Desc": "A study of the social, historical, and rhetorical dimensions of collective action. Topics may include health and welfare movements, civil rights and anti-war protests, and environmentalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ315",
            "Name": "Islam, Women, and the Modern World",
            "Desc": "This course examines the lives and contributions of Muslim women in history - past and present - and political, social, and cultural influences that have affected the lives of Muslim women around the world. Challenging stereotypes of Muslim women and using religious, historical, and literary images, the course focuses on contributions of Muslim women as religious leaders, scholars, and politicians.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ320",
            "Name": "Sex and the World Religions",
            "Desc": "This course examines deeply rooted attitudes in the major world religions toward sexual identity, practices, and gender. Examining sacred scriptures and codes of conduct from the world religions, as well as fictional writings and films, this course enables students to explore various social and religious traditions. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 320",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ326",
            "Name": "Sexuality and the Law",
            "Desc": "Despite the commonly held belief that sexuality is nothing more than \"doing what comes naturally,\" cultural definitions, including prohibitions against specific forms of conduct, impinge upon the most private or intimate of acts. This course examines the social construction and control of sexuality through law.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ327",
            "Name": "The Body, Dress, and Religion",
            "Desc": "From clothing to hairstyles to tattoos, dress can express beliefs, aspects of identity, and power. This course examines dress in a variety of religions from ancient Greece to the modern era. The course includes attention to the look and feel of dress on the body, conflicts that can arise over dress and religion, as well as the role of dress in the formation and maintenance of religious communities. ",
            "Notes": "[Note: The course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ331",
            "Name": "Gender in War & Peace",
            "Desc": "An examination of various themes in the history of peace and war using gender as a central category of analysis. Theoretical literature and international case studies will be used to explore how the discourse and enactment of war and peace are influenced by societal constructions of gender, both historically and in the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 331",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ334",
            "Name": "Women and Music",
            "Desc": "An examination of women's roles in music from a cross-cultural perspective. Topics may include women's music as a genre, historical accounts of women's music-making, and the effects of gender ideology on women's musical activities, behaviour, and performance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 334",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ347",
            "Name": "Witches, Wives, and Whores",
            "Desc": "This course explores the ways in which Early Modern European women experienced, participated in, shaped, and responded to the world they inhabited. It investigates the ways in which women negotiated the Early Modern world as it unfolded in the Renaissance, the Reformation, European encounters around the world, and the challenges of everyday life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 347",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ350",
            "Name": "Anthropology of Gender",
            "Desc": "This course examines anthropological perspectives on variations in gender roles and systems through the comparison of ethnographies. Topics include the relationship of gender to social organization, sexuality, economic and political processes, belief systems, and social movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ371",
            "Name": "Special Topics in Gender and Social Justice",
            "Desc": "Special topics, as announced by the department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times. Formerly WS 365.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of GSJ 101, 102, WS 101, 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ380",
            "Name": "Applied Public Health Ethics",
            "Desc": "This course explores ethical issues in health sciences, emphasizing population and public health. The course begins by considering canonical ethical theories and frameworks for applying these theories to population health. Specific topics in population health, including the conflict between public health and individual autonomy, the just distribution of health resources, and responsibility for health outcomes will then be discussed. The overall objective of the course is to provide students with tools to discuss and assess ethical arguments and to form their own views on issues within population health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 280/GSJ 280",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ401",
            "Name": "Global Health",
            "Desc": "We are becoming a global community; increasingly, health concerns are international in nature and impact. The student will build upon core content concerning population and public health theories, international health care systems, and cultural sensitivity to address emerging global health concerns on the perspective of public and population health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101, 102, or GSJ/HLTH 260; and Level at least 4A GSJ major or Minor",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ402",
            "Name": "Studies in Feminist Philosophy/Philosophy of Sex",
            "Desc": "Special topics in feminist philosophy, women philosophers and/or the philosophy of sex, as announced by the Department of Philosophy. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times. Formerly WS 422/PHIL 402.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Gender and Social Justice students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ408",
            "Name": "Gender and Leisure",
            "Desc": "This seminar course focuses on recent theoretical and empirical research on the relationships between gender and leisure. Topics will include analysis of men's and women's leisure experiences, attitudes, constraints, challenges, and behaviours. Gendered aspects of leisure will be explored in a variety of social and cultural contexts, including families, informal and social settings, organized leisure, and the media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A GSJ major or minor.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 308",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ410",
            "Name": "Eighteenth-Century Women Writers",
            "Desc": "A selection of writing by women such as Behn, Finch, Montagu, Fielding, Edgeworth, and Austen. Topics may include the culture of sensibility, romance and the gothic, and the interaction of women's writing with discourses of race and colonialism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Gender and Social Justice students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 410F",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ430",
            "Name": "Unruly Women in Early Modern Hispanic Culture",
            "Desc": "This course will examine works by and about women in early modern Hispanic culture (16th and 17th centuries), with  particular attention to engagements with and subversions of patriarchal culture in theatre, prose, and poetry. Authors to be discussed  may include, among others, Santa Teresa de Avila, Sor Juana Ines de la Cruz, Maria de Zayas, and Ana Caro. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 430",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ463",
            "Name": "Postcolonial Literatures",
            "Desc": "This course examines postcolonial literature (fiction, poetry, and drama) from Africa, Australia, Britain, India, New Zealand, and Pakistan. Topics may include the range of creative forms and language use in texts; indigeneity and migration; intersections of gender, sexuality, and race; and resistance, nationalism, and history.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Gender and Social Justice students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ472",
            "Name": "Special Topics in Intersectional Feminist Theory",
            "Desc": "Advanced study in special topics that emphasize theory, as announced by the department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Gender and Social Justice students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "GSJ473",
            "Name": "Special Topics in Feminist and Social Justice Praxis",
            "Desc": "Advanced study in special topics that emphasize practice, as announced by the department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Gender and Social Justice students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}