{
    "Name": "healthhumanities",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "HHUM101",
            "Name": "Foundations of Health Humanities",
            "Desc": "Students will learn how diverse humanities disciplines (literature, history, philosophy, and others) contribute to a rich and well-rounded understanding of human health. Through a study of selected moments, concepts, and texts, students will engage with significant representations of health, illness, medicine, and the body from different eras and cultures. Students will have the opportunity to exercise self-awareness and sensitivity to the experience of others and to form skills in text-centred analysis, critical reflection, and careful argumentation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM218",
            "Name": "Sexual Health and Well-being in Comics",
            "Desc": "This course will present a concentrated history of the major trends and patterns within the representation of human sexuality and sexual health in 20th- and 21st-century comics art. Students will be introduced to the unique and powerful role that comics have played in representing sexuality and sexual well-being through exposure to various artists and scholars on the subject. Students will explore key concepts through close readings of relevant texts, and through the application of key theoretical materials, modeling the kind of analytical work that students will then produce themselves in both discussion and written assignments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: SMF 200 taken spring 2020",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM221",
            "Name": "Monstrous Hunger",
            "Desc": "In this course students will explore the role eating plays in emotional and physical well-being. Through close reading of literary texts and other textual objects, students will build an understanding of eating as a biological necessity that requires the confrontation of one's relationships with others, the environment, and one's own body and health. Furthermore, in gaining an ability to use the concepts of eating/food studies, students will not only consider how eating is an encounter with one's bodily vulnerabilities and dependencies but also ask how acts of and attitudes towards eating can become monstrous.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM222",
            "Name": "Health, Illness, and Narrative",
            "Desc": "What stories do we tell ourselves about our bodies, relationships, and lives as we try - individually and as a culture - to be \"healthy\"? And how do stories help us cope with the uncertain, often scary, and sometimes tragic scenarios when illness replaces health? In this course students will pursue these questions by exploring the role narrative plays in our broader perceptions of health and illness. Through discussion and writing, students will analyze a range of media and genres to gain insight into the larger cultural discourses and social institutions that shape our understanding of these topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM241",
            "Name": "Caregiving, Illness, and Relationships",
            "Desc": "In the typical health care model most of the attention is focused on the patient and their well-being, often ignoring the health, financial, and emotional impact on those who provide unpaid informal care and support - family and friends. Through the reading of memoirs, students with an interest in aging, health care, and the therapeutic professions will grapple with the profound impact that caregiving during illness has on carers and relationships across the spectrum - from young carers, to intimate partners, to adult children caring for aging parents, and beyond. Discussions will be grounded in the social, legal, and policy contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM263",
            "Name": "Contagion, Disease, and Illness in Italian Literature and Film",
            "Desc": "This course will focus on representations of contagion and illness in Italian literature and film. Covering such topics as the portrayal of the Bubonic Plague in 14th-century novelle, Renaissance descriptions of syphilis, Verist and Neo-realist stories about contagion and poverty, and the projection of social malaise in art films, students will assess the ways in which disease is depicted in primary texts. Students will gain familiarity with contemporary contagion theories, as well as historicization and cultural criticism of literary and cinematic accounts of disease. In this course students will consider the psycho-social impact of contagion and disease from multiple perspectives - near and far, past, and present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM288",
            "Name": "Health, Medicine, and Spirituality",
            "Desc": "This course examines how spirituality and religion have informed approaches to health and medicine from the 19th century to the present, including understandings of disease, illness, health, sexuality, and the body. Topics may include spiritual and/or religious concepts of health and sickness; meditation, prayer, and healing; \"alternative\" medicine; Indigenous approaches to health and medicine; mental health and spiritual practice; and religion and health care justice. Students are introduced to a variety of research methods that will help them identify, understand, and critically assess the complex boundaries that exist between modern medicine and spirituality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM306",
            "Name": "Public Health in Medieval Society",
            "Desc": "This course explores the concept of public health in the Middle Ages to understand the diverse meanings and forms that this idea can take in different cultural contexts. Students will engage in critical readings of primary and secondary sources to learn about the care of bodies, management of disease and contagion, waste disposal, and food distribution in various medieval cities. This work will allow students to explore how notions of \"health\" and \"disease\" are cultural constructions that vary depending on the times and spaces in which they are used. Students will acquire humanities-based skills and theories to interrogate notions of health and well-being both historically and in today's societies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM307",
            "Name": "Concepts of Health and Disease in Western Medical History",
            "Desc": "This course introduces students to three paradigms in Western medical history, characterized by the primary clinical locations at which they were practiced: bedside medicine (a holistic approach), hospital medicine (a localized approach), and laboratory medicine (a lab-based approach). Students will engage in close readings of primary and secondary sources to explore how and why certain diseases, like cancer and tuberculosis, were understood differently within these three paradigms. They will learn to engage in an interdisciplinary dialogue by applying humanities-based methodologies and vocabularies to the study of health and disease, from antiquity through to the modern period.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM311",
            "Name": "Culture, Mental Health, and Wellness",
            "Desc": "This course investigates the objective and subjective realms of mental well-being, ill-being, and illness across diverse societies and cultures, as expressed through literature, film, and other media. Students will investigate the theories and methodologies employed in humanities-based mental health research; understand bibliotherapy both developmentally and therapeutically; and evaluate how texts, images, and performances shape different perspectives of mental illness and mental health. To enhance awareness of subjective aspects of human nature and prejudices, and to appreciate arts-based mental health research, students will engage in experiential learning with a rich-pictures exercise and reflective practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM312",
            "Name": "Cross-Cultural Care Traditions",
            "Desc": "This course will examine the close relationship between cultural plurality and health. Students will explore how attitudes toward health and understandings of illness are influenced and understood by different cultures. Although the course will be grounded in literary texts, it will be supplemented by material from a range of other disciplines. Students will engage issues as varied as the ethics of caring for and being cared by culturally diverse people, non-Western forms of care including Indigenous care, differing perceptions and rules for living (and dying), different attitudes toward medical treatment, and diverse spiritualities. Selected cultural traditions will be studied.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM372",
            "Name": "Women and Medicine in Literature",
            "Desc": "In this course students will engage with issues related specifically to women in Western medicine. The course will include an historical overview of the position of women in healthcare, but will focus primarily on the 20th and 21st centuries. Students will read a range of primary texts in areas such as fiction, poetry, drama, and life-writing alongside secondary readings that allow them to interrogate the representations and experiences in the primary texts. Through these readings, and through written work and in-class discussion, students will understand and respond to the specific concerns related to women in Western medicine.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM373",
            "Name": "Early Modern Bodies",
            "Desc": "This course draws on a variety of literary, religious, and medical texts to explore the ways that bodies were understood and represented in early modern England. Students will learn to situate contemporary cultural narratives about bodies, including race, gender, illness, and aging, within a historical context. They will build skills in analyzing the features and functions of narrative and representation, from close reading to thinking about how stories about bodies are shaped, shared, and passed down.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HHUM391",
            "Name": "Seminar in Health Humanities",
            "Desc": "Students will explore a topic in health humanities through text-centred analysis, critical reflection, and argumentation. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}