{
    "Name": "publichealthsciences",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "HLTH101",
            "Name": "Introduction to Health 1",
            "Desc": "This course will be of interest to students pursuing careers in health and those with a general interest in health and health care. Various perspectives of the concepts of health and illness will be introduced. Emphasis is on understanding the origins, factors and conditions that determine health throughout the lifespan, how these factors influence one another and the role/impact of health care. Additional topics include how health is measured, the leading causes of death, illness and disability, as well as how health status has changed throughout history. Students will also learn how to research and critically analyze the health literature and discuss important health issues with their peers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "HLTH102",
            "Name": "Introduction to Health 2",
            "Desc": "This course expands upon the general concepts introduced in HLTH 101 while extending the discussion to include issues such as: additional barriers to health; disease prevention; and methods used to plan, monitor, and improve individual and population health. Discussion will include when various interventions are justified and why, and where and when combinations of policies, treatments, education, and other approaches are necessary. The health of Canadians relative to that of people in other countries, as well as the inequalities that exist in health status within Canada and around the globe will be examined. Case examples will be used to illustrate points.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH103",
            "Name": "Biological Determinants of Health",
            "Desc": "This course is an introduction to the biological determinants of health designed for students who have little formal knowledge of biology, but who wish to train for careers in health promotion, public health or other social and community services.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: BIOL 130",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH173",
            "Name": "Contemporary Issues in Health 1",
            "Desc": "One or more term courses will be offered from time to time as announced by the School of Public Health and Health Systems. Topics will be dependent upon special research and/or instructional interests of the faculty.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Year 1 School of Public Health Sciences students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH201",
            "Name": "Aging and Health",
            "Desc": "This course focuses on the challenges facing older adults and on strategies to promote successful aging. A basic understanding of the physical aging process is explored, distinguishing between pathological states/illness and normal change. Many physical changes and associated functional decline are affected by modifiable factors such as sedentary lifestyles, substance abuse, and diet. Education, environment, and personal supports also play key roles in preventing illness and accidents (e.g. falls, driving accidents, and medication errors). The course addresses the interests of those working with older adults, and anyone who has older grandparents, parents, or friends.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH202",
            "Name": "Principles of Public and Population Health",
            "Desc": "This course will introduce the student to the basic theories, principles and practice of public and population health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101, 102; School of Public Health Sciences students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH204",
            "Name": "Quantitative Approaches to Health Science",
            "Desc": "An introduction to descriptive and basic inferential statistics and their application to health research. Various statistical techniques commonly used in health research are covered and applied to data using software.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH205",
            "Name": "Introduction to Health Research",
            "Desc": "This course will provide students with an introduction to health research and serve as a foundational course for subsequent courses in health research methods. An overview of multiple topics will be addressed. Selected topics might include developing research questions, observations, data sources and types. Students will also be introduced to qualitative, quantitative, and mixed-methods research design approaches.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH218",
            "Name": "Psychology of Death and Dying",
            "Desc": "Variations in the meaning and significance of death and dying will be considered from a psychological perspective, with particular attention to the contexts (e.g., cultural, familial, life-span developmental) in which these variations occur.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 101/101R; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH230",
            "Name": "Introduction to Health Informatics",
            "Desc": "Health informatics is the multidisciplinary field that aims to optimize the collection, storage, organization, retrieval, analysis, and communication of health data, information, and knowledge. Fueled by recent advances in information technology, informatics increasingly plays a vital role in many areas of health. This introductory course gives an overview of health informatics by discussing modern informatics issues and state-of-the-art applications in various sub-fields within health informatics including bioinformatics, medical informatics, e-Health, public health informatics, and prototyping solutions using open-access data. ",
            "Notes": "[Note: Formerly HLTH 330]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 330",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH245",
            "Name": "Canadian Health Systems",
            "Desc": "This course examines Canadian health systems by considering organizational principles, health resources, service utilization, health care planning, and health promotion strategies. There is a focus on societal and political issues which affect the health of the society through the delivery system.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "HLTH253",
            "Name": "Demographic Change in Canada",
            "Desc": "An introduction to the study of human population, with a focus on mortality, fertility, migration, and spatial distribution in Canada. Methods and measures used in demographic research, sources of demographic data, and the health and social implications of the major demographic trends are discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SOC 221/LS 221, ISS/SDS 251R, KIN 232, PSYCH 291, REC 371, SOC 321/LS 321, SMF 220, SWREN 251R, HLTH 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH260",
            "Name": "Social Determinants of Health",
            "Desc": "Enormous inequalities in health persist both within and between countries. These inequalities can be seen across various axes including gender, ethnicity, and access to material resources. As such, those relatively deprived/underprivileged have substantially poorer health than those better off. The course will demonstrate the extent of inequalities in health, and it will explore current theories explaining how inequalities arise, focusing on behavioural/cultural, psychosocial, and structural/material explanations. The course will also investigate the role of various approaches to economic and social policy in creating or reducing inequalities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AHS/HEALTH 107 or SOC 101 or Level at least 2B Social Policy and Social Action Specialization students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH273",
            "Name": "Contemporary Issues in Health 2",
            "Desc": "One or more term courses will be offered from time to time as announced by the School of Public Health and Health Systems. Topics will be dependent upon special research and/or instructional interests of the faculty.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Year 2 School of Public Health Sciences students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH284",
            "Name": "Microbes in Health and Disease",
            "Desc": "This course is designed to provide students with a broad overview of microbes in both health and disease. Microbes and the microbiome have important beneficial roles in maintaining health. Other beneficial microbes, such as probiotics, also promote health. Pathogenic microbes, however, can adversely impact health causing severe acute disease to chronic diseases. This course will explore several key groups of microbes and how they either promote health or cause pathology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH290",
            "Name": "An Introduction to Health Neuroscience",
            "Desc": "The primary objective of the course will be to explore the dynamic and bidirectional relationship that develops between the brain and physical health over the life span. By investigating the interaction of individual biological factors (e.g., genetic, epigenetic, and life history traits) and social context (e.g., poverty, socioeconomic position), we would hope to understand how the brain acts as both a target and mediator of processes that influence a person's health and vulnerability to disease. Topics such as developmental programming, gene-environment interactions, resilience, and stress physiology will be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of AHS/HEALTH 150, BIOL 130, PSYCH 261; PSYCH 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH301",
            "Name": "Applied Health Promotion: Theory and Community Engagement",
            "Desc": "This course introduces health promotion history, theories, and change strategies that address individual-level behaviour plus sociocultural, economic, political, and environmental conditions and resources for health that impact communities and foster engagement, empowerment, and functional collaborations. Topics include educational, persuasive, organizational, regulatory, and empowerment approaches for improving health at individual and community levels.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 102, HLTH 260/GSJ 260.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 305",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH303",
            "Name": "Program Planning and Evaluation",
            "Desc": "In this course the student is introduced to the theory and practice of public and population health programming, management, and evaluation applicable across the broad spectrum of core public health functions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 102; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH304",
            "Name": "Health Communication",
            "Desc": "This course presents an overview of theories, issues, and compelling directions in health communication, with attention to health literacy, the role of the media, public health campaigns, provider-patient communication, and risk communication. Topics may highlight: social marketing; media advocacy; use of mobile phones, social media, and the Internet for health communication; entertainment education; communication in health care settings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 102; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH310",
            "Name": "Development, Aging, and Health",
            "Desc": "The physiology of human growth, development, and aging is examined, with special reference to the influence of diet, environment, exercise, and disease on the normal processes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH320",
            "Name": "Psychosocial Perspectives on Lifespan Development and Health",
            "Desc": "This course will focus on the normative psychosocial aspects of development of the individual and their influence on the individual's physical and mental health and well-being. Through the use of a developmental systems, lifespan approach, the course will emphasize the life-long process of development. ",
            "Notes": "[Note: Formerly HLTH 220/GERON 220]",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101 and 102 or PSYCH 101/101R or 121R",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 220, GERON 220 (Cross-listed with GERON 320)",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH333",
            "Name": "Principles of Epidemiology",
            "Desc": "This course will introduce students to basic principles and methods used in epidemiology. The course will focus on both experimental and observational research designs, estimating outcome measures, principles for establishing cause and effect relationships, and the effectiveness of interventions to prevent and cure disease.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of HLTH 204, KIN 222, KIN 232, STAT 202, STAT 221, STAT 231; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH335",
            "Name": "Introduction to Statistical Analytics in Health",
            "Desc": "The course builds upon fundamental concepts of statistics for their application in health research through the use of statistical software. This course will (i) cover topics of data management, organization, and processing; (ii)  emphasize the role of statistical concepts (such as sampling, exploratory data analysis, hypothesis testing, linear models, ANOVA) in statistical computation/coding for application in data analysis; and (iii) teach methods of reporting and interpreting statistical results.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 204; Level at least 3A School of Public Health Sciences students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 316, REC 371",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH340",
            "Name": "Environmental Toxicology and Public Health",
            "Desc": "An introduction to the basic biological and toxicological processes that determine the effects of environmental pollutants on human health. Emphasis is placed on the mechanisms that give rise to chronic or delayed health effects, such as cancer, genetic mutations, and birth defects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 273, CHEM 120, and one of KIN 217, CHEM 233, 237",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH341",
            "Name": "Principles of Pathobiology",
            "Desc": "An introduction to the study of biological factors governing disease in humans that will use selected diseases to identify risk factors and illustrate pathogenic mechanisms. The role that behaviour has in modifying biological response to disease may also be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130, 273 and (KIN 217 or CHEM 233 or 237)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH344",
            "Name": "Qualitative Methods for Health Research",
            "Desc": "This course introduces students to the basic qualitative methods, tools, and research designs that are widely used in health research and program evaluation. Students will analyze qualitative data using software.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A School of Public Health Sciences students or Level at least 3A Mathematics Health Informatics Option students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH350",
            "Name": "Principles of Occupational Health and Safety",
            "Desc": "This course explores methodological approaches to the recognition, evaluation, and control of health and safety hazards in the workplace. The health effects of chemicals, physical energies and agents, biological agents, as well as psychosocial stressors are examined. Policies, programs, and practices that encourage a holistic approach to worker well-being are also considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Faculty of Health students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH352",
            "Name": "Sociology of Aging",
            "Desc": "An introduction to individual and population aging. Topics discussed include: aging from a historical and comparative perspective; aging in subcultures; aging and the social structure; aging and social processes; aging and the environment; work and retirement; and aging and leisure patterns.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R or AHS/HEALTH 107 or GSJ 101 or GSJ 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH355",
            "Name": "Public Health Nutrition",
            "Desc": "Food and nutrition are everywhere. We eat and drink every day, with a multitude of factors influencing the food that ends up on our plates, which then impacts our health and the health of the planet. In this course, we will explore the fundamentals of public health nutrition, with an emphasis on the potential to promote the health of populations and the planet through changes to our food system and eating patterns. Topics include healthy and sustainable eating patterns and how current eating patterns compare, food insecurity, nutritional pseudoscience, and individual and ecologic approaches to promote healthy and sustainable eating.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (HLTH 102 or Nutrition Minor students); Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH358",
            "Name": "Social Neuroscience 1: Mental Health and Addiction",
            "Desc": "This course examines the joint contribution of social processes and neurobiology to the risk for and development of mental health conditions in the modern world. Topics may include the social neurobiology of affective disorders (e.g., anxiety, depression, post-traumatic stress disorder), eating disorders, addictions, and suicide.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 101 and (STAT 202, BIOL 361) or (KIN 232, KIN 354) or (PSYCH 291, PSYCH 292, PSYCH 261) or (HLTH204; HLTH205 or HLTH333) or (AHS/HEALTH150, REC371) or Addictions, Mental Health, and Policy Minor students; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH460",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH370",
            "Name": "Ecological Determinants of Health",
            "Desc": "This course will examine the links between ecosystems, global ecological change, and the health and well-being of human communities. It will review the myriad ways in which the Earth, as a living system, is the ultimate determinant of human health. The course is divided into three parts: in the first part key environmental changes are addressed, including climate change, ecotoxicity, resource depletion, species extinction, and stresses on ocean systems as well as the social and human forces that drive these changes. The second part of the course focuses on the implications of these ecological changes and population health. The third part of the course will address potential solutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH373",
            "Name": "Contemporary Issues in Health 3",
            "Desc": "One or more term courses will be offered from time to time as announced by the School of Public Health and Health Systems. Topics will be dependent upon special research and/or instructional interests of the faculty",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Year 3 School of Public Health Sciences students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH380",
            "Name": "Applied Public Health Ethics",
            "Desc": "This course explores ethical issues in health sciences, emphasizing population and public health. The course begins by considering canonical ethical theories and frameworks for applying these theories to population health. Specific topics in population health, including the conflict between public health and individual autonomy, the just distribution of health resources, and responsibility for health outcomes will then be discussed. The overall objective of the course is to provide students with tools to discuss and assess ethical arguments and to form their own views on issues within population health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 280/GSJ 280",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH392",
            "Name": "Mental Health Systems and Policy",
            "Desc": "This course will explore concepts of mental health, mental illness, and substance use from a societal perspective. This will include an exploration of risks and protective factors at the individual and social levels. An overview of the addictions and mental health care systems will also be discussed, with particular emphasis on the role of public and private policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 245/GERON 245 or HLTH 260/GSJ 260 or Addictions, Mental Health, and Policy Minor students; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH400",
            "Name": "Interdisciplinary Perspectives on Aging",
            "Desc": "This course provides an opportunity for critical discussion and analysis of a range of key issues in aging and aging research, and of health system and health policy issues affecting older persons. Speakers will represent a variety of disciplines, reflecting the importance of interdisciplinary perspectives in aging research, as well as the combination of biomedical and psychosocial factors that contribute to healthy aging or to the development of frailty and chronic disease.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GERON/HLTH 201; Fourth Year School of Public Health Sciences students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH401",
            "Name": "Global Health",
            "Desc": "We are becoming a global community; increasingly, health concerns are international in nature and impact. The student will build upon core content concerning population and public health theories, international health care systems, and cultural sensitivity to address emerging global health concerns on the perspective of public and population health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 102, HLTH 245; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH403",
            "Name": "Global Health Innovation",
            "Desc": "Innovation is needed to address some of the world's biggest global health challenges. This course will explore the development, implementation, and evaluation of new ideas and approaches to address contemporary global health needs. Emphasis will be placed on interdisciplinary, multi-sectoral, and community-engaged efforts to achieve health equity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 102, HLTH 245; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH410",
            "Name": "Health Policy",
            "Desc": "Health care policy exists at federal, provincial, local and institutional levels, and shapes every aspect of the Canadian Health Care System. Its ongoing development, implementation, and outcomes are shaped by ideology and empirical evidence through the definition of health issues, setting of priorities for action, and the policy instruments chosen for implementation. This course will introduce students to health policy in Canada and provide them with an understanding of what policy is, how it is developed, who is involved with its production, implementation, and evaluation. Students will learn to critically analyze real world examples of Canadian health policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 245 or Social Policy and Social Action Specialization students; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH412",
            "Name": "Comparative Health Systems",
            "Desc": "This course addresses the history and development of health systems, and comparison of the social ethics, organization, and financing of different national health systems. Topics include the design of health systems; strengths and weaknesses of alternative systems for public health and health care delivery; current strategies for health system reform in resource-rich and resource-constrained nations; and ethical issues associated with health system reform. This course uses a case-study, problem-based approach.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH420",
            "Name": "Health, Environment, and Planning",
            "Desc": "This course examines the relationship between the environment (built/physical, economic, social, political, and natural aspects) and population health. It focuses on conceptual and empirical links among current environment-health issues such as air quality, active transportation, injury prevention, climate change, and mental well-being. Emphasis is placed on the role of urban planners in collaboration with allied professionals (e.g., public health, engineering, law enforcement, architecture) in creating and maintaining healthy built environments to improve population health with a focus on key health issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PLAN 233, HLTH/GSJ 260, ERS 253, GEOG 325",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH421",
            "Name": "Nutritional Aspects of Chronic Disease",
            "Desc": "Nutrition is integral to the etiology, prevention, and treatment of chronic diseases. This course examines nutritional aspects of key chronic diseases affecting the Canadian population. There will be an opportunity for students to explore, in depth, specific conditions and aspects of nutritional assessment or intervention that interest them. Case topics span the lifecycle and such conditions as obesity, eating disorders, diabetes, dyslipidemia, cardiovascular disease, and some cancers. As well, students present seminars on a topic of their choice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 355 or (KIN 146, 217, BIOL 273); Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH427",
            "Name": "Dementia Care",
            "Desc": "This course provides a comprehensive examination of dementia from multiple perspectives, including the person living with dementia, family care partners, and the health and social care systems. Key topics include epidemiology, prevention, stigma, meaningful engagement, care, and support.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH430",
            "Name": "Geriatric Medicine and Health Care",
            "Desc": "Why do some people age well, and others don't? How do we care for them? This course will address the role of geriatric medicine in the context of an aging population and provide in-depth coverage of frailty and geriatric syndromes. Students will practice critical appraisal skills of geriatric literature, and apply these to understanding how system design, interprofessional care, and geriatric medicine can improve outcomes for older persons. Students will also have the opportunity to learn about health system issues directly from stakeholders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH432A",
            "Name": "Honours Thesis (A)",
            "Desc": "An independent research project on an approved topic, supervised by a faculty member. Includes an approved proposal and completion of -- introduction, review of literature, methods, data collection, data analysis and presentation of results in thesis form. Recommended for students planning graduate studies.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: HLTH 333; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH432B",
            "Name": "Honours Thesis (B)",
            "Desc": "An independent research project on an approved topic, supervised by a faculty member. Includes an approved proposal and completion of -- introduction, review of literature, methods, data collection, data analysis and presentation of results in thesis form. Recommended for students planning graduate studies.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: HLTH 432A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH433",
            "Name": "Experimental Methods",
            "Desc": "This course focuses on the key issues related to the design, conduct, analyses, and interpretation of experimental studies. Examples will be drawn from animal research investigating disease mechanisms and from clinical and population studies investigating efficacy of preventive or therapeutic strategies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 335 or STAT 316; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH435",
            "Name": "Knowledge Translation for Public Health and Health Care",
            "Desc": "This course is about bridging gaps between evidence-based knowledge and real world policies and practices. Along with concepts and skills about knowledge synthesis, the focus is on integrated knowledge-to-action processes for engagement, collaboration, implementation, and scale-up to meet objectives of changing policies, behaviours of health care providers and other individuals, and organizational practices. Topics and skills may include use of systematic and scoping reviews of literature, Diffusion of Innovations and Social Marketing frameworks, behavioural economics, policy change strategies, public health ethics, Health Impact Assessments, Critical Public Health perspectives, and issues from current events.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 333; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH442",
            "Name": "Epidemiology of Non-Communicable Diseases",
            "Desc": "This course builds upon the concepts learned in HLTH 333. The primary objective is to provide an understanding of the fundamental concepts, principles and applications of non-communicable disease epidemiology. The course emphasizes understanding of epidemiologic methods and identification of risk and protective factors.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 333; HLTH 335 or STAT 316; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH443",
            "Name": "Epidemiology of Communicable Diseases",
            "Desc": "This course introduces the basic methods for communicable disease epidemiology and discusses important infectious diseases, including their history, ecology and current public health significance.  The course focuses on epidemiological methods in infectious disease research, prevention, and control, such as outbreak investigations, disease surveillance, case-control and cohort studies, laboratory tools, molecular epidemiology, dynamics of transmission, and assessment of vaccine field effectiveness.  A range of communicable diseases will be discussed including respiratory infections, diarrheal diseases, sexually transmitted diseases, bloodborne diseases, and vector-borne diseases.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 333; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH445",
            "Name": "Pandemic Preparedness",
            "Desc": "This course will provide an in-depth examination of pandemics with emphasis on preparedness, planning, and control. It will include topics on history of pandemics, their origins, prevention, and control, and their impacts (e.g., social, economic, political). Students will learn about infectious diseases mainly related to pandemics, best practices to prevent and control transmission, and impacts on society and populations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 101, HLTH 333; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH448",
            "Name": "Advanced Studies in Social Determinants of Health",
            "Desc": "This course will provide an in-depth examination of social determinants of health, both in North America and around the world. Students will apply their knowledge and understanding of nonbiological contributors to health by observing, studying, and 'unpacking' actual health issues in the local community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH449",
            "Name": "Alcohol and Drug Use and Abuse in Contemporary Society",
            "Desc": "This course will provide an overview of alcohol and drug use and abuse in contemporary society. Students will develop an understanding of how alcohol and other drug problems become defined as social problems and how these definitions influence subsequent intervention strategies. Students will explore the social, political, economic, and biological determinants of the use and abuse of alcohol and drugs, and then critically examine real-world policy issues related to prevention, control, and cessation of use.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences or Addictions, Mental Health, and Policy Minor students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH450",
            "Name": "Gender, Sex, and Health",
            "Desc": "This course examines the links between gender, sex, and health. Students are introduced to the social and cultural theorizing on sex and gender, including critical and postmodern approaches. Topics that are explored in this course deal with the social construction of gender, medicalization, gender and health inequalities, reproductive health, gender in the context of health care organization and structure, and intersection of gender with other systems of social inequalities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH451",
            "Name": "Analysis and Management of Health Information in Aging Populations",
            "Desc": "The course combines an overview of health policy issues and service delivery with methodological considerations in the analysis of health information from a variety of sources. The topics to be addressed may include the role of health information in evidence-based practice and policy development; basic concepts of demography and health information management; secondary data analysis; case-mix based funding systems; performance indicators, quality, and accountability in health care; clinical applications of health data; need analysis; cost analysis; international comparisons.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 335 or STAT 316; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH452",
            "Name": "Decision Making and Decision Support in Health Informatics",
            "Desc": "One of the major aims of health informatics is to help health professionals make better decisions. To this end, diverse models and methods of decision making and decision support have been developed and implemented in health care settings. This course reviews theories, methods, and technologies for aiding the process of making decisions in health care.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH453",
            "Name": "Computing in Health Informatics",
            "Desc": "This course focuses on the fundamental computing methods and concepts that are commonly employed in modern health informatics in order to collect, store, organize, process, analyze, and communicate digital health data/information/knowledge. Students will gain both theoretical knowledge and practical experience so that they can apply the learned methods in practice after completing this course.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 230 and (CS 105 or CS 115 or CS 135) and (CS 106 or CS 116 or CS 136)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH454",
            "Name": "Information Visualization",
            "Desc": "This course provides an introduction to the field of information visualization: the use of computer graphics and interaction to help humans understand, interpret and solve problems using complex data. Topics will be covered using case studies, and include what is visualization?; use of colour, shape, and contrast in representing data; rules of thumb for creating visualizations; and case studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 230, CS 105 or CS 115 or CS 135, CS 106 or CS 116 or CS 136",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH455",
            "Name": "Disease Mapping and Geographic Information Systems",
            "Desc": "This course introduces disease mapping. It covers what, why, and how concerning disease mapping with a focus on how. Through hands-on experience with Geographic Information Systems (GIS), students learn how to produce maps for displaying and analyzing geographic patterns of diseases. They also learn how to identify locations of disease clusters and obtain clues as to the disease etiology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 335 or STAT 316; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH458",
            "Name": "Social Neuroscience 2: Lifestyle and Chronic Illness",
            "Desc": "This is an in-depth course intended for the intensive study of psychological, neuroscientific, and social processes that together set the stage for the development of chronic illnesses in the modern world. Topics include exercise neuroscience, health-related decision processes, and neural responses to health risk communications in the media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 101; (STAT 202, BIOL 361) or (KIN 232, KIN 354) or (PSYCH \n291, PSYCH 292, PSYCH 261) or (HLTH 204; HLTH 205 or HLTH 333) or (HEALTH 150, REC 371) or Addictions, Mental Health, and Policy Minor students; \nLevel at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH459",
            "Name": "Social Neurobiology of Eating",
            "Desc": "This course examines the social and neurobiological dimensions of eating. Using methods from behavioral sciences, neurosciences, and population health, we will explore the ways in which homeostasis, hedonic indulgence, social conformity together explain why we eat what we do. Topics will include brain representation of taste, neural and social dimensions of the flavour experience, self-control processes in eating, and neural gating and potentiation of social cognitive processes involving food.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Fourth Year Health Sciences",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH461",
            "Name": "Experimental Methods in Behavioural Neuroscience",
            "Desc": "As a senior laboratory course, the primary objective will be to provide students with a broad conceptual and practical understanding of how to design, conduct, and interpret animal-based experiments that seek to answer neuroscience-themed questions with relevance for public health. To this end, students will receive instruction upon, and gain direct experience in, a variety of areas; for example, animal ethics and husbandry, experimental design, behavioural techniques to assess learning and memory, molecular techniques to assess protein-level changes, statistical analysis, and the preparation of a scientific manuscript.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273 or PSYCH 261; one of HLTH 205, 333, BIOL 361, KIN 232, PSYCH 291; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH465",
            "Name": "Epigenetics and Health",
            "Desc": "This course provides an in-depth examination into how genes, environment, and epigenetics interact over the lifespan to increase risks for complex diseases and disorders. Students will explore how environmental exposures such as diet, drugs, psychosocial stress, and environmental toxicants can become biologically-embedded via stable epigenetic changes that affect long-term gene expression. Underlying molecular mechanisms for epigenetic modifications, such as DNA methylation, histone modification, and the role of non-coding RNAs will also be covered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 239, 273; one of HLTH 205, HLTH 333, BIOL 361, KIN 232; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH471",
            "Name": "Psychopharmacology",
            "Desc": "The primary objective of the course will be to provide a basic understanding of how drugs can alter the function of neural cells and how these changes can affect mood, cognition, and behaviour. Key topics to be discussed include biological principles of pharmacology; general structure and function of the nervous system; major neurotransmitter systems of the brain; mechanisms of drug action on neurotransmission; and pharmacotherapy for mental health illness.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273 or PSYCH 261; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH472",
            "Name": "Independent Study",
            "Desc": "For the School of Public Health and Health Systems' (SPHHS) student who desires to pursue a particular topic in depth through guided independent research and/or reading. An SPHHS faculty member must approve and supervise a student's project prior to registration. May be repeated in subsequent terms. Depending on student demand and availability of teaching resources, special topics may be presented to small groups in a lecture format. Such topics have included pharmacology, behavioural immunity, nutrition, and the health care system.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH473",
            "Name": "Contemporary Issues in Health 4",
            "Desc": "One or more term courses will be offered from time to time as announced by the School of Public Health and Health Systems. Subjects will be dependent upon special research and/or instructional interests of the faculty.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH474",
            "Name": "Health Apprenticeship",
            "Desc": "This course provides students with an opportunity for an in-depth exploration of a topic of specific interest to the student, and to develop/enhance skills related to this area. For example, students could work as a member of a research team (on or off campus), or complete a placement at a health care, community-based, or other type of organization. Students must identify a supervisor, design an apprenticeship experience, establish individualized learning goals, and develop a plan for evaluation. As this course will be graded, there must be at least one academic deliverable (e.g., a review of the literature, proposal, presentation, knowledge dissemination product, etc.). The apprenticeship is unpaid and students will normally spend 6-8 hours per week for at least 12 weeks during the term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH475",
            "Name": "Measuring Food and Nutrition Exposures and Outcomes",
            "Desc": "The accurate assessment of food and nutrition exposures and outcomes at the level of individuals and environments is fundamental to understanding eating patterns and the effectiveness of interventions to shape them. We will examine principles and methods of assessment, with a primary focus on food and nutrition but also consideration of related domains, such as physical activity. The principles addressed will have relevance to measurement of a range of domains (e.g., tobacco use, alcohol consumption).",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: HLTH 355; Level at least 4A School of Public Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH479",
            "Name": "Child Mental Health Epidemiology",
            "Desc": "Mental health problems in childhood and adolescence impose a significant burden on the public health system. The course presents the epidemiology of common child mental disorders and includes discussions on theoretical frameworks related to child mental health, measurement of psychopathology, the mental health system, and ethical conduct of research in vulnerable populations. There is heavy emphasis on group work whereby students will develop a research study in the area of child mental health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: HLTH 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH480",
            "Name": "Competencies in Health",
            "Desc": "This capstone course provides an opportunity for students to reflect on the competencies they have developed throughout their undergraduate degree, identify and articulate transferrable skills, and showcase their achievements from their coursework. Students will create a cumulative project that highlights their development of core competencies within health sciences and public health.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Health Sciences students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "HLTH481",
            "Name": "Community Learning Project",
            "Desc": "Service learning is a method of teaching and reflection designed to use community service as a vehicle to enrich and integrate classroom learning, teach civic responsibility, encourage lifelong civic engagement, and strengthen communities. Students will be required to identify and design community learning placements, including the establishment of specific learning and outcome objectives, and a method of evaluation. Provisions must be approved by the community agency and the course coordinator. Placements are normally 8 to 10 hours per week for 8 weeks. In the final week of the term students will meet to reflect upon and share their experience with fellow students. Students will also complete a written report detailing whether and how they achieved their objectives, what they learned from the process relevant to the practice of health promotion, and how their experience utilized or exemplified course based material and assignments. Reports will be reviewed and graded as pass/fail by both the community partner and a faculty service leader.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Year 4 Bachelor of Health Promotion students or Bachelor of Public Health students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}