{
    "Name": "internationaldevelopment",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "INDEV10",
            "Name": "International Development Seminar",
            "Desc": "INDEV 10 is a non-credit, no-fee seminar series on current topics in international development. Each session may feature a guest speaker or a field placement information session. Except where otherwise noted INDEV 10 seminars are open to all INDEV students, faculty, staff, and alumni. Participation is not mandatory but encouraged.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: International Development students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV100",
            "Name": "Introduction to International Development",
            "Desc": "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development. Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies. Reference is made to particular development problems in specific developing countries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV101",
            "Name": "Issues in International Development",
            "Desc": "This course examines key issues in international development. International Development involves the search for sustainable and equitable solutions to poverty primarily but not only in the Global South. The causes and consequences of poverty are many and varied: environmental degradation; insufficient food production; inequitable access to land and related resources; poor governance; civil war and other types of conflict. The impacts of poverty manifest differently depending on culture, technology, geo-political factors and globalization.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 100",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV200",
            "Name": "The Political Economy of Development",
            "Desc": "This course develops students' understanding of how the complex interplay of international economic and political economy factors influence development initiatives and outcomes. The relation of trade, aid, and international institutions (WTO, IMF, World Bank) on development activity is examined using case studies. Different economic views will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV202",
            "Name": "Accounting for Development Organizations",
            "Desc": "Students will obtain a fundamental understanding of financial and management concepts, and an appreciation of the measurement issues and monetary impact of business decisions on communities, society and the environment. Topics include financial statement reporting and analysis, cost analysis, triple bottom-line reporting, corporate social responsibility including the Global Sullivan Principles, and green accounting.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV212",
            "Name": "Problem-solving for Development",
            "Desc": "Students will obtain an understanding of the fundamental features of creative thinking, decision-making and problem-solving from both a descriptive and a normative point of view. Techniques for analyzing problem-solving and decision-making by individuals and groups with particular attention to the impact of cultural difference among individuals and within teams. Techniques for improving problem-solving and decision-making in a community development context will be considered. Effective negotiation in different cultural contexts will be studied.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV262",
            "Name": "Introduction to Global Emerging Cities",
            "Desc": "This course focuses on the dynamics of growth and change in global emerging cities, with a focus on the urban transition underway in cities, with emphasis on Asia and Africa. Current urban challenges (e.g. social inequality, uneven development, climate change) are discussed, as well as opportunities for innovative planning and sustainable urban development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV275",
            "Name": "Special Topics in International Development",
            "Desc": "This course allows for additions to the program on a short-term basis, and for the development of future permanent courses. ",
            "Notes": "[Note: Field trip fee may be required]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV300",
            "Name": "Culture and Ethics",
            "Desc": "This course surveys a variety of competing ethical positions that have been, and continue to be, adopted by different cultures around the world. Can two competing ethical viewpoints both be right? If not, then what grounds should we adopt to decide between them, and under what circumstances? How can we negotiate the difficulties that such differences pose for our practical judgment and moral theorizing? Students will engage these questions by reading texts in philosophical ethics and meta-ethics, and by applying what they have learned in case studies of ethical differences among cultures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV302",
            "Name": "Development Agents",
            "Desc": "This course examines the nature, variety and inter-relationships of and among organizations, institutions, agencies and individuals involved in contemporary development activity.  The many and various legal, political and financial factors that affect the organization and operation of development agents are studied with respect to implications for business model, management skills, governance oversight and public policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV308",
            "Name": "Introduction to Social Entrepreneurship",
            "Desc": "This course uses the case study method to examine the challenges of starting, funding and operating an early-stage social change venture in a developing country. The focus is on ventures that address urbanization and poverty. Students explore the complexities of managing and sustaining growth, the role of governing boards, and the role of private sector partnerships and resources. Innovative public/private partnerships are examined. The challenges and opportunities associated with engaging diverse partners with differing agendas are considered from the perspective of the entrepreneur, investor/donor, local community leaders and legal counsel.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 200 or Environment & Business students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV375",
            "Name": "Special Topics in International Development",
            "Desc": "This course allows for additions to the program on a short-term basis, and for the development of future permanent courses. ",
            "Notes": "[Note: Field trip fee may be required]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV387",
            "Name": "Global Cities in Global Development",
            "Desc": "More than half of the world's population resides in urban areas, with the bulk of this growth taking place in the mega-cities of the global South. Many cities in the world are now truly 'global' in their reach and orientation: New York, Shanghai, Mexico City, Johannesburg. Thus, urbanization presents key developmental challenges that face the world's urban population, and highlights the search for sustainable solutions in select cities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV401",
            "Name": "International Development Placement 1",
            "Desc": "INDEV 401 and 402 comprise an 8-month internship abroad with a development project, organization, or institute. INDEV 402 immediately follows INDEV 401. Students are expected to fulfil work duties, language milestones, and academic assignments. The culmination of both courses is a professional service report based on projects and the wider work undertaken by the student and their organization during their placement. ",
            "Notes": "[Note: Students are responsible for all travel and subsistence costs associated with their international placement]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A International Development students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV402",
            "Name": "International Development Placement 2",
            "Desc": "INDEV 401 and 402 comprise an 8 month internship abroad with a development project, organization or institute. INDEV 402 immediately follows INDEV 401.\nStudents are expected to fulfil work duties, language milestones and academic assignments. The culmination of both courses is a professional service report based on projects and the wider work undertaken by the student and their organization during their placement. ",
            "Notes": "[Note: Students are responsible for all travel and subsistence costs associated with their international placement. The INDEV capstone event is a mandatory component of this course. The event is scheduled during the last week of April and first week of May.]",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 401",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV404",
            "Name": "International Development Theory",
            "Desc": "This course emphasizes both theoretical and conceptual frameworks, techniques, practices and methods for analysis of development, focusing in particular on the historical and spatial trajectory of international development through an examination of seminal texts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV474",
            "Name": "Special Topics in International Development",
            "Desc": "From time to time, courses of special topics may be offered at the fourth-year level, for program enrichment.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A; International Development students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV475",
            "Name": "Contemporary Development Issues",
            "Desc": "This course considers contemporary development issues and strategies, including environment, conflict/post-conflict and transition countries, gender, globalization, human rights, culture and religion, and current thinking, many of which are addressed by perspectives from academia, the NGO sector and development agencies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV476",
            "Name": "Contemporary Issues in Development Practice",
            "Desc": "This course focuses on contemporary development issues - environment, gender, migration, climate change, democracy, to name several. It also highlights the ways and means for students to respond to one or more of these issues, particularly as they relate to their field placements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A; International Development students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV478",
            "Name": "Governing the Commons",
            "Desc": "This course revolves around the definition, concepts, evolution, and approaches of 'commons' as an interdisciplinary field of study. 'Governing the Commons' focuses directly on the theory, practice, and policy pertaining to the commons and highlights the significance of collective action across multiple scales in responding to the complex sustainability and governance challenges facing our environment and society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: INDEV 475/ERS 675/SUSM 675 Topic: Governing the Commons.",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV490A",
            "Name": "Honours Thesis: Project Preparation",
            "Desc": "The Honours Thesis/Project provides students with an opportunity to pursue a specific research topic or applied project of their choosing relating to the study of international development. The paper will be prepared over two semesters. 490A involves the guided preparation of a research/project proposal.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A; International Development students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "INDEV490B",
            "Name": "Honours Thesis: Project Completion",
            "Desc": "The Honours Thesis/Project provides students with an opportunity to pursue a specific research topic or applied project of their choosing relating to the study of International Development. The paper will be prepared over two semesters. 490B involves the formal completion of the thesis/project.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: INDEV 490A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}