{
    "Name": "italianstudies",
    "Notes": "The following courses are administered by St. Jerome's University.\nAll ITALST courses are taught in English.",
    "Courses": [
        {
            "courseCode": "ITALST100",
            "Name": "Understanding Modern Italy",
            "Desc": "This course examines Italy's transformation from Unification in 1861 to present day. Students will explore its paradoxes and challenges through films and readings on topics such as the World Wars, the rise of fascism, internal terrorism, and migration in order to gain an understanding of contemporary Italian society and culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ITALST111",
            "Name": "Sex, Marriage, and Family Traditions in Italy",
            "Desc": "This course explores the contributions of Italian women artists, writers, and intellectuals from the Medieval times through the Renaissance to the Baroque period. The focus will be on the institutions of marriage and of the family.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST112",
            "Name": "Sexual Identities and Relationships in Italy",
            "Desc": "This course explores the contributions of Italian women artists, writers, and intellectuals from the Enlightenment until contemporary times. The focus will be on the expression of sexual identities, the nature of relationships, and the influence of family ties.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST120",
            "Name": "Italian Cinema",
            "Desc": "This is a survey of the most representative works of Italian cinema, from the early 20th century to present day. Students will gain an understanding and appreciation of one of the most influential world cinemas. Special attention will be given to cinematic movements, the role of directors, and cult movies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST263",
            "Name": "Contagion, Disease, and Illness in Italian Literature and Film",
            "Desc": "This course will focus on representations of contagion and illness in Italian literature and film. Covering such topics as the portrayal of the Bubonic Plague in 14th-century novelle, Renaissance descriptions of syphilis, Verist and Neo-realist stories about contagion and poverty, and the projection of social malaise in art films, students will assess the ways in which disease is depicted in primary texts. Students will gain familiarity with contemporary contagion theories, as well as historicization and cultural criticism of literary and cinematic accounts of disease. In this course students will consider the psycho-social impact of contagion and disease from multiple perspectives - near and far, past, and present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST265",
            "Name": "The Mafia",
            "Desc": "This course analyzes the visual media representation of the Mafia in North America and the manner in which it often glorifies the Italian Mafiosi's lifestyle. The goal is to deconstruct the romanticized portrayal of the Italian and Italian-American gangster created in visual media by analyzing atrocities committed by organized crime.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ITALST271",
            "Name": "Italian Canadian Experience",
            "Desc": "An examination of Canada's sixth largest ethno-cultural group. Emphasis will be placed on the changing nature of immigration and the evolution of the Italian community since the late 19th century.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST281",
            "Name": "Italian Cinema and the Novel",
            "Desc": "A survey of some of the principal novels of 20th century Italy as they have been adapted in film by Italian directors. Students will study literary and cinematic representations of themes such as the rise of the Italian bourgeoisie, the economic boom of the 1960s, domestic violence, and organized crime.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST291",
            "Name": "Italian Culture and Civilization 1",
            "Desc": "A survey of developments in Italian culture - history, literature, and the arts - up to and including the Renaissance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ITALST292",
            "Name": "Italian Culture and Civilization 2",
            "Desc": "A survey of developments in Italian culture - history, literature, painting, and music - in the post-Renaissance period, with emphasis on modern Italy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "ITALST296",
            "Name": "Special Topics in Contemporary Italian Society",
            "Desc": "This course gives students an opportunity to study aspects of contemporary Italian society not covered in other courses. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST311",
            "Name": "Medieval Italian Literature",
            "Desc": "An introduction to the Italian literature of the Middle Ages, with special reference to selections from the major works by Dante, Petrarch, and Boccaccio.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST312",
            "Name": "Renaissance Italian Literature",
            "Desc": "An introduction to the Italian literary production of the 15th and 16th centuries, focusing on selections from the major works by writers of the period.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST349",
            "Name": "The Mystical Imagination",
            "Desc": "This course examines works of writers, artists, architects, and thinkers in the Western European tradition for whom all of reality participates in the larger mystery of God. The course focuses on figures who, from the early Italian Renaissance onward, gave expression to that mystical imagination. ",
            "Notes": "[Note: This course is taught in Rome and incurs extra costs for the student above and beyond the registration fee in the form of travel, room and board, and incidental costs.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST360",
            "Name": "Dante's Divine Comedy",
            "Desc": "This course examines the various strands of what is one of the greatest works in Western literature, Dante's Divine Comedy. The course will engage students in a critical reading of the text's various layers of meaning, which emphasize perennial issues of our human condition.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST392",
            "Name": "Modern Italian Poetry and Theatre",
            "Desc": "This course studies the works of major Italian poets and playwrights, modern and contemporary, paying special attention to works by women authors.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST394",
            "Name": "Italian Studies in Italy",
            "Desc": "Italian literature, art, culture, and history studied abroad in Italy.  ",
            "Notes": "[Note: Normally offered in the spring term. Information about current offerings can be obtained from the department.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "ITALST396",
            "Name": "Special Topics/Directed Readings",
            "Desc": "This course gives the student an opportunity to study authors and works of special interest which are not covered in other courses. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}