{
    "Name": "jewishstudies",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "JS203",
            "Name": "Jewish Responses to the Holocaust",
            "Desc": "The catastrophe and devastation of the Holocaust and the radical nature of its evil demanded responses within contemporary Jewish thought, identity, and experience. This course will explore philosophical, theological (Jewish law, rabbinic), literary (novels, poetry, memoirs, plays), and artistic (museums, memorials) attempts to deal with the issues the Holocaust raises. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS209",
            "Name": "Jews and Jewishness",
            "Desc": "This course examines the central elements that make up contemporary Jewish identity/identities, traditional and otherwise, with particular focus on the North American Jewish experience and the nature of Jewish modernity. It explores historical, literary, religious, and social issues that have contributed to the formation of these identities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 114/RS 114",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "JS212",
            "Name": "Great Jewish Books",
            "Desc": "Jews are a people of many books. Over the centuries challenges to their faith and very existence have provoked various responses. From the Bible to contemporary times, this course comprehensively examines the history of Jewish thought through essential books that offer radically divergent conceptions of Jewishness and Judaism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 125",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS215",
            "Name": "Visions of Israel in Judaism: From Biblical to Modern Times",
            "Desc": "This course surveys the significance of the land of Israel in Judaism from historical, textual, and religious perspectives. Topics covered include the politics of Ancient Israel; the concept of Israel in prayer and the rabbinic and medieval Jewish imagination; portrayals of Israel in Christian and Muslim texts; and the origins, visions, and challenges of Zionism and the modern State of Israel. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "JS217",
            "Name": "Judaism",
            "Desc": "An introduction to the religious tradition of the Jews in terms of beliefs, practices, ideals, and institutions from the beginning to the present time. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS218",
            "Name": "Seduction, Rivalry, and Dysfunction in the Bible",
            "Desc": "Students will be introduced to the Hebrew Bible (Old Testament) by way of selected readings which deal with a particular aspect of the human predicament. The focus will be on exploring relationships via narrative passages in the Old Testament and particularly in the Book of Genesis. The following relationships will be discussed: spousal; human/God; parent/child; siblings; gender issues in narratives of rape, incest, seduction, and dominance. The focus of this course will be more on select specific themes rather than an overview of many themes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 120/RS 111",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS228",
            "Name": "Big Ideas of the Bible",
            "Desc": "The Bible is the most translated and most read document in human history. This course explores central biblical ideas, from creation to the end of time, violence to redemption, and political intrigue to family ties, and examines their impact on Judaism, Christianity, and Western Culture. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 131/RS 130",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS233",
            "Name": "The Holocaust and Film",
            "Desc": "An examination of the Holocaust as portrayed in feature films and documentaries. Do cinematic attempts capture the horror of the Holocaust faithfully, or trivialize it? The background to anti-semitism, use of religious imagery in propaganda films, and what counts as success or failure in cinematic representations are discussed. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS234",
            "Name": "Power and Corruption in the Bible",
            "Desc": "This course will examine the uses and abuses of power in the Hebrew Bible (Old Testament) by analyzing the historical narratives of the conflict between Saul and David, as well as the rise and fall of King David. In doing so, it will deal with the period of the prophets, i.e., the books of Joshua, Kings, and Samuel. ",
            "Notes": "[Note: Knowledge of Hebrew is not required. This course fulfils an Area 1 or Area 2 requirement for Religious Studies majors but not both.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 130/RS 112",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS235",
            "Name": "Jesus: Life and Legacy",
            "Desc": "The life and death of Jesus of Nazareth, as experienced and interpreted by his followers and recorded in the New Testament and other ancient literature. Attention is given to Jesus' identity as a Jew in the Roman Empire in the first century, his teachings and actions, and his ongoing significance throughout history. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "JS236",
            "Name": "Paul: Life and Letters",
            "Desc": "The career and thought of the apostle Paul, at once a Jew, a Graeco-Roman, and a Christ believer, living within the Roman Empire. Attention is given to issues such as spirit, Jewish Law, grace, freedom and slavery, Christ, church, politics, gender, and sexuality. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "JS237",
            "Name": "Insiders and Outsiders in the Bible",
            "Desc": "This course explores the tension between insiders and outsiders in the Bible, examining the rationale for and implications of issues such as purity, holy war, the chosen people, and the Gentiles. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS301",
            "Name": "Canada and the Holocaust",
            "Desc": "An analysis of the response to the Holocaust, from 1933 to 1945, and the legacy of the event since the war in Canadian society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS314",
            "Name": "Secret Teachings and Mysticism in Judaism",
            "Desc": "This course will survey the roots, history, and symbolism of the Jewish mystical tradition known as Kabbalah. Students will be introduced to the major texts, charismatic mystical masters, and schools of Kabbalah. ",
            "Notes": "[Note: Knowledge of Hebrew is not required. This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 211/RS 213",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS350",
            "Name": "Special Topics in Jewish Studies",
            "Desc": "One or more special courses will be offered at different times. Consult the department for current offerings. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS364",
            "Name": "Jewish Humour: Laughing Your Way Through History",
            "Desc": "Jewish comedians have dominated humour in North America from Groucho Marx to Jerry Seinfeld, Sarah Silverman, Amy Schumer, and Seth Rogen. Studying Jewish humour is critical for understanding the development of Judaism, Jewish identity, immigrant experience, and response to persecution. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "JS450",
            "Name": "Special Topics in Jewish Studies",
            "Desc": "One or more special courses will be offered at different times. Consult the department for current offerings. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}