{
    "Name": "kinesiology",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "KIN100",
            "Name": "Regional Human Anatomy",
            "Desc": "Regional anatomy of the limbs and trunk, including a brief introduction to the anatomy of the central nervous and cardiovascular systems. The course focuses on the bones, muscles, and neurovasculature of the limbs and trunk.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: KIN 100L",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN100L",
            "Name": "Regional Human Anatomy Laboratory",
            "Desc": "Regional gross anatomy of the limbs and trunk, including a brief introduction to the central nervous and cardiovascular systems. The anatomy is explored using pre-dissected human cadavers. For the limbs and trunk, the emphasis is placed on structures (muscles, nerves, and bones) involved in gross movement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN104",
            "Name": "Fundamentals of Kinesiology",
            "Desc": "This course will introduce students to the issues and approaches in the discipline of kinesiology. Students will gain foundational knowledge and learn about procedures associated with kinesiology. Emphasis will be placed on practical skills, critical analysis, problem-solving, and the integration of knowledge across the breadth of kinesiology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "Coreq: KIN 104L (for Kinesiology Majors only)",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN104L",
            "Name": "Fundamentals of Kinesiology Laboratory",
            "Desc": "This lab provides exposure to techniques utilized in the discipline of kinesiology. Students will gain practical skills in tests that measure cardiovascular function, neuromuscular function, and body composition.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN121",
            "Name": "Biomechanics of Human Movement",
            "Desc": "This course will provide students an understanding of human movement from a mechanical perspective, which enables identification of potential risks for injury, optimizes exercise prescription, and promotes understanding of clinical evaluations. Specifically, concepts related to functional anatomy, muscle and passive tissue mechanics, anthropometry, electromyography, and linked segment mechanics are introduced and applied to clinical, occupational, and athletic situations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PHYS 111; MATH 124 or MATH 127.",
            "Coreqs": " Coreq: KIN 121L (for Kinesiology Majors only)",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN121L",
            "Name": "Biomechanics of Human Movement Laboratory",
            "Desc": "This laboratory course provides students with practical tools used in the biomechanical assessment of human movement. The labs have been designed to assist with students' knowledge and understanding of the material discussed in the KIN 121 lectures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PHYS 111, KIN 104L; MATH 124 or MATH 127",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN140L",
            "Name": "Sports Injury Management Laboratory",
            "Desc": "This lab provides exposure and practical training in the management of injuries in an athletic population. Techniques include musculoskeletal assessment, emergency care and management, taping and splinting supports, heating, icing, stretching, and manual therapy skills. ",
            "Notes": "[Note: Current first aid and CPR certification required.]",
            "Consent": "None",
            "Prereqs": "Prereq: Year 1 or 2 Kinesiology students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN146",
            "Name": "Introduction to Human Nutrition",
            "Desc": "An introductory course on human nutrition. Students will be introduced to core topics in nutrition including function of nutrients, nutrient requirements, diet assessment and planning, food composition and the complex interrelationships between food, nutrition, and health. Factors that affect the human diet such as biology, psychology, sociology, environment and political policy will also be examined, as well as key areas of nutrition focus for life stage groups.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN202",
            "Name": "Exercise Physiology and Metabolism",
            "Desc": "This course is designed to provide students with a molecular, cellular, and systems level understanding of the physiological and metabolic responses to different types and intensities of exercise. Physiological and metabolic adaptations to different types of chronic exercise, such as endurance, high-intensity interval, and resistance training, will also be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273.",
            "Coreqs": " Coreq: KIN 202L (for Kinesiology Majors only)",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN202L",
            "Name": "Exercise Physiology and Metabolism Laboratory",
            "Desc": "This laboratory course provides students with some of the practical tools used to assess the body's integrated physiological and metabolic response to exercise. The labs have been designed to assist with students' knowledge and understanding of material discussed in the KIN 202 lectures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273, KIN 104L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN204",
            "Name": "Movement Assessment and Exercise Prescription",
            "Desc": "This course is designed to provide students with an understanding of movement competency and performance enhancement of apparently healthy individuals. The breadth of tests and assessment tools to determine capabilities with respect to mobility, movement patterns, physical activity, fitness, and lifestyle will be covered in detail and practiced and applied in KIN 204L.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 202, KIN 202L;",
            "Coreqs": " Coreq: KIN 204L",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN204L",
            "Name": "Movement Assessment and Exercise Prescription Laboratory",
            "Desc": "This laboratory course provides the student with some of the practical tools used in movement assessment and exercise prescription. The labs have been designed to develop students' practical skills and understanding of material discussed in the KIN 204 lectures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 202, KIN 202L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN217",
            "Name": "Human Biochemistry",
            "Desc": "An elementary course in human biochemistry including the metabolism and function of proteins, carbohydrates, lipids, enzymatic function, energy metabolism, and introductory genetics. Emphasis is placed on clinical and medical applications.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CHEM 120 or 121; Kinesiology, Health Sciences or Honours Science students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN221",
            "Name": "Advanced Biomechanics of Human Movement",
            "Desc": "The course is structured to introduce measurement, analytical, and computation techniques involving multi-segmental, dynamic analysis of human activity. Examples of human activity in occupational, clinical, and leisure settings from the perspectives of anthropometry, kinematics, kinetics, energetics, muscle mechanics, and electromyography are given. The utility of biomechanical variables in the solution of questions involving human movement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 121, KIN 121L;",
            "Coreqs": " Coreq: KIN 221L",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN221L",
            "Name": "Advanced Biomechanics of Human Movement Laboratory",
            "Desc": "This laboratory course provides students with advanced practical tools used in the biomechanical assessment of human movement. The labs have been designed to assist with students' knowledge and understanding of material discussed in the KIN 221 lectures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 121, KIN 121L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN232",
            "Name": "Research Design and Statistics",
            "Desc": "An introduction to research design, statistical analysis, and their application to kinesiology and clinical health practice. A primary focus is to provide students with the tools to critically evaluate sources of information pertinent to their chosen profession.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 104",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN255",
            "Name": "Fundamentals of Neuroscience",
            "Desc": "An introduction to the principles of the nervous system control of movement, cognition, and learning. The course will introduce the basic structure and function of the nervous system as it relates to understanding the control of movement and behaviour. The course will provide a foundation for understanding the neural mechanisms of learning, recovery from injury to the nervous system, and the factors that determine skilled performance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273, PSYCH 101.",
            "Coreqs": " Coreq: KIN 255L (for Kinesiology Majors only)",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN255L",
            "Name": "Fundamentals of Neuroscience Laboratory",
            "Desc": "This laboratory course provides students with practical tools to assess the nervous system control of movement, cognition, and learning. The labs have been designed to assist with students' knowledge and understanding of the material discussed in the KIN 255 lectures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273, PSYCH 101, KIN 104L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN301",
            "Name": "Human Anatomy of the Central Nervous System",
            "Desc": "Functionally-oriented anatomy of the brain, spinal cord, cranial nerves, and the tissues they innervate using pre-dissected cadavers. Major functional systems, including somatosensory and motor pathways, special sense pathways, and integrative systems of the brain, will be examined through an understanding of anatomical connectivity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 100, KIN 100L or BIOL 201/301",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN307",
            "Name": "Methods in Biochemical and Physiological Research",
            "Desc": "An introduction to biochemical and physiological methods used by physiologists in clinical and physiological assessment. These methods include spectrophometric and fluorometric techniques, tissue and blood sampling, cell culture techniques, DNA separation and staining, Western blotting, chromatography, cardiovascular imaging, and body composition imaging and analysis. The course combines lecture and laboratories to illustrate the theoretical and practical aspects of these analytical techniques.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 202, KIN 202L, KIN 217; Honours Kinesiology students.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN308",
            "Name": "Cardiovascular and Pulmonary Physiology",
            "Desc": "This course will provide an advanced understanding of heart, lung, blood vessels, and airway physiology. Examples of pathology and exercise will be used to reinforce basic physiological function. Contemporary research that spans from cell to organ to the integrated system level will be used to introduce lecture material.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: KIN 408",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN310",
            "Name": "Development, Aging, and Health",
            "Desc": "The physiology of human growth, development, and aging is examined, with special reference to the influence of diet, environment, exercise, and disease on the normal processes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN312",
            "Name": "Introduction to Neurological Disorders",
            "Desc": "An introduction to selected neurological disorders and their implications for physical activity. The neurological disorders examined include those which accompany neuromuscular and perceptual-motor impairment, intellectual disability, cardiovascular and respiratory disease.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273.",
            "Coreqs": "None",
            "Antireqs": " Antireq: KIN 242",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN320",
            "Name": "Task Analysis",
            "Desc": "Task analysis describes methodologies that can be applied to identify, describe, and analyze how people interact with their environment and with each other. Task analysis includes a broad range of descriptive and analytic techniques from which the practitioner must select the most appropriate one for their purposes and setting. This skills-based course will guide students in learning task analysis methodologies and associated techniques using a combination of didactic, case-study, and experiential learning-based teaching methods. The application of task analysis from the perspective of a Human Factors & Ergonomics (HFE) specialist will be emphasized.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN326",
            "Name": "Forensic Biomechanics",
            "Desc": "This course introduces students to the core concepts of biomechanics as they are used in the context of litigated cases involving personal injury, motor vehicle collisions, and product failure. The focus will be on synthesizing published literature and effective communication, enabling students to convey technical knowledge to a non-technical audience.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN327",
            "Name": "Trauma Biomechanics",
            "Desc": "This course provides students with an understanding of the mechanical behaviour of human tissues, with specific emphasis on the musculoskeletal system. Students will learn how to describe the mechanical properties of specific tissues. Emphasis will be placed on understanding how tissues are structured to meet their functional demands, and how they respond to traumatic, dynamic impact events. In addition, the content will cover engineering interventions to reduce the risk of traumatic injury (e.g., helmets, sporting equipment, transportation safety features such as seat belts and airbags), and orthopaedic devices to treat traumatic injuries, their underlying mechanical properties, and how they interact with biological tissues/systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN340",
            "Name": "Musculoskeletal Injuries in Sport and Activity",
            "Desc": "This course will introduce students to a variety of common orthopedic injuries sustained during sport and activity. Topics covered include the mechanisms of injury, tissue injury biomechanics, pathophysiology, initial assessment, management, and prevention of acute and chronic trauma.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (KIN 100, KIN 100L) or (BIOL 201/301); Level at least 3A Faculty of Health students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN342",
            "Name": "Nutrition and Aging",
            "Desc": "This course provides an overview of the nutrition and food-related issues, recommendations and best practices for older adults throughout the continuum of care (community to long-term care). Determinants of food intake are considered with specific focus given to eating environment, psychosocial and physiological changes that influence access, preparation, and consumption of food. Emphasis will be placed on chronic disease prevention, management of nutrition issues, and challenges throughout the continuum of care.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 146",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN343",
            "Name": "Micronutrient Metabolism",
            "Desc": "This course examines the metabolism of vitamins and minerals in the context of normal human development and aging with an emphasis on disease prevention and understanding the pathogenesis of deficiencies and toxicities. The function and role of vitamins and minerals will be discussed in specific groupings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 146; One of KIN 217, CHEM 233, CHEM 237",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "KIN346",
            "Name": "Human Nutrition and Metabolism",
            "Desc": "This course will examine advanced nutrient metabolism and the interplay between diet, biochemistry, and health and disease outcomes. Challenges in assessing dietary intake and the impact of aging and other behaviours such as exercise on nutritional status will be examined. Approaches used in nutritional research will also be introduced.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 146; One of KIN 217, CHEM 233, CHEM 237",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN351",
            "Name": "Therapeutic Rehabilitation of Orthopedic Injuries",
            "Desc": "This course will develop theoretical knowledge and practical skills in the rehabilitation of orthopedic injuries. The course will build upon knowledge related to orthopedic injuries gained in core and elective courses. The focus will be on a population that was active and healthy prior to injury.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 204, 204L, 340",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN352",
            "Name": "Sociology of Aging",
            "Desc": "An introduction to individual and population aging. Topics discussed include: aging from a historical and comparative perspective; aging in subcultures; aging and the social structure; aging and social processes; aging and the environment; work and retirement; and aging and leisure patterns.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R or AHS/HEALTH 107 or GSJ 101 or GSJ 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN354",
            "Name": "Psychology of Physical Activity",
            "Desc": "This course will provide an overview of the field of sport and exercise psychology and examine how various factors impact our interest, passion, and commitment to sport, exercise, and physical activity. Topics include personality, motivation, team dynamics, coaching psychology, interventions, aggression, body image, and youth development through sport.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 101/101R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN356",
            "Name": "Sensory Systems Neuroscience",
            "Desc": "This course will examine how different regions of the nervous system interact to shape our perception, decisions, memories, movements, and consciousness. The focus will be placed on the role of the sensory systems in transducing external stimuli into neural activity, how sensory information is processed within and across sensory modalities (i.e., multisensory integration), and the implications for nervous system function. Topics will be considered from developmental, injury, disease, and aging perspectives.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 255 or PSYCH 261",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN357",
            "Name": "Motor Learning and Neuroplasticity",
            "Desc": "This course will examine the neural control of movement and how experience shapes brain reorganization to support skilled motor ability. Evidence from behavioural and neuroimaging studies will be considered with an emphasis on leveraging principles of motor learning to skill acquisition and skilled performance in sport/occupational environments and the rehabilitation of movement disorders/injuries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 255",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN359",
            "Name": "Cognition, Cognitive Dysfunction, and Movement",
            "Desc": "This course provides a comprehensive introduction to neuropsychology, with emphasis on the implication for movement and discussion of how neurological disorders reflect disturbances at different stages in the sequence of information processing.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 255 or PSYCH 306.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSYCH 307, KIN 456",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN360",
            "Name": "Concussion",
            "Desc": "This course will provide students a comprehensive exploration of concussion, a mild traumatic brain injury. From mechanisms of injury to long-term consequences of concussion, students will gain knowledge in recognition, evaluation, and rehabilitation techniques related to concussion.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 255 or PSYCH 261",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "KIN391",
            "Name": "Research Apprenticeship",
            "Desc": "This course provides an opportunity to learn how research is done by working in the research program of a faculty member. The apprenticeship involves unpaid participation for no more than 6-8 hours per week for at least 12 weeks of the term. Detailed requirements and application forms for this course are available at the Kinesiology Undergraduate Office. A student may enrol only once in KIN 391. This course is graded as credit/no credit.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Kinesiology students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN400",
            "Name": "Athletic Injury Practicum",
            "Desc": "This course will provide students with practical experience in the evaluation, management, and rehabilitation of athletic injuries. Students will participate in weekly tutorials to develop and refine their assessment and manual therapy skills, injury knowledge, and rehabilitation techniques. Practical experience will be obtained through placement with a University of Waterloo varsity team.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Kinesiology students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN402",
            "Name": "Environmental Physiology",
            "Desc": "This course will examine the human cardiorespiratory and metabolic responses at rest and during exercise in altered gravitational, thermal, humidity, and barometric environments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 308/408",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN403",
            "Name": "Occupational Physiology",
            "Desc": "This course will provide an analysis of the physiological demands of professions and associated work-place tasks. Emphasis will be placed on how an individual's physiological potential might be influenced by the environment and specific task demands with implications for fatigue and/or injury.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 202; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN404",
            "Name": "Physiology of Obesity and Type 2 Diabetes",
            "Desc": "This course will examine the environmental and physiological aspects of obesity and Type 2 Diabetes, emphasizing the molecular pathways involved in energy balance regulation. Topics to be covered include the epidemiology of obesity and Type 2 Diabetes, regulation of energy intake (appetite), energy storage and energy expenditure, and the role of physical inactivity and activity in the causes and prevention of obesity and Type 2 Diabetes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN406",
            "Name": "Physiology of Muscle Aging and Disease",
            "Desc": "This course will examine the cellular and molecular adaptations that occur in skeletal muscle during aging and disease. Topics to be covered include skeletal muscle satellite cells/stem cells, apoptosis and necrosis, mitochondrial dysfunction, oxidative stress, and inflammation. The influence of physical activity on these biological processes and in the prevention and treatment of skeletal disorders will also be discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 130 or BME 285; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN407",
            "Name": "Cardiovascular Pathophysiology",
            "Desc": "This course explores the pathophysiology, electrophysiology, risk factors, and assessment and rehabilitation options related to cardiovascular diseases. Emphasis is placed on the utility of exercise in the assessment and rehabilitation of primary and secondary cardiovascular disease.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 308/408; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN414",
            "Name": "Clinical Exercise Physiology",
            "Desc": "This course will utilize cases, assignments, guest lecturers, and readings to guide discussion and learning. Students will learn how impairments or secondary complications associated with chronic conditions influence decision-making in clinical exercise physiology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 204, KIN 204L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN415",
            "Name": "Clinical Neurophysiology",
            "Desc": "This course explores current clinical neurophysiological concepts important for the control of human movement as well as current techniques used in clinical neurophysiology. Emphasis is placed on the origin of bioelectrical activity underlying human movement and the application to the diagnosis of movement pathology following nervous system injury.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273 or PSYCH 261; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN416",
            "Name": "Neuromuscular Integration",
            "Desc": "An examination of the neural processes involved in the maintenance of posture and the control of movement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273 or PSYCH 261; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN418",
            "Name": "Physical Activity and Aging",
            "Desc": "This course will discuss common physical, mental, and social changes with aging, and the implications of physical activity on these changes. Students will understand and evaluate the barriers to physical activity among older adults and develop strategies to improve physical activity participation at the individual, community, and population level.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BIOL 273; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN420",
            "Name": "Occupational Biomechanics",
            "Desc": "A course designed to provide the student with knowledge to reduce the risk of injury and increase worker productivity. Issues include identification of injury risk factors, understanding injury mechanism, quantitative assessment of injury risk and intervention strategies to reduce the risk of injury. Specific examples include the use of computerized models and EMG methods to analyze low back loading, optimizing tool design and workspace layout and the examination of related issues such as office seating and vibration.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 320",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN422",
            "Name": "Human Posture, Balance and Gait",
            "Desc": "This course will provide a detailed understanding of the kinematics, kinetics, and neural control of standing posture, stepping, walking, and running. Measurement techniques and the interpretation of movement data will be emphasized from biomechanical and neural control perspectives. Applications to aging and pathology will be emphasized.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN425",
            "Name": "Biomechanical Modelling",
            "Desc": "This course will examine the quantitative measurement and analysis of the human musculoskeletal system. Multi-segment dynamic movements will be studied using computer programs, with emphasis on kinematics, kinetics and energetics, as well as the use of EMG in the assessment of the control of the movement. Examples are presented from pathological, normal, and athletic movement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN427",
            "Name": "Low Back Disorders",
            "Desc": "This course will consider the multidisciplinary issues (psychosocial, behavioural, physiological, motor control, biomechanical, and legislative) related to low back disorders. A solid scientific foundation is developed from the study of anatomy, normal function, and injury mechanics. This foundation is used to substantiate the best strategies for injury prevention and optimal rehabilitation for those with low back disorders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN428",
            "Name": "Upper Extremity Disorders",
            "Desc": "This course introduces the multiple factors that mediate the initiation, diagnosis, treatment, and rehabilitation of disorders in the upper extremities. Beginning with a systematic review of hand, wrist, elbow, and shoulder region functional anatomy, a knowledge base is developed to provide a means for the analysis of injury mechanisms. Current prevention, clinical diagnosis, and rehabilitation techniques for specific disorders will be examined, including carpal tunnel syndrome, rotator cuff tears, and lateral epicondylitis. Pathologies arising from occupational, sport, and daily living activities will be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 221, 221L",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN429",
            "Name": "Bone and Joint Health",
            "Desc": "The overall aim is to provide a comprehensive understanding of human bone and cartilage in health and disease. Specific topics covered include: skeletal physiology, bone and cartilage growth and development, prevalence and etiology of several bone and joint conditions (e.g., osteoporosis, arthritis), clinical evaluation, diagnosis and treatment of bone and joint conditions, and the roles of nutrition and exercise in the prevention and treatment of bone and joint disease. The course will incorporate current issues, problem-based learning, research skills, and student-led seminars in addition to the lecture-based framework.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 100, KIN 100L or BIOL 201/301; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN431",
            "Name": "Research Proposal",
            "Desc": "An independent paper in the form of a research proposal on an approved topic. The topic may include survey, field, laboratory, theoretical, or applied research, program evaluation, mathematical modelling, fitness appraisal, etc. The format is to be determined with the supervisor and may be in chapters or in journal style.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Kinesiology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN432",
            "Name": "Research Project",
            "Desc": "An independent research project on an approved topic, supervised by a faculty member. This is the completion of the research proposed in KIN 431. The format is to be determined with the supervisor and may be in chapters or in journal style.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN433",
            "Name": "Senior Essay",
            "Desc": "An extensive critical review of the literature on an approved topic, supervised by a faculty member. The topics will be broader in scope than those associated with specific research proposals.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Kinesiology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN446",
            "Name": "Physiological and Biochemical Aspects of Nutrition and Health",
            "Desc": "Selected examples of nutrient metabolism will be examined in detail in regard to dietary intake, metabolism, and mechanistic effects on human health. Comprehensive coverage of all nutrients is not intended, but rather the examples will be examined in detail with a focus on research techniques and approaches, and various factors that interact with and influence nutrition.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 146; One of KIN 217, CHEM 233, CHEM 237; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN453",
            "Name": "Applied Sport Psychology",
            "Desc": "An examination of the methods and techniques for developing psychological skills to enhance performance and personal growth. Focus will be on learning strategies to increase the ability to self-regulate and influence others' behaviour and improve performance. Topics may include confidence, mental toughness, imagery, concentration, and attention.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 354",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN455",
            "Name": "Brain and Behavioural Development",
            "Desc": "This course focuses on the neurobiological basis underlying brain and behaviour development from conception to adolescence. The emergence of neural functions and corresponding behaviours will be discussed in the context of a complex interaction between genes and environment. Topics include molecular/genetic perspectives, epigenetics, critical periods of cortical development, plasticity, sensorimotor and cognitive development. The course focuses on typical development, but conditions that induce abnormal brain development will be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 255",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN459",
            "Name": "Cognitive, Emotional and Motor Assessment",
            "Desc": "This course is designed to provide the student with an introduction to the principles underlying the assessment of cognitive, emotional, and motor functions. Measurement issues associated with test development and use, factors involved in the administration and interpretation of test results, and methods of report writing will be examined. Students will learn to administer a number of test instruments used in the assessment of cognitive, emotional, and motor functions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 456/359.",
            "Coreqs": "None",
            "Antireqs": " Antireq: KIN 457",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN464",
            "Name": "Psychology of Injury and Rehabilitation",
            "Desc": "This course will examine the psychological theories and models related to injuries (in sport, work/labour, and clinical populations) and the ensuing rehabilitation of the injuries. Emphasis will be placed on the psychological antecedents to injury and factors related to the psychological experience and treatment of injured individuals and individuals in transition from injury to returning to play or returning to the workforce. The course will also discuss the importance of communication in the injury management process (e.g., with physicians, specialists, coaches, supervisors, managers) and identifying symptoms to refer individuals to professional psychological services.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 354 or Level at least 3A Psychology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN470",
            "Name": "Seminar in Kinesiology",
            "Desc": "An examination of current major issues and trends in Kinesiology. Students select areas of major interest from a series of faculty introduced topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Kinesiology",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN471",
            "Name": "Contemporary Issues in Kinesiology",
            "Desc": "One or more term courses will be offered from time to time as announced by the Kinesiology Department. Subjects will be dependent upon special research and/or instructional interests of faculty.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Kinesiology students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN472",
            "Name": "Directed Study in Special Topics",
            "Desc": "For the student who desires to pursue a particular topic in depth through guided independent research and/or reading. A faculty member must approve a student's project prior to registration. ",
            "Notes": "[Note: May be repeated in subsequent terms.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN491",
            "Name": "Clinical Kinesiology -- Sports Injuries Assessment",
            "Desc": "Practical experience in the examination, diagnosis, and treatment of sports injuries under the supervision of a Certified Athletic Therapist. Case presentations and musculoskeletal assessments are discussed in a group setting.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: KIN 340; Kinesiology students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN492",
            "Name": "Exercise Management for Chronic Conditions",
            "Desc": "This practicum provides students with the opportunity to gain hands-on experience in the field of clinical exercise physiology and to link concepts and theory to real-world experiences. Practical skills are gained within a laboratory setting and through placement with the Center for Community Clinical and Applied Research Excellence (CCCARE) chronic disease programs. Skills are developed to a competency level required for certification as a Clinical Exercise Physiologist, with major emphasis placed on the cardiorespiratory and neuromuscular implications of exercise assessment, prescription, and management of chronic health conditions.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: KIN 204, KIN 204L, KIN 407.",
            "Coreqs": "None",
            "Antireqs": " Antireq: KIN 492A, KIN 492B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "KIN493",
            "Name": "Clinical Kinesiology: Movement Assessment Practicum",
            "Desc": "Practical experience in movement assessment of persons from various special populations such as the normal elderly and those with neurological, degenerative, or developmental disorders. Motor functions involving gait, posture, and balance or upper-limb movements will typically be examined in these assessments.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: KIN 242/312, 456/359, 416, 422; Cumulative overall average at least 75%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}