{
    "Name": "legalstudies",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "LS101",
            "Name": "Introduction to Legal Studies",
            "Desc": "An introduction to the study of law, its structure, and legal institutions from a cross-cultural and historical perspective. This interdisciplinary course examines the origins of legal systems and their impact on society. Included is an analysis of the diverse historical, political, economic, and cultural conditions under which law arises and functions within society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS201",
            "Name": "Women and the Law",
            "Desc": "This course provides an introduction to feminist legal thought with a particular focus on Canadian cases, legislation, law reform, and legal literature. Included is an analysis of the ways in which law contributes to women's legal, social, political, and economic status as well as the manner in which the law is used as a mechanism of social change for women. The intersection of gender with age, race, ethnicity, religion, and class will be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 206",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS202",
            "Name": "Criminal Law",
            "Desc": "A case-study approach to the study of criminal law in Canada with a focus on basic concepts and core principles relating to legal judgements along with comparative examination between civil and criminal law and attention to legal theory. ",
            "Notes": "[Note: Formerly LS 102.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 102",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS203",
            "Name": "Special Topics in Legal Studies",
            "Desc": "An in-depth analysis of research in selected topics in Legal Studies. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS206",
            "Name": "Canadian Government & Politics",
            "Desc": "An examination of Canada's federal system, parliamentary government, and national political processes, such as the party system, interest groups, the electoral system, and voting behavior.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 110",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS213",
            "Name": "Surveillance Studies",
            "Desc": "An introduction to the central role of surveillance in shaping power relations and knowledge across a range of social and cultural contexts. Foundational historical, theoretical, and empirical texts that define the field of surveillance studies will be explored.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R or LS 101; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 203 LEC 001 winter 2020, LEC 041 fall 2020, LEC 001 fall 2021; SOC 230 LEC 001 winter 2020, fall 2020, fall 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS221",
            "Name": "Research Methods",
            "Desc": "An introductory survey of the research techniques commonly employed by sociologists, criminologists, and legal studies researchers. The formulation of research designs appropriate to various kinds of intellectual problems in social science is stressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of LS 101, SOC 101/101R; Level at least 2A; Not open to students in the Faculty of Mathematics.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS/SDS 251R, KIN 330, PSYCH 291, REC 270, SOC 321/LS 321, SMF 220, SWREN 251R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS222",
            "Name": "Juvenile Delinquency",
            "Desc": "A systematic analysis and criticism is presented of biological, psychological, psychoanalytical, and sociological theories of juvenile delinquency. Attention is given to statistics and contemporary research with special emphasis on the distribution and types of delinquent subcultures.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS223",
            "Name": "Deviance: Perspectives and Processes",
            "Desc": "The deviance-making process is examined in a variety of social contexts. This course examines the emergence of rules and control agencies, the processes by which people become involved in deviant activities, and the contingencies affecting their careers as deviants.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS224",
            "Name": "Victims and Society",
            "Desc": "This course will examine the substance of victimization: the scientific study of victims, the process, etiology, and consequences of victimization. Topics will include victims and politics, the victims' movement, victim-precipitation, the victimization of women, and family violence.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS226",
            "Name": "Sociology of Mental Disorder",
            "Desc": "An examination of sociological research and theory in the field of mental disorders particularly as they apply to issues of law and social control. Topics include mental health legislation, the medical model of mental \"illness,\" the epidemiology of mental disorder, family processes and psychiatric hospitalization, public attitudes and social stigma, and specific forms of mental disorder.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS227",
            "Name": "Criminology",
            "Desc": "An examination of the major theories of crime causation and their implications for the development of social policy. Both historical and contemporary theories will be discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS228",
            "Name": "Sociology of Criminal Justice",
            "Desc": "Decisions to process offenders and the role of social factors in the Canadian criminal justice system are critically examined. Focal issues include police discretion, the legal profession, and prison systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS229",
            "Name": "Selected Topics in Criminology",
            "Desc": "Sociological analysis of research and theory on selected criminal activities. Motivation, modus operandi, and the social characteristics of offenders will be examined in relation to such specific crimes as drug and sexual offenses, theft, robbery, murder, organized crime, and/or other criminal activities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS235",
            "Name": "History of Ancient Law",
            "Desc": "A historical introduction to law in the ancient world. Babylonian, Assyrian, Hittite, and Roman law, legal practices, and concepts will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS236",
            "Name": "Law and Society in the Middle Ages",
            "Desc": "A study of the laws and legal procedures of the  Middle Ages. This course examines the relationship between legal procedures and institutions and the medieval societies that produced them.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS237",
            "Name": "Canadian Legal History",
            "Desc": "This course examines the Canadian legal system from colonial times to the present with particular emphasis on such themes as law and the economy, courts and judiciary, the legal profession, family and criminal law, women and the law, and civil liberties.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS240",
            "Name": "Terrorism",
            "Desc": "This course offers an introduction to the study of terrorism, with a primary focus on sociological approaches. The course examines the history, causes, and diversity of forms of terrorist groups and the process of radicalization, suicide terrorism, and some aspects of the counter-terrorism response of states.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS250",
            "Name": "Family Policy and the Law",
            "Desc": "There is a persistent tension in our society about where the responsibility for children lies: with the family or the society. This course examines various topics in Canadian social and family policy that affect children's development and family well-being. Topics may include the legislative provisions in areas such as parenting supports, income security, family law, youth justice, caregiving, and the distinct framework for Indigenous families. Students will use foundational concepts and theories to examine the strengths and limitations of policy to address the needs of families.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS263",
            "Name": "Organized Crime",
            "Desc": "An examination of select criminal organizations in North America. Particular attention will be given to the social history of \"the mafia\" and the development of legal tools for policing criminal organizations. Additional themes for discussion include enterprise and economic crimes, corruption, and the role of women in organized crime.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS271",
            "Name": "Conflict Resolution",
            "Desc": "An examination of the resolution of conflicts, ranging from interpersonal to broader social and international conflicts. Students are introduced to negotiation, mediation, and nonviolent resistance, and are encouraged to develop their own theoretical understandings that aid in addressing conflict.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS272",
            "Name": "Psychology and Law",
            "Desc": "Psychological principles drawn from a variety of subdisciplines (e.g., social, clinical, cognitive) will be surveyed in terms of their relevance and application to the legal system. Topics may include jury selection and decision-making, eyewitness testimony, insanity defense, competency assessment, risk assessment, and attitudes toward law and the legal process.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS273",
            "Name": "Children's Rights in Canada",
            "Desc": "This course examines children's rights from a moral and comparative legal perspective. Students explore the welfare and developmental interests of children; the corresponding duties of parents, custodians, educators, and social workers; and the nature and scope of public educational authority in the common law jurisdictions of Canada.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS280",
            "Name": "Social Statistics",
            "Desc": "A basic course in statistics used in social science research including sampling, central tendency, probability, and covariance, as illustrated in specifically sociological and criminological data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of LS 101, SOC 101/101R; Level at least 2A; Not open to Math students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 280, ECON 221, ENVS 278, ISS 250A/B, ISS/SDS 250R, KIN 222, PSCI 314, PSYCH 292, REC 371, SMF230, STAT202, 206, 211, 221, 231, 241, SWREN250A/B, 250R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS283",
            "Name": "Business Law",
            "Desc": "Particular attention is given to the law relating to contracts and business organizations. Other areas of study include sources of law, the judicial process, real and personal property, torts, agency, credit, and negotiable instruments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Accounting and Financial Management,\nMathematics/Chartered Professional Accountancy or Biotechnology/Chartered Professional Accountancy students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 335, MTHEL 100/COMM 231,\nBUS 231W, CIVE 491, GENE 411, ME 401",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS286",
            "Name": "Law in Popular Culture",
            "Desc": "Much is at stake in how law is portrayed in paintings, literature, music, television, and movies. In this course students will draw on a range of disciplines in the social sciences and humanities to study how law is represented in popular culture, and how these representations, in turn, impact how we view law.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS291",
            "Name": "Legal Writing",
            "Desc": "A study of the principles, processes, and various forms of writing used in the practice of law and drafting of legislation.  The history and structure of legal writing, including current debates about plain language, will be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS292",
            "Name": "Literature and the Law",
            "Desc": "A study of literary works that involve legal matters and/or have led to litigation on such grounds as obscenity, treason, heresy, libel, and plagiarism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS300",
            "Name": "Sociology of Law",
            "Desc": "This course examines the social construction of law and its administration as a social process. Topics will include law as an instrument of social control and social change, legal culture, the identification and evaluation of criminal suspects, the trial process and the rights of special groups. The specific laws highlighted will vary.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS305",
            "Name": "Socio-Legal Approaches to Privacy in Contemporary Contexts",
            "Desc": "An introduction to privacy as a socio-legal concept and to major debates surrounding privacy in contemporary contexts. National and international frameworks for the regulation of privacy will be examined and may include analysis of major cases in privacy law.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R or LS 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS306",
            "Name": "Juvenile Justice",
            "Desc": "An examination of theories of juvenile justice, juvenile law, and the structure and operations of juvenile systems, especially in Canada.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS/SOC 222.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SOC 226",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS315",
            "Name": "Labour Law",
            "Desc": "Students will be introduced to core concepts in labour law such as the common law employment contract, the regulatory regime of employment, and collective bargaining. The course will also introduce students to issues in contemporary work such as the rise of non-standard labour arrangements, precarious work, and transnational labour. Students will be encouraged and challenged to think critically about the interdisciplinary nature, and limitations, of labour law. In lecture and discussion components, students will be invited to engage with scholarly legal literature as well as with their peers, who will have diverse experiences with, and/or expectations of, work and employment. Written assessments will develop students' communication skills, in both practical case-law application and critical thinking.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 330 001 taken in winter 2022",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS319",
            "Name": "Negotiation: Theories and Strategies",
            "Desc": "This course explores different ways of negotiating between people and groups with conflicting interests. Students will learn the theory behind the strategies and develop practical negotiation skills you can put to use in your daily life at home, at work, and in the community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PSYCH 439",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS322",
            "Name": "Field Research Methods",
            "Desc": "This course provides a critical evaluation of research techniques in sociology, criminology, and legal studies with an emphasis on learning and applying qualitative fieldwork approaches.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 221/LS 221; Not open to Mathematics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SDS 351R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS325",
            "Name": "Sexuality and the Law",
            "Desc": "Despite the commonly held belief that sexuality is nothing more than \"doing what comes naturally,\" cultural definitions, including prohibitions against specific forms of conduct, impinge upon the most private or intimate of acts. This course examines the social construction and control of sexuality through law.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS326",
            "Name": "Punishment and Society",
            "Desc": "A critical criminological and sociological examination of theories and practices of punishment. This course will examine transformations in penal theory, penal management, and penal institutions and their social and policy implications.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS327",
            "Name": "Policing in a Democratic Society",
            "Desc": "A critical examination of the police as social control agents in contemporary democratic societies. Topics include the historical evolution of policing; police recruitment, training, and education; police/community relations; the occupational subculture of the police; police authority and discretion; private policing; and police deviance and criminality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SOC/LS 227, SOC/LS 228, or SOC/LS 229",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS328",
            "Name": "Trafficking and Financial Crime",
            "Desc": "An examination of the causes and impact of the illegal traffic in goods and services in Canada and internationally. Topics may include human trafficking, trade in illicit drugs and weapons, money laundering and financing of terror, and the relationship between trafficking and state political violence.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "LS329",
            "Name": "Security and Governance",
            "Desc": "The course examines the relationship between the framing of (in)security and policing as a dominant approach to govern risk in our modern era. Topics may include the policing of political protest, the Anthropocene, and the Internet. Students will analyze what's at stake with the diffusion of security in social life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 330 LEC 001 taken winter 2020, SOC 330 LEC 001 taken winter 2020",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS330",
            "Name": "Special Topics in Legal Studies",
            "Desc": "An in-depth analysis of research in selected topics in Legal Studies. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS331",
            "Name": "Human Rights in Historical Perspective",
            "Desc": "A detailed analysis of selected topics in the history of human rights. Special attention will be paid to revolutionary developments since World War II, and to the emergence of modern human rights policies. Topics will be examined through assigned readings, lectures, and films.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS342",
            "Name": "Migration and Legality",
            "Desc": "This course introduces students to key concepts and case study research on the regulation of human migration and its exclusionary practices. It examines how state policies, laws, and international organizations control the mobility of migrants and refugees across regions and borders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS344",
            "Name": "Restorative Justice",
            "Desc": "This course investigates the history, theory, principles, practices, and people of restorative justice. Content will centre particularly on restorative justice as a way of dealing with crime and interpersonal violence in the Canadian context.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS350",
            "Name": "Love and the Law",
            "Desc": "Relationship breakdown is a social phenomenon that can have legal consequences. This course provides students with a socio-legal foundation in current family law. Topics may include the court system, the litigation process, property division, spousal and child support, child co-parenting, child protection, high conflict families, and alternative dispute resolution processes. Students will learn about the strengths and limitation of the law to address relationship breakdown and develop transferable skills for careers in policy, social work, mediation, family justice, education, and community service organizations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Any 200-level LS or SMF course; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS351",
            "Name": "Philosophy of Law",
            "Desc": "Basic themes in the philosophy of law. Issues include the nature of law and its relation to morality and politics, legal reasoning, the justification of punishment, and theories of rights, responsibility, and liability.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS352",
            "Name": "Human Rights",
            "Desc": "What are human rights? Which do we have, and why? What are the practical implications of human rights, for both individuals and institutions? A comprehensive discussion of theory and history, of law and morality, and of national and international applications.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS363",
            "Name": "Canadian Constitutional Law",
            "Desc": "An introduction to the nature and basic principles of constitutional law. Explores constitutional conventions, the distribution of powers in the Canadian federalism, Aboriginal and treaty rights, and the Charter of Rights and Freedoms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101 or LS 206/ PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS365",
            "Name": "Transnational Migration",
            "Desc": "This survey of transnational migration in the contemporary moment examines the reasons people have migrated voluntarily (e.g., as migrant workers) and involuntarily (e.g., as refugees), and how international and domestic law and policies affect, enable, and/or criminalize the movements of people across state borders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 250, 252, 255, 259, 264, 281, LS 206/PSCI 260; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS366",
            "Name": "Global Governance",
            "Desc": "Global governance is governing beyond the state.  An examination of diverse problems - global warming, international human rights, terrorism, property rights disputes, and health crises - which transcend borders and demand cooperative global solutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS372",
            "Name": "Criminal Profiling",
            "Desc": "Foundational assumptions for, and basic approaches to, criminal profiling will be considered, along with a survey of relevant techniques in the context of numerous case studies. Limitations and alternatives to profiling will also be addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 230/LS 272",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS373",
            "Name": "Indigenous Peoples and Canadian Public Policy",
            "Desc": "Framed within the Truth and Reconciliation process underway in Canada, this course examines the historical and ongoing colonial processes and impacts of government policies targeting First Nations, Inuit, and Métis peoples. Particular analysis will be given to government policy as a cause of (and response to) social, political, and economic problems experienced by Indigenous peoples in Canada. ",
            "Notes": "[Note: SWREN 311R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS374",
            "Name": "The Evolution of Family Law in Canadian Society",
            "Desc": "This course examines the evolution of family law in Indigenous, francophone, anglophone, and other communities in Canada. Taking an interdisciplinary approach, the course not only explores the demographic, economic, social, and political contexts in which family law developed but also assesses its significance for Canadian society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS386",
            "Name": "Law and Violence",
            "Desc": "Discussions about law's coercive power raise important questions about the legitimacy of state-sanctioned violence. This course uncovers the roots and limits of law's power as it relates to questions of violence, obedience, and dissent.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS387",
            "Name": "Criminal Justice Institutions",
            "Desc": "The societal context of policing, courts, and corrections is examined to understand how social control and the law are used in the criminal justice system. Special emphasis is placed on the socio-economic, legal, political, and situational environment that shapes responses to different categories of offenders and offences.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS401",
            "Name": "Law, Culture, and Rights",
            "Desc": "This seminar explores the intersection of culture and rights from a legal studies perspective in order to better understand the diversity of ways that law shapes our society, and vice versa. Students will debate and assess selected topics from the perspective of various disciplines spanning the social sciences and humanities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS402",
            "Name": "Perspectives on Legal Authority and Subjectivity",
            "Desc": "This seminar explores the relation between those who make or administer law and select legal subjects whose lives and identities are shaped by law. Students will debate and assess selected perspectives while touching on various disciplines spanning the social sciences and humanities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS403",
            "Name": "Socio-Legal Responses to Crime",
            "Desc": "This course examines responses to crime from historical, philosophical, legal, psychological, sociological, and other related perspectives. The primary focus is on the relationship between the law, motivations of offenders, and responses by individuals and the criminal justice system to chronic, sex, and violent offenders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS404",
            "Name": "Law of the Environment",
            "Desc": "This seminar questions where, and why, the lines are drawn between environment, ecology, politics, economics, and law. Students debate and assess selected topics in Canadian and international environmental law to critically consider the significance of \"law of the environment\" as our world navigates crises of climate and change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies majors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 496 Section 044 taken in fall 2020; LS 496 Section 004 taken in winter 2022",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS405",
            "Name": "Democracy, Revolution, Law",
            "Desc": "This course examines the theory and practice of revolution from a range of\nsocial, political, and legal perspectives. Students will study different historical\nand contemporary instances of revolution and democracy with a focus on such\nconcepts as citizenship, nationalism, liberation, and criminality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS413",
            "Name": "Surveillance and Society",
            "Desc": "An examination of the way monitoring technologies alter and shape social life in terms of security, fear, control, and vulnerability.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS419",
            "Name": "Police Systems and Practices",
            "Desc": "This course examines contemporary issues in policing. Topics may include police response strategies in different models of policing, economics of policing, use of discretion, police accountability, and the changing functions and activities of the police.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS422",
            "Name": "Violent Extremism and Terrorism",
            "Desc": "This course examines contemporary issues in terrorism studies. Topics may include the history and comparative analysis of political and religious forms of violent extremism, the process of radicalization and recruitment, the analysis of different forms of terrorist activity, and the counter-terrorism policies and practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS423",
            "Name": "Peers and Crime",
            "Desc": "This seminar examines the peer influence perspective in criminology. Key theoretical, methodological, and substantive issues and challenges are addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS425",
            "Name": "Crossing Borders: Law and Global Deviance",
            "Desc": "This seminar-style course, positioned at the intersection of sociology and law, examines illicit cross border activity such as terrorism, piracy, drugs, trafficking, and illegal immigration. Each cross-border activity will be examined, along with the way states respond to it politically and legally at a national and international level. Ethnographic research on the activity will provide for rich descriptions of how and why people participate in such activities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS426",
            "Name": "Criminology of Mobility",
            "Desc": "This course offers a critical exploration of the growing nexus of crime control and the control of human mobility under conditions of mass migration and globalization, focusing on the developing area of study called the criminology of mobility (or border criminology). Students will develop an awareness of the social, cultural, and political diversity of law and mechanisms of social control that structure human mobility while paying attention to issues of race, gender, class, and other social relations of power in this field. Students will also develop their oral, written, and digital skills to communicate their ideas about course content through critical assessment of current research.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 496 001, SOC 430 001 taken fall 2019; LS 496 042, SOC 430 042 taken fall 2020; LS 496 041, SOC 430 041 taken spring 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS428",
            "Name": "Sentencing as a Social Process",
            "Desc": "This course examines in depth the process and results of criminal sentencing. Topics include types of sentences for criminal and quasi-criminal offences, objectives of sentences, factors affecting sentences, the process of sentencing, the administration and effectiveness of sentences, and unresolved debates in sentencing.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS431",
            "Name": "Corporate Governance",
            "Desc": "Corporations adopt different internal regulations depending on geography, size, industry, legal jurisdiction, political climate, and historical context. In this course each of these factors is examined in order to understand the evolution of corporate governance. This framework prepares students for a critical assessment of the main theories of corporate governance, while a comparative approach invites debate about corporate legal obligations and social responsibilities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS433",
            "Name": "Crime, Law, and Technoscience",
            "Desc": "A critical examination of science and technology in law and criminal justice. Focus will be on topics such as the histories, politics, and cultural representations of forensic sciences and technologies used in evidence collection, surveillance, policing, criminal courts, and incarceration.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS434",
            "Name": "Sociology of At-Risk Youth",
            "Desc": "This course examines the social attributes and surrounding conditions associated with at-risk youth. It will focus on the development of youth in three major institutions - education, criminal justice, and mental healthcare. This course will focus on the attributes of youth themselves, but also to changing institutional definitions and practices. This course may include an experiential learning component outside regular classroom hours.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS435",
            "Name": "Cybercrime and Digital Harm",
            "Desc": "An examination of theoretical perspectives and empirical developments surrounding cybercrime, digitally-mediated harms, and associated regulatory responses. A range of topics may be explored, including hacking, technology facilitated abuse, (dis)information, censorship, human rights, and cybersecurity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 496 SEM 041 fall 2020, fall 2021; SOC 430 SEM 041 fall 2020, fall 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS461",
            "Name": "Transnational Organized Crime",
            "Desc": "This seminar course examines contemporary legal regimes surrounding transnational organized crime, terrorism and organized crime, and international money laundering.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Legal Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS462",
            "Name": "Indigenous Political Theory",
            "Desc": "In this course students will develop familiarity with key concepts such as dispossession, elimination, and the politics of refusal, and situate them in a context of differing ideas regarding authority and contrasting legal orders. The role of these concepts in the political thought of Indigenous peoples and movements will be critically assessed. Students will demonstrate their learning through both oral and written assignments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS463",
            "Name": "Rights and Public Policy",
            "Desc": "An examination of the role that rights and rights discourse plays in public policy development and policy change. Examines Canadian public policy in relation to the Charter of Rights and Freedoms and human rights legislation, as well as cases in comparative context.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101 or LS 206/ PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS464",
            "Name": "Justice and Gender",
            "Desc": "Theories of justice are concerned with the distribution of the basic goods of society - money, power, status, leisure, and so on. This course considers how the gender system fares from the standpoint of liberal justice, and to what extent the promises of liberal justice can be used to overturn the unequal treatment of women.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of LS 201, PSCI 225/CLAS 225, PSCI 226, 291, 292, 370; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS471",
            "Name": "Communication, Resistance, and Social Change",
            "Desc": "This course explores the function of communication in advocating for and generating social change, mostly through practices of resistance, protest, and other forms of dissent and collective action. Students will consider how the broader assemblage of media, social, and civic institutions resist change, and will imagine how communication might be used effectively to challenge the status quo.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS492",
            "Name": "Communication and Social Justice",
            "Desc": "An examination of how communication on the part of individuals, groups, and institutions implicates social justice. Students examine the relationship between communication and justice to understand how the representation and performance of gender, race, ethnicity, and other cultural constructs contribute to social and political conditions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS496",
            "Name": "Special Topics in Legal Studies",
            "Desc": "This course will deal with selected topics in legal studies. Subjects will be dependent upon the research and/or instructional interests of faculty. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "LS498",
            "Name": "Directed Readings in Legal Studies",
            "Desc": "Selected study and assignments under the direction of a faculty member who teaches courses in legal studies and criminology. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}