{
    "Name": "mathematics",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "MATH52",
            "Name": "Pre-University Calculus",
            "Desc": "The concepts included are limits, derivatives, antiderivatives and definite integrals.  These concepts will be applied to solve problems of rates of change, maximum and minimum, curve sketching and areas. The classes of functions used to develop these concepts and applications are: polynomial, rational, trigonometric, exponential, and logarithmic.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH97",
            "Name": "Study Abroad",
            "Desc": "For studies at other universities under approved exchange agreements.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH103",
            "Name": "Introductory Algebra for Arts and Social Science",
            "Desc": "An introduction to applications of algebra to business, the behavioural sciences, and the social sciences. Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Open only to students in the following faculties: ARTS, AHS or ENV. Not open to Acc'ting & Fin Mgt students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 115, 136, 146, NE 112",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH104",
            "Name": "Introductory Calculus for Arts and Social Science",
            "Desc": "An introduction to applications of calculus in business, the behavioural sciences, and the social sciences. The models studied will involve polynomial, rational, exponential, and logarithmic functions. The major concepts introduced to solve problems are rate of change, optimization, growth and decay, and integration. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Open only to students in the following Faculties: ARTS, AHS, ENV, SCI.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 127, 137, 147",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH106",
            "Name": "Applied Linear Algebra 1",
            "Desc": "Systems of linear equations.  Matrix algebra.  Determinants.  Introduction to vector spaces.  Applications. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 103 or 4U Calculus and Vectors; Not open to Computer Science students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 114, 115, 136, 146, NE 112",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH114",
            "Name": "Linear Algebra for Science",
            "Desc": "Vectors in 2- and 3-space and their geometry. Linear equations, matrices, and determinants. Introduction to vector spaces. Eigenvalues and diagonalization.  Applications. Complex numbers. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors; Science or Geomatics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 115, 136, 146, NE 112",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH115",
            "Name": "Linear Algebra for Engineering",
            "Desc": "Linear equations, matrices and determinants. Introduction to vector spaces.  Eigenvalues and diagonalization. Applications. Complex numbers. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors or 4U Mathematics of Data Management; Engineering students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 136, 146, NE 112",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH116",
            "Name": "Calculus 1 for Engineering",
            "Desc": "Functions: review of polynomials, exponential, logarithmic, trigonometric. Operations on functions, curve sketching. Trigonometric identities, inverse functions. Derivatives, rules of differentiation. Mean Value Theorem, Newton's Method. Indeterminate forms and L'Hopital's rule, applications. Integrals, approximations, Riemann definite integral, Fundamental Theorems. Applications of the integral. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors; Open to students in Engineering excluding Electrical and Computer Eng, Nanotechnology Eng, Software Eng and Systems Design Eng.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 117, 124, 127, 137, 147",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH117",
            "Name": "Calculus 1 for Engineering",
            "Desc": "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities. Inverse functions (logarithmic and trigonometric). Limits and continuity. Derivatives, rules of differentiation; derivatives of elementary functions. Applications of the derivative, max-min problems, Mean Value Theorem. Antiderivatives, the Riemann definite integral, Fundamental Theorems. Methods of integration, approximation, applications, improper integrals. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors; Open only to students in Electrical and Computer Engineering or Software Engineering or Nanotechnology Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 116, 124, 127, 137, 147",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH118",
            "Name": "Calculus 2 for Engineering",
            "Desc": "Methods of integration: by parts, trigonometric substitutions, partial fractions; engineering applications, approximation of integrals, improper integrals. Linear and separable first order differential equations, applications. Parametric curves and polar coordinates, arc length and area. Infinite sequences and series, convergence tests, power series and applications. Taylor polynomials and series, Taylor's Remainder Theorem, applications. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 116, 117, 127, 137, 147; Open only to students in Engineering excluding students in Electrical and Computer Eng, Nanotechnology Eng, Software Eng and Systems Design Eng.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 119, 128, 138, 148",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH119",
            "Name": "Calculus 2 for Engineering",
            "Desc": "Elementary approximation methods: interpolation; Taylor polynomials and remainder; Newton's method, Landau order symbol, applications. Infinite series: Taylor series and Taylor's Remainder Theorem, geometric series, convergence test, power series, applications. Functions of several variables: partial derivatives, linear approximation and differential, gradient and directional derivative, optimization and Lagrange multipliers. Vector-valued functions:  parametric representation of curves, tangent and normal vectors, line integrals and applications. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 116, 117, 127, 137, 147; Open only to students in Electrical and Computer Engineering or Software Engineering or Nanotechnology Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 118, 128, 138, 148",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH124",
            "Name": "Calculus and Vector Algebra for Kinesiology",
            "Desc": "Review of trigonometry and basic algebra. Introduction to vectors in 2- and 3-space: sums, addition, dot products, cross products and angles between vectors. Solving linear systems in two and three variables. Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties. Intuitive discussion of limits and continuity. Derivatives of elementary functions, derivative rules; applications to curve sketching, optimization. Relationships between distance, velocity, and acceleration. The definite integral, antiderivatives, the Fundamental Theorem of Calculus; change of variable and integration by parts; applications to area, centre of mass. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Advanced Functions; Kinesiology students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 109, 116, 117, 127, 137, 147",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH127",
            "Name": "Calculus 1 for the Sciences",
            "Desc": "Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses. Intuitive discussion of limits and continuity. Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications. Riemann sums and other approximations to the definite integral. Fundamental theorems and antiderivatives; change of variable. Applications to area, rates, average value. [Offered: F,W,S; online: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 104 or 4U Calculus and Vectors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 109, 116, 117, 124, 137, 147",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH128",
            "Name": "Calculus 2 for the Sciences",
            "Desc": "Transforming and evaluating integrals; application to volumes and arc length; improper integrals. Separable and linear first order differential equations and applications. Introduction to sequences. Convergence of series; Taylor polynomials, Taylor's Remainder theorem, Taylor series and applications. Parametric/vector representation of curves; particle motion and arc length. Polar coordinates in the plane. [Offered: F,W,S; online: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 116, 117, 127, 137, 147.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 118, 119, 138, 148",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH135",
            "Name": "Algebra for Honours Mathematics",
            "Desc": "An introduction to the language of mathematics and proof techniques  through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors or 4U Mathematics of Data Management; Honours Mathematics or Mathematics/BASE or Software Engineering students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 145",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH136",
            "Name": "Linear Algebra 1 for Honours Mathematics",
            "Desc": "Systems of linear equations, matrix algebra, elementary matrices, computational issues. Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations. Determinants, eigenvalues and diagonalization, applications. [Offered: F,W,S; online: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 135 with a grade of at least 60% or MATH 145; Honours Mathematics or Mathematics/BASE students) or Science Mathematical Physics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 115, 146, NE 112",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH137",
            "Name": "Calculus 1 for Honours Mathematics",
            "Desc": "Absolute values and inequalities. Sequences and their limits. Introduction to series. Limits of functions and continuity. The Intermediate Value theorem and approximate solutions to equations. Derivatives, linear approximation, and Newton's method. The Mean Value theorem and error bounds. Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation. Suitable topics are illustrated using computer software. [Offered: F,W,S; online: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4U Calculus and Vectors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 116, 117, 127, 147",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH138",
            "Name": "Calculus 2 for Honours Mathematics",
            "Desc": "Introduction to the Riemann integral and approximations. Antiderivatives and the fundamental theorem of calculus. Change of variables, methods of integration. Applications of the integral. Improper integrals. Linear and separable differential equations and applications. Tests for convergence for series. Binomial series, functions defined as power series and Taylor series. Vector (parametric) curves in R2. Suitable topics are illustrated using computer software. [Offered: F,W,S; online: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 116 or 117 or 127 with a grade of at least 70%) or MATH 137 with a grade of at least 60% or MATH 147.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 118, 119, 128, 148",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH145",
            "Name": "Algebra (Advanced Level)",
            "Desc": "MATH 145 is an advanced-level version of MATH 135. [Offered: F]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: 4U Calculus and Vectors or 4U Mathematics of Data Management; Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 135",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH146",
            "Name": "Linear Algebra 1 (Advanced Level)",
            "Desc": "MATH 146 is an advanced-level version of MATH 136. ",
            "Notes": "[Note: Students who receive a minimum grade of 90% in MATH 135 may contact the instructor of MATH 146 to seek admission without the formal prerequisites. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 145; Honours Mathematics students only. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 115, 136, NE 112",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH147",
            "Name": "Calculus 1 (Advanced Level)",
            "Desc": "MATH 147 is an advanced-level version of MATH 137. [Offered: F]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq:  4U Calculus and Vectors; Honours Mathematics students only. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 116, 117, 124, 127, 137",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH148",
            "Name": "Calculus 2 (Advanced Level)",
            "Desc": "MATH 148 is an advanced-level version of MATH 138. ",
            "Notes": "[Note: Students who receive a minimum grade of 90% in MATH 137 may contact the instructor of MATH 148 to seek admission without the formal prerequisites. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 147; Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 118, 119, 128, 138",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH199",
            "Name": "Mathematical Discovery and Invention",
            "Desc": "A course in problem solving in which intriguing and difficult problems are solved. Problems are taken mainly from the elementary parts of applied mathematics, computer science, statistics and actuarial science, pure mathematics, and combinatorics and optimization. Material relevant to the problems is taught in depth.",
            "Notes": "None",
            "Consent": "Instructor Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH207",
            "Name": "Calculus 3 (Non-Specialist Level)",
            "Desc": "Multivariable functions and partial derivatives. Gradients. Optimization including Lagrange multipliers. Polar coordinates. Multiple integrals. Surface integrals on spheres and cylinders. Introduction to Fourier Series. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 128 or 138 or 148.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 231, MATH 212, 212N/NE 217, MATH 217, 227, 237, 247",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH211",
            "Name": "Advanced Calculus 1 for Electrical and Computer Engineers",
            "Desc": "Fourier series. Ordinary differential equations. Laplace transform. Applications to linear electrical systems. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 119; Not open to Mathematics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 350, MATH 218, 228",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH212",
            "Name": "Adv Calculus 2 for Electrical Engineers",
            "Desc": "Triple integrals, cylindrical and spherical polar coordinates. Divergence and curl, applications. Surface integrals, Green's, Gauss' and Stokes' theorems, applications. Complex functions, analytic functions, contour integrals, Cauchy's integral formula, Laurent series, residues. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 211/ECE 205; Not open to Mathematics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 231, MATH 207, 217, 227, 237, 247",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH213",
            "Name": "Signals, Systems, and Differential Equations",
            "Desc": "Laplace transform methods for:  solving linear ordinary differential equations, classical signals, and systems. Transfer functions, poles, and zeros; system stability. Frequency response of linear systems and its log-scale representation (Bode plot). Fourier series. Applications in areas of interest for software engineers and computer scientists. Brief introduction to Fourier transforms in the context of signals and systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 118, MATH 119, MATH 128, MATH 138.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 250, 251, MATH 211/ECE 205, 218, 228",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH215",
            "Name": "Linear Algebra for Engineering",
            "Desc": "Systems of linear equations; their representation with matrices and vectors; their generalization to linear transformations on abstract vector spaces; and the description of these linear transformations through quantitative characteristics such as the determinant, the characteristic polynomial, eigenvalues and eigenvectors, the rank, and singular values. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Computer Engineering or Electrical Engineering students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 106, 114, 115, 136, 146, NE 112",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH217",
            "Name": "Calculus 3 for Chemical Engineering",
            "Desc": "Curves and surfaces in R3. Multivariable functions, partial derivatives, the chain rule, gradients. Optimization, Lagrange Multipliers. Double and triple integrals, change of variable. Vector fields, divergence and curl. Vector integral calculus: Green's theorem, the Divergence theorem and Stokes'  theorem. Applications in engineering are emphasized. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 118; Not open to Mathematics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 231, CIVE 221, ENVE 221, MATH 207, 212/ECE 206, 227, 237, 247, MATH 212N/NE 217, ME 201",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH218",
            "Name": "Differential Equations for Engineers",
            "Desc": "First order equations, second order linear equations with constant coefficients, series solutions, the Laplace transform method, systems of linear differential equations. Applications in engineering are emphasized. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 118, 119, 128, 138, 148, SYDE 112; Engineering or Earth Science students only. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 250, 251, 350, 351, CIVE 222,  ENVE 223, MATH 211/ECE 205, 228, MATH 212N/NE 217, ME 203, SYDE 211",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH225",
            "Name": "Applied Linear Algebra 2",
            "Desc": "Vector spaces. Linear transformations and matrices. Inner products. Eigenvalues and eigenvectors. Diagonalization. Applications. [Offered: F,S; online: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 106 or 136 or 146.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 235, 245",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH227",
            "Name": "Calculus 3 for Honours Physics",
            "Desc": "Directional derivative and the chain rule for multivariable functions. Optimization, Lagrange multipliers. Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals. Vector fields, divergence and curl. Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 128 or 138; Only open to Science students in honours plans.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 231, MATH 207, 212/ECE 206, 217, 237, 247, MATH 212N/NE 217",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH228",
            "Name": "Differential Equations for Physics and Chemistry",
            "Desc": "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method. Applications in physics and chemistry are emphasized. [Offered: F,W; online: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 128 or 138; Not open to Mathematics students. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: AMATH 250, 251, 350",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH229",
            "Name": "Introduction to Combinatorics (Non-Specialist Level)",
            "Desc": "Introduction to graph theory: colourings, connectivity, Eulerian tours, planarity. Introduction to combinatorial analysis: elementary counting, generating series, binary strings. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 106 or 136 or 146) and (MATH 135 or 145).",
            "Coreqs": "None",
            "Antireqs": " Antireq: CO 220, MATH 239, 249",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH235",
            "Name": "Linear Algebra 2 for Honours Mathematics",
            "Desc": "Orthogonal and unitary matrices and transformations. Orthogonal projections, Gram-Schmidt procedure, best approximations, least-squares. Inner products, angles and orthogonality, orthogonal diagonalization, singular value decomposition, applications. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 106 or 114 or 115 with a grade of at least 70%) or (MATH 136 with a grade of at least 60%) or MATH 146; Honours Mathematics or Mathematical Physics students.",
            "Coreqs": " Coreq: MATH 128 or 138 or 148.",
            "Antireqs": " Antireq: MATH 225, 245",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH237",
            "Name": "Calculus 3 for Honours Mathematics",
            "Desc": "Calculus of functions of several variables. Limits, continuity, differentiability, the chain rule. The gradient vector and the directional derivative. Taylor's formula. Optimization problems. Mappings and the Jacobian. Multiple integrals in various co-ordinate systems. ",
            "Notes": "[Note: MATH 247 may be substituted for MATH 237 whenever the latter is a plan requirement. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MATH 106, 114, 115, 136, 146) and (MATH 128 with at least 70% or MATH 138 with at least 60% or MATH 148); Honours Math or Math/Physics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 207, 212/ECE 206, MATH 212N, 217, 227, 247",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH239",
            "Name": "Introduction to Combinatorics",
            "Desc": "Introduction to graph theory: colourings, matchings, connectivity, planarity. Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ((MATH 106 with a grade of at least 70% or MATH 136 or 146) and (MATH 135 with a grade of at least 60% or MATH 145)) or level at least 2A Software Engineering; Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CO 220, MATH 229, 249",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MATH245",
            "Name": "Linear Algebra 2 (Advanced Level)",
            "Desc": "MATH 245 is an advanced-level version of MATH 235. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 146; Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 225, 235",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH247",
            "Name": "Calculus 3 (Advanced Level)",
            "Desc": "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 146, 148; Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 237",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MATH249",
            "Name": "Introduction to Combinatorics (Advanced Level)",
            "Desc": "MATH 249 is an advanced-level version of MATH 239. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 135 with minimum grade of 80% or MATH 145) and (MATH 136 or 146); Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CO 220, MATH 229, 239",
            "crosslisted": "None",
            "online": false
        }
    ]
}