{
    "Name": "managementsciences",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "MSCI100",
            "Name": "Management Engineering Concepts",
            "Desc": "An introduction to the practice of management engineering, including topics such as criteria based decision making with a focus on efficiency and effectiveness; cause and effect analysis, and an engineering approach to problem solving; flow and process analysis; teamwork and project management; decision-making tools; and written and verbal communication. Engineering design methods are also introduced, including a design project with small groups, as are aspects of the engineering profession including topics such as ethics, safety, and legal liability. Professional development for preparation for co-op terms is also included. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI100B",
            "Name": "Seminar",
            "Desc": "General Seminar.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI121",
            "Name": "Introduction to Computer Programming",
            "Desc": "An introduction to computer programming using a high level programming language. Concepts and topics covered include the basic components of algorithms (primitive operations, variables, sequencing operations, conditionals/branching, repetition/loops, subroutines/functions), problem decomposition, abstraction, testing and debugging, pseudo-code, file based input and output, use of a modern development environment including a symbolic debugger, good coding style, pointers/references, and basic data structures (arrays, records, objects). [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 121, ECE 150, MTE 121/GENE 121, SYDE 121",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI131",
            "Name": "Work Design and Facilities Planning",
            "Desc": "The course introduces fundamental concepts in two main areas: The first is work analysis and design where work methods design, motion and time study, and work sampling are covered.  The second covers basic concepts in facilities planning such as process analysis, flow design, facility location and layout, and material handling systems.  Students will apply these concepts in design activities in labs and projects.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI200A",
            "Name": "Seminar",
            "Desc": "General seminar.  [Offered:  F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI200B",
            "Name": "Seminar",
            "Desc": "General seminar.  [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI211",
            "Name": "Organizational Behaviour",
            "Desc": "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization. Consideration of communication, roles, norms, and decision making within a group. Discussion of power, control, leadership, and management in light of the above concepts. [Offered: F, W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Accounting and Financial Management students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 280, BUS 288W, PSYCH 238, SCBUS 225",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MSCI240",
            "Name": "Algorithms and Data Structures",
            "Desc": "Design and analysis of data structures and algorithms with an emphasis on further development of computer programming skills. Topics include algorithms for searching, sorting, stacks, queues, trees, and graphs. Comparison of algorithms on different data structures. Solutions to common engineering problems in computer science using algorithms and data structures. Introduction to mathematical analysis of space and time complexity with a focus on designing solutions that can scale to large input sizes. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 121; Level at least 2A Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 122, CS 240/240E, ECE 250, MTE 140 and SYDE 223",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI245",
            "Name": "Databases and Software Design",
            "Desc": "This course introduces students to software systems that use a relational database management system (RDBMS) for data storage. One focus of this course is multi-tier software architectures, such as websites and other software as a service (SaaS) systems. Students will learn common software concepts such as design patterns, and modelling processes, objects, logic, and data. Students will learn how to organize data in a RDBMS and how to interact with the database using the structured query language (SQL). [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 240; Level at least 2B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CS 338, 348",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI251",
            "Name": "Probability and Statistics 1",
            "Desc": "A first of a two-course sequence that introduces fundamental concepts in probability and statistics. It covers probability concepts, random variables, graphical display of distributions and data, discrete and continuous probability distributions, sampling, estimation, confidence intervals, experimental design, hypothesis testing, and simple linear regression and correlation. Students learn how to graphically explore data, conduct, and analyze a two-treatment experiment, and model data with linear regression, and interpret its fit. Students learn to use statistical computing software (e.g., R) to perform data analyses. Emphasis is placed on gaining experience with data collected from student-conducted experiments. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ECON 221, ENVE 224, ME 202, MTE 201, NE 215, STAT 231, SYDE 212",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI253",
            "Name": "Probability and Statistics 2",
            "Desc": "The second of a two-course sequence that introduces probability and statistics. It covers quantitative information displays, conditional probability and Bayes' rule, transforms, joint distributions, special discrete and continuous distributions (t, F, chi-square, Poisson), fitting distributions to data, maximum likelihood estimation, multiple regression, experimental design (blocking, factorial), paired hypothesis tests, analysis of variance, non-parametric statistics, and computer intensive statistics (bootstrap). In addition, students learn how to clean data, handle missing values, smooth data, and perform the statistical techniques covered in the course using a statistical computing package (e.g., R). Emphasis is placed on working with actual data collected from student experiments and other sources such as industrial partners. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 251; Level at least 2B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECE 307, STAT 332",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI261",
            "Name": "Engineering Economics:  Financial Management for Engineers",
            "Desc": "Introductory finance: time value of money, cash flow analysis. Investment evaluation methods: present worth, annual worth, and internal rate of return. Depreciation models and asset replacement analysis. The impact of inflation, taxation, uncertainty, and risk on investment decisions. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Engineering students only. Not open to Architectural, Biomedical, Civil, Environmental, Geological, and Systems Design Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AE 392, BME 364, CIVE 392, ECE 390, ENVE 392, GEOE 392, SYDE 262",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI263",
            "Name": "Managerial Economics",
            "Desc": "This course introduces students to key concepts in microeconomics, with an emphasis on applications to managerial decision-making. Topics include basic analysis of supply and demand, demand functions and the theory of consumer behaviour, production and costs, market equilibrium, competition between industry participants, and pricing strategies of firms under different market structures.  [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ECON 101, 201",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI271",
            "Name": "Advanced Calculus and Numerical Methods",
            "Desc": "This course introduces students to first and second order ordinary differential equations, vector calculus, and numerical methods for solution of systems of equations, and ordinary differential equations. Applications in management engineering are emphasized. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 118; Level at least 2A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI300A",
            "Name": "Seminar",
            "Desc": "General Seminar.  [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI300B",
            "Name": "Seminar",
            "Desc": "General Seminar.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI302",
            "Name": "Engineering Design Methods",
            "Desc": "This course provides a survey of engineering design theories, methods, and tools as they pertain to need finding, problem formulation, and solution generation and evaluation. Students learn about different approaches to design project and team management and communication, as well as the relationship between design and environmental, social, and economic sustainability. Students gain experience in the entire design cycle by working on a number of small design problems throughout the term. Students form teams and work on a term-long project centred on need finding and problem formulation. This activity is expected to result in a project topic that can be further developed in the capstone design series of courses (MSCI 401/402). [Offered: F, first offered Fall 2024]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI311",
            "Name": "Organizational Design and Technology",
            "Desc": "The focus of this course is on the procedures and variables involved in the design and redesign of organizations. Issues such as departmentation, differentiation, integration, internal politics, innovation, authority, and control are discussed in the context of the underlying technology of the organization. Emphasis will be placed on how one designs both the technical and the organizational systems to ensure their compatibility, noting the effects that one has on the other. [Offered: F, W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "MSCI331",
            "Name": "Introduction to Optimization",
            "Desc": "This first course in optimization uses a quantitative approach to problem solving involving, mathematical modelling and formulations, solution methods, and output analysis. Students are introduced to a variety of practical problem formulations in management and engineering, a number of solution methods, including, but not limited to, linear optimization, network models, project management, and decision analysis. Students are also involved in a group project, where they go through conceptual and operational model design, analytical solution, output analysis, and recommendation. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to students in the Faculty of Mathematics except for Software Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 411, CHE 521, CIVE 332, CO 250, ENVE 320/335, SYDE 411",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI332",
            "Name": "Deterministic Optimization Models and Methods",
            "Desc": "This course builds on the material presented in MSCI 331, and explores more advanced optimization techniques and applications. Methods, such as integer optimization, dynamic programming, and heuristics, are introduced and used to design solution alternatives for applications from management engineering. This may include network and process design in logistics, transportation, telecommunications, and healthcare. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BME 411, CHE 521, CIVE 332, CO 250, ENVE 320, 335, MSCI 331, SYDE\n411.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CO 327",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI333",
            "Name": "Simulation Analysis and Design",
            "Desc": "This course introduces the use of discrete event simulation as an approach for understanding and analyzing complex management systems.  Topics include an introduction to simulation modeling, general purpose and special purpose simulation languages, designing valid and credible simulation models, input data analysis, output analysis and experimental design.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 340",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI334",
            "Name": "Operations Planning and Inventory Control",
            "Desc": "This course exposes students to production planning and inventory control approaches in industrial and service systems. Production planning topics cover capacity and resources planning, production scheduling, manufacturing resource planning, just-in-time and lean manufacturing. Inventory control topics cover lot sizing policies, deterministic and stochastic inventory policies. The course involves a design project of a production and/or inventory system. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 131; One of CHE 220, CIVE 224, ECE 306, 307, ENVE 224, ME 202, MSCI 252, 253, MTE 201, STAT 206, 231, 241, SYDE 212.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MSCI 432",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI342",
            "Name": "Principles of Software Engineering",
            "Desc": "In this course, students learn how to work as a team to efficiently design and build software that works correctly and solves a customer's problem. Topics include software development processes, requirements gathering and analysis, software design, specifications, estimation, scheduling, revision control, software testing, deployment, and team behavior. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 245; Level at least 3A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI343",
            "Name": "Human-Computer Interaction",
            "Desc": "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design. The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 342; Level at least 3B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CS 449, SYDE 348/548",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI391",
            "Name": "Work-term Report",
            "Desc": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the 10th day of lectures for the academic term in which the report is required.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WKRPT 200, 201",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI392",
            "Name": "Work-term Report",
            "Desc": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the 10th day of lectures for the academic term in which the report is required. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WKRPT 300, 301",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI400A",
            "Name": "Seminar",
            "Desc": "General Seminar.  [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI400B",
            "Name": "Seminar",
            "Desc": "General Seminar. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI401",
            "Name": "Management Engineering Design Project 1",
            "Desc": "This is the first course of a two course sequence to provide students with an opportunity to engage in a significant design experience based on the engineering knowledge and skills gained in previous courses and on cooperative work terms. The instructor will review and extend concepts of project management studied in earlier courses, and students will apply these project management skills. Teams of students will formulate a design problem and submit a preliminary project proposal, make oral presentations for preliminary and interim design reviews, and submit a written interim report describing the proposed design solution. [Offered S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI402",
            "Name": "Management Engineering Design Project 2",
            "Desc": "This is the second course of a two course sequence to provide students with an opportunity to engage in a significant design experience based on the engineering knowledge and skills gained in previous courses and on cooperative work terms. Each student team is required to complete the detailed design for the project defined in MSCI 401, submit a final written report, and make an oral presentation describing their design solution. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 401; Level at least 4B Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI411",
            "Name": "Leadership and Influence",
            "Desc": "This course will provide students with an overview of how management, psychology, marketing, and related fields have approached the topics of leadership, influence, and power. The first section of the course will address the antecedents of leadership (e.g., How do specific leaders emerge? What are the qualities of good leaders?). The second section of the course will address the act of leadership (e.g., How do leaders influence their followers? What limitations are inherent to leadership positions?) Specific topics covered include leadership styles, persuasion, social influence, evolutionary perspectives, motivating others, and managing conflict. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: BET 450",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI422",
            "Name": "Economic Impact of Technological Change and Entrepreneurship",
            "Desc": "This course is designed to analyze the impact of technological change and entrepreneurship at a firm and societal level, primarily in terms of the economic antecedents and consequences of new technology. The scope of the course ranges from the study of the determination of productivity and its effect on economic growth to the determination of innovative activity and performance. [Offered: F] Prereq: (One of AE 392, BME 364, CIVE 392, ECON 101, ENVE 392, GEOE 392, MSCI 261, SYDE 262) and (One of AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ECON 221, ENVE 224, ENVS 278, MSCI 251 or 252, ME 202, MTE 201, NE 215, PSCI 314, PSYCH 292, REC 371, SDS 250R, SOC 280, STAT 202, 206, 211, 221, 231, 241, SYDE 212).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI431",
            "Name": "Stochastic Models and Methods",
            "Desc": "Introduction to operations research models and methods for problems with random, stochastic, and probabilistic components. Topics include birth and death processes, branching processes, waiting line models, and Markov decision processes. Applications include the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of BME411,CHE521,CIVE332,CO250,ENVE335,MSCI331,SYDE411) and (One of AE224,BME213,CHE220,CIVE224,ECE203,306,ENVE224,MSCI251,252, ME202,MTE201,NE215,STAT206,211,231,241,SYDE212); Not open to Math students except SE.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT333",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI432",
            "Name": "Production and Service Operations Management",
            "Desc": "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches. Topic areas include production, inventory, distribution, quality control, facilities layout, and process design. Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ENVE 224, ME 202, MTE 201, NE 215, STAT 206, 211, 231, 241, SYDE 212); Not open to Management Engineering students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MSCI 334",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI433",
            "Name": "Applications of Management Engineering",
            "Desc": "This course exposes students to a variety of application areas in management engineering and introduces to them the challenges inherent in implementing new management engineering systems. Topics will be chosen from areas such as  manufacturing, services, logistics, finance, healthcare, and engineering. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 332, 333, 431; 334 or 432",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI434",
            "Name": "Supply Chain Management",
            "Desc": "This course focuses on the efficient use of material, information, physical and human capital resources in supply-demand networks consisting of suppliers, manufacturers, distributors, retailers and customers. It emphasizes analytic tools used to design, implement and sustain competitive supply chain systems. The material will highlight application of supply chain practices in industry and supply chain implementation challenges. Issues associated with international or global supply chains will be discussed.\r\n[Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 334 or 432; Level at least 4A Management Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI435",
            "Name": "Advanced Optimization Techniques",
            "Desc": "This course covers more advanced topics in optimization that go beyond the contents of MSCI 331 and MSCI 332. The course will cover topics such as constraint programming, stochastic programming, large scale optimization, or complementarity problems. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 332",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI436",
            "Name": "Decision Support Systems",
            "Desc": "This course provides an introduction to analysis, design and implementation of decision support systems for engineering and business applications. Operations research modelling techniques and software are integrated with database systems and computer interfaces to create systems that aid managerial decision-making. This course also discusses challenges in designing and implementing decision support systems based on models drawn from Operations Research. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 332; One of CS 348, MSCI 245; One of CS 247, MSCI 342, SYDE 322; One of CS 449, MSCI 343, SYDE 348, 548",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI442",
            "Name": "Impact of Information Systems on Organizations and Society",
            "Desc": "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level. Particular emphasis will be placed on critical examination of various issues including privacy, security, ethical concern and professional responsibilities. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI446",
            "Name": "Introduction to Machine Learning",
            "Desc": "This course provides an introduction to machine learning, including supervised and unsupervised learning. Emphasis is placed on proper procedures for the training and testing of models. Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering. Students learn to apply machine learning methods to management engineering problems using common tools such as R and Python. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq:(One of BME 122, CS 240/240E, ECE 250, MSCI 240, MTE 140, SYDE 223);(One of BME 213,CHE 220,CIVE 224,ECE306,307 ENVE 224,MSCI 252,253,ME 202,MTE 201,NE 215,STAT 206,231 241,SYDE 212);Level at least 3A",
            "Coreqs": "None",
            "Antireqs": ".Antireq: CS480, ECE457B, SYDE522",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI452",
            "Name": "Decision Making Under Uncertainty",
            "Desc": "This course deals with normative, descriptive, and prescriptive theories and models of decision making under uncertainty. The course focuses on concepts such as risk measures, Bayes theorem, and basic and multi-attribute utility theories. The course uses these concepts to build analytical decision-making models considering the randomness and/or risk-attitude of the decision-makers. Various forms of decision analysis techniques will be covered and typically include, expected utility maximization, the value of information analysis, one/two-way sensitivity analysis, and sequential Bayesian inference. Practical uses and limitations of the models and techniques will be illustrated. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ENVE 224, MSCI 251, 252, ME 202, MTE 201, NE 215, STAT 206, 211, 231, 241, SYDE 212",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI454",
            "Name": "Technical Entrepreneurship",
            "Desc": "Technical entrepreneurship is examined considering the role of independent business, entrepreneurial behaviour, types of business and enterprises, business structure, sources of venture concepts and capital, company operation and control, and business start up. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI491",
            "Name": "Work-term Report",
            "Desc": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the 10th day of lectures for the academic term in which the report is required. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Management Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WKRPT 400, 401",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI531",
            "Name": "Stochastic Processes and Decision Making",
            "Desc": "This course builds on the material covered in MSCI 431. Students will learn how to construct and analyze a range of stochastic decision models that are useful in the design and control of a wide variety of systems. Applications areas include the design of inventory control systems, telecommunication networks, healthcare polices, manufacturing control, and reliability analysis. Topics include Renewal-Reward Processes, Markov Decision Processes, Matrix Analytic Methods with application areas noted above. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI541",
            "Name": "Search Engines",
            "Desc": "This course provides an opportunity for students to learn the engineering behind search engines and how to optimize search engines to provide higher quality user experiences. This course focuses on text retrieval and web search. Topics include design and construction of retrieval systems, retrieval models, and evaluation of search engines. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of BME 122, CS 240/240E, ECE 250, MSCI 240, MTE 140, SYDE 223) and (One of AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ENVE 224, MSCI 251, 252, ME 202, MTE 201, NE 215, STAT 206, 231, 241, SYDE 212)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI543",
            "Name": "Analytics and User Experience",
            "Desc": "This course provides students with an in-depth understanding of methods for evaluating the user experience on a large scale. Students will learn how to design user experiments that involve the collection and analysis of large quantities of data online, apply useful metrics for evaluating the user experience, and use this analysis to inform their designs of software and technology. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MSCI 253, SYDE 212); (One of MSCI 343, SYDE 348, 548)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI546",
            "Name": "Advanced Machine Learning",
            "Desc": "This course provides a deeper understanding of machine learning (ML) techniques by utilizing students' prior background in ML and operations research to understand the drivers of ML methodologies rather than using black-box processes. The course first reviews supervised and unsupervised learning methods, and then dives deeper into their assumptions, mathematical models, and underlying algorithms to help students systematically develop and enhance ML processes. Using the same approach, the course covers more advanced topics in ML, such as neural networks and reinforcement learning. Application areas within this course may include, but are not limited to healthcare, energy, sports, transportation, and manufacturing. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MSCI 332; One of CS 480, ECE 457B, MSCI 446, SYDE 522",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI551",
            "Name": "Quality Management and Control",
            "Desc": "The course focuses on the analysis, evaluation, and improvement of quality based on statistical tools. Topics include process capability analysis, statistical process control, experimental design and the Taguchi method, and acceptance sampling. The emphasis is on the assessment of quality and the design of alternate processes and/or quality assessment schemes to improve quality. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of AE 224, BME 213, CHE 220, CIVE 224, ECE 203, 306, ENVE 224, MSCI 251, 252, ME 202, MTE 201, NE 215, STAT 206, 231, 241, SYDE 212",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI555",
            "Name": "Scheduling: Theory and Practice",
            "Desc": "Scheduling is the sequencing of tasks to scarce resources. By exploring scheduling problems found in industry, this course will discuss scheduling framework and notation as well as algorithmic, heuristic, and mathematical programming solution approaches. Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modeling and solving scheduling problems in practice. Students will apply these concepts in design activities in assignments and a course project. [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BME 411, CHE 521, CIVE 332, CO 250, ENVE 320, 335, MSCI 331, SYDE 411.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CO 454",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI597",
            "Name": "Complementary Studies Topics in Management Sciences",
            "Desc": "A complementary studies course on advanced topics in Management Sciences will be offered when resources are available. For current offerings, see the Course Selections Offerings List or the Schedule of Classes. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "MSCI598",
            "Name": "Special Topics in Management Engineering",
            "Desc": "A course on advanced topics in management engineering will be offered when resources are available. For current offerings, see the Course Selections Offerings List or the Schedule of Classes. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}