{
    "Name": "peaceandconflictstudies",
    "Notes": "The following courses are administered by Conrad Grebel\r\nUniversity College.",
    "Courses": [
        {
            "courseCode": "PACS101",
            "Name": "Peace is Everybody's Business",
            "Desc": "This course explores ways in which individuals and groups from multiple sectors of society have contributed to peace by engaging conflict constructively and advancing social justice. Attention will be given to the diversity of peacemaking approaches, and to interpersonal and intergroup as well as international applications.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS201",
            "Name": "Roots of Conflict, Violence, and Peace",
            "Desc": "An examination of influential theories about the sources and nature of conflict, violence, and peace. Contributions from the social sciences as well as the humanities will be explored, with attention to connections between interpersonal, intergroup, and international levels of analysis.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PACS202",
            "Name": "Conflict Resolution",
            "Desc": "An examination of the resolution of conflicts, ranging from interpersonal to broader social and international conflicts. Students are introduced to negotiation, mediation, and nonviolent resistance, and are encouraged to develop their own theoretical understandings that aid in addressing conflict.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PACS203",
            "Name": "A History of Peace Movements",
            "Desc": "A survey of individuals and groups that have created popular movements for peace globally and locally throughout history. The scope will be international, with a particular focus on the 19th and 20th century movements. The choice of peace movements will allow for a contrast in comparison of ideology, strategy, and impact.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PACS290",
            "Name": "Special Topics in Peace and Conflict Studies",
            "Desc": "A seminar course exploring special issues related to peace and conflict. Content will vary from year to year. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS301",
            "Name": "Special Topics in Peace and Conflict Studies 1",
            "Desc": "A seminar course investigating special issues related to peace and conflict. Content may vary from year to year. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS302",
            "Name": "Special Topics in Peace and Conflict Studies 2",
            "Desc": "A seminar course investigating special issues related to peace and conflict. Content may vary from year to year. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS310",
            "Name": "Peace and the Environment",
            "Desc": "This course explores the natural environment as a potential source of both conflict and peacebuilding in local, national, and international contexts. In this course, we examine both the gravity of the global environmental crisis and the inspiration of the growing grassroots movement toward resilience and peaceful change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PACS 301 taken fall 2016 or PACS 301 (LEC 002) taken fall 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS311",
            "Name": "Doing Development: Issues of Justice and Peace",
            "Desc": "This course introduces a variety of theoretical and practical perspectives on international development. It examines current and alternative development programs in terms of their contribution to justice and/or peace at local, national, and global levels.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS312",
            "Name": "Quest for Peace in Literature and Film",
            "Desc": "A study of works of literature and film which express a resistance to war. The course examines how the desire to articulate an anti-war position has engaged the artistic sensibilities and shaped the visions and modes of expression of selected writers and filmmakers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS313",
            "Name": "Community Conflict Resolution",
            "Desc": "An analysis of the growing use of mediation and other conflict resolution strategies in community conflicts, race relations, church disputes, and alternatives to the legal system. The course focuses on case studies with attention to both practical and theoretical issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS314",
            "Name": "Restorative Justice and Transformative Education",
            "Desc": "This seminar course presents alternative ways of designing the educational experience using restorative justice as a foundation. It applies the principles and practices of restorative justice to many aspects of education including dealing with conflict, curriculum development, school culture, and system issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS315",
            "Name": "Engineering and Peace",
            "Desc": "This course is built on the conviction that the kinds of problems engineers seek to address, and the ways they seek to address them, should matter for anyone interested in advancing peace in the world. Topics include historical connections between the discipline of engineering and warfare, understanding the engineering method and mindset, and technological frontiers for peacebuilding.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PACS 301 taken spring 2016 or PACS 301 (LEC 001) taken fall 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS316",
            "Name": "Violence, Non-violence, and War",
            "Desc": "An exploration of the traditional debates concerning the legitimacy of violence and war as instruments in the pursuit of personal and political goals. The course critically examines a continuum of views from religious doctrines of non-resistance, to various forms of pacifism and non-violent resistance, \"just-war theory\", and political realism. The strategic arguments for political non-violent action are also considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS318",
            "Name": "Peacebuilding in Divided Societies",
            "Desc": "This course confronts the central challenge of how to transition from violence to just peace; from deep rooted conflict, war, and structural violence to positive peace and transformed relationships. The course introduces the concept of peacebuilding, identifies levels of peacebuilding initiatives, and focuses particularly on grassroots efforts to lead change. Course work includes readings, case studies, simulation exercises, and applied projects.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS320",
            "Name": "Christian Approaches to Peacemaking",
            "Desc": "Current Christian approaches to peacemaking in areas of conflict: war and militarism, crime, poverty, racism, and gender relations. Attention will be given to various biblical, theological, and historical bases for these approaches. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: RS 256",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS321",
            "Name": "Gender in War & Peace",
            "Desc": "An examination of various themes in the history of peace and war using gender as a central category of analysis. Theoretical literature and international case studies will be used to explore how the discourse and enactment of war and peace are influenced by societal constructions of gender, both historically and in the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 331",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS323",
            "Name": "Negotiation: Theories and Strategies",
            "Desc": "This course explores different ways of negotiating between people and groups with conflicting interests. Students will learn the theory behind the strategies and develop practical negotiation skills you can put to use in your daily life at home, at work, and in the community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSYCH 439",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS324",
            "Name": "Human Rights, Peace, and Business",
            "Desc": "This course will explore the tension between the values of human security/human rights and traditional economic policy. The impact of this dynamic relationship on the well-being of individuals as well as on corporations and international economic institutions to promote peace and just development will also be analyzed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS325",
            "Name": "Refugees and Forced Migration",
            "Desc": "This course will draw on case studies from past and present to understand why people flee their homes and homelands to seek refuge elsewhere. It will examine the policies and practices of government and non-governmental agencies in facilitating or blocking such movements. The course will also analyze the attitudes, values, and language that shape local and global responses to refugee movements, on the part of civil society and the state. Students in the course will become acquainted with organizations that work with refugees in Waterloo Region and will gain a critical understanding of Canada's role in refugee reception.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma Students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PACS 301 (LEC 001) winter 2016, winter 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS326",
            "Name": "Religion and Peacebuilding",
            "Desc": "This course investigates the roles of religion and spirituality in peacemaking, exploring both obstacles and opportunities facing religious peace builders. Cases involving representatives of major world religions (Christianity, Islam, Judaism, Hinduism, and Buddhism) will provide a basis for comparing practices of faith-based advocacy for social justice, reconciliation, and coexistence. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS327",
            "Name": "Cultural Approaches to Conflict Resolution",
            "Desc": "Cultural differences enrich our world while also creating bases for disagreement and misunderstanding among individuals, social groups, and nations. This course explores the cultural dimensions of conflict and conflict resolution, shedding light on major patterns of human difference and their implications for contemporary peacebuilding practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS328",
            "Name": "Fair Trade",
            "Desc": "This course examines the history, theory, and practice of fair trade and how it differs from traditional principles of international trade. It will specifically explore the impact that the fair trade movement has had on small scale producers, consumers, and more broadly on the global economic system.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS329",
            "Name": "Restorative Justice",
            "Desc": "This course investigates the history, theory, principles, practices, and people of restorative justice. Content will centre particularly on restorative justice as a way of dealing with crime and interpersonal violence in the Canadian context.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS330",
            "Name": "War and Peace in Christian Theology",
            "Desc": "Christian teachings on war and peace from the early church to the present, including crusade, just war, and pacifist traditions, focusing especially on the 20th century discussion around realism, just revolution, nuclear pacifism, and non-violent resistance. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS331",
            "Name": "Trauma, Healing, and Social Transformation",
            "Desc": "This course examines how attention to trauma and healing can inform processes to transform conflict, violence, and injustice. With case examples from domestic abuse to colonialism and police violence, students explore theories and approaches to trauma and healing to better understand pathways to personal and social transformation and how they can be applied in various contexts. Topics include causes, types, and impacts of trauma; the role of trauma in cycles of violence; and frameworks for healing informed by contemporary social justice movements.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS332",
            "Name": "Ethics of Peacebuilding",
            "Desc": "This course will explore ethical challenges in peacebuilding. It will answer the questions: What are ethical problems in peacebuilding? How can we better understand and assess these problems? And, how can we improve our ability to support, or engage in, ethical peacebuilding practice?",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS333",
            "Name": "Advanced Mediation Practice",
            "Desc": "This course will give students both a thorough understanding of the mediation process and practical, hands-on mediation experience. Students will develop in-depth, first-hand knowledge and experience resolving conflicts through the role of the mediator as third party. The course will include a series of role-plays, readings, and case studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PACS 202/LS 271; Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS335",
            "Name": "Perspectives in Music and Peace",
            "Desc": "This course examines music's role in peace and conflict from a variety of perspectives through listening, reading, discussion, and using examples from around the world. Topics include the use of music in dissent and resistance, and as an instrument of propaganda, conflict, and peacebuilding.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PACS 301 (LEC 001) taken winter 2015 or MUSIC 391 taken winter 2015",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS336",
            "Name": "Christianity, Violence, and the Bible",
            "Desc": "Why has the Bible inspired so much violence? This course explores how it has been used to justify, and to oppose, violence within the Christian tradition in historical and contemporary contexts. Topics may include the crusades, slavery, colonization, apartheid in South Africa, the residential school system in Canada, gender violence, and the environmental crisis. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS390",
            "Name": "Internship",
            "Desc": "An internship allows students to engage in experiential learning with an organization that deals with peace and conflict issues, in either a Canadian or international context. The course integrates theory and practice, while facilitating the development of attitudes, strategies, skills, and knowledge that support work in a Peace and Conflict Studies-related setting. Students will identify an appropriate placement, read relevant texts, and submit a report reflecting on what the internship revealed about the integration of peace and conflict studies theory and practice. ",
            "Notes": "[Note: Additional costs should be expected.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS391",
            "Name": "Conflict Resolution Skills",
            "Desc": "This course provides a framework for students to pursue conflict resolution\nskills training by completing intensive skills-building workshops in the Certificate Program in Conflict Management with additional academic work supervised by Peace and Conflict Studies faculty. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis. Additional costs should be expected. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Peace and Conflict Studies students or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS395",
            "Name": "Peace and Conflict Studies Travel Course",
            "Desc": "A travel seminar of approximately three weeks in length, taught on location, which will involve travel to a region that has experienced conflict. Student preparation, in the form of readings and/or written assignments, will be required prior to departure. Regular lectures and interaction with persons who have worked for peace will be scheduled. Hands-on examples merging theory with practice will be emphasized. Possible locations include the Middle East, Central/South America, Africa, Asia. ",
            "Notes": "[Note: Additional costs should be expected. This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS398",
            "Name": "Directed Readings in Peace and Conflict Studies",
            "Desc": "Students may arrange independent studies in the area of peace and conflict studies on problems of special interest.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Peace and Conflict Studies students or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS399",
            "Name": "Directed Readings in Peace and Conflict Studies",
            "Desc": "Students may arrange independent studies in the area of peace and conflict studies on problems of special interest.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Peace and Conflict Studies students or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS401",
            "Name": "Senior Research Seminar",
            "Desc": "Each student will work on an integrative research project and will meet regularly with other students and faculty for discussion.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Peace and Conflict Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS402",
            "Name": "Senior Research Seminar",
            "Desc": "A continuation of PACS 401. Each student will work on an integrative research project or projects and will meet regularly with other students and faculty for discussion.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: PACS 401",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PACS490",
            "Name": "Special Topics in Peace and Conflict Studies",
            "Desc": "A seminar course offering an in-depth investigation into special issues related to peace and conflict. Content will vary from year to year. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of four times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}