{
    "Name": "professionaldevelopment",
    "Notes": "Students are to take only one PD course per term unless they are\r\nrepeating a previously failed PD course.",
    "Courses": [
        {
            "courseCode": "PD1",
            "Name": "Career Fundamentals",
            "Desc": "This course is a combination of career development advice and work search  information. Topics include preparing résumés, developing interview skills and preparing for success in the workplace.  Program specific information is provided for students pursuing different forms of work integrated education. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to Engineering students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD3",
            "Name": "Communication",
            "Desc": "In this course, students will come to understand the nature and function of communication, particularly communication in the workplace, with a view to assessing, monitoring, and improving their own communications skills.  At the end of this course, students will be equipped to converse cordially with peers; collaborate more effectively in teams; give and receive clear instructions and messages; resolve conflicts amicably; and appreciate the ethical dimensions of workplace communication. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD4",
            "Name": "Teamwork",
            "Desc": "An introduction to the processes and skill required of high-performance teams. Application of teamwork skills to decision making, conflict resolution and leadership.  Development of self-awareness and relational skills to improve one's ability to collaborate effectively, give and receive assistance, and empower others. Personal reflection and case discussion is integrated with observations of teamwork in the co-op experience work environment. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD5",
            "Name": "Project Management",
            "Desc": "This course is intended to provide students with knowledge of basic project management techniques and practices while placing these within their organizational context. Students should understand how these techniques and practices are used and the human issues in their application. \r\n",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD6",
            "Name": "Problem Solving",
            "Desc": "This course provides students with the knowledge and skills needed to problem solve effectively in today's workplaces. Emphasis is on understanding how both critical and creative thinking can be applied to workplace problems as well as identifying the barriers that can interfere with the problem solving process.  Students will have the opportunity to apply a variety of problem solving strategies in order to develop their own Problem Solving Action Plan. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD7",
            "Name": "Conflict Resolution",
            "Desc": "This course will help students analyze and understand typical sources of conflict in the workplace, individual and group conflicts, mediation, negotiation, alternative dispute resolution, working with difficult people, and how to recover from conflict. Students will develop a personal vision/model of conflict and communication skills. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD8",
            "Name": "Intercultural Skills",
            "Desc": "This course provides students with the knowledge and skills needed to work effectively in today's culturally and linguistically diverse workplaces.  Emphasis is on understanding how cultural values shape our everyday behaviours, attitudes, thinking processes, and communication styles.  Students will examine their own cultural preferences, become familiar with key models used to described cultures, and apply intercultural concepts and tools to analyze cultural issues in the workplace. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD9",
            "Name": "Ethical Decision Making",
            "Desc": "Borrowing from philosophy, game theory, and economics, this course equips students with the theoretical knowledge required to objectively evaluate and discuss ethical issues in the workplace. It provides students with practical advice regarding how to make ethical decisions in an increasingly competitive marketplace. Topics include the ethics of profit-making, why good people make bad decisions, moral hazard, and personal responsibility in group contexts.\r\n",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD10",
            "Name": "Professional Responsibility in Computing",
            "Desc": "This course considers many of the legal and ethical issues that arise in the development of software and digital-content products or services that are to be sold to the public.  Course topics include laws that impose obligations on products or producers (e.g., privacy laws, accessibility laws, intellectual-property laws, regulated industries); contracts (e.g., licenses, warranties, privacy policies); and ethical responsibilities to employers, clients, the users of products, and to society as a whole.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD11",
            "Name": "Processes for Technical Report Writing",
            "Desc": "This course develops flexible and broadly applicable report writing skills by involving students in various stages of the writing process, from drafting to revision. Students develop context-specific content for their own technical report and learn strategies for peer review.\n",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Co-op students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PD2",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD12",
            "Name": "Critical Reflection for Growth in the Workplace",
            "Desc": "This course supports students in strengthening their self-awareness and critical reflection skills as they relate to the workplace. Using real-world examples and authentic assessments, students will develop their critical reflection toolkit and apply it to workplace challenges such as navigating group dynamics, managing failure and building resilience, and self-advocacy. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Co-op students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PD2",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD13",
            "Name": "Research in the Workplace",
            "Desc": "This course provides students with a foundational understanding of the purpose and process of undertaking research in the workplace. Using examples from student, faculty, and employer projects, students will explore research processes while reflecting upon their own research skills and interests. Topics include ethical and responsible research, research methods, and the critical consumption of research.\n\n",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: COOP or EDGE students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD19",
            "Name": "Tactics for Workplace Success",
            "Desc": "An introduction to strategies for success in the workplace and lifelong learning for co-op engineering students. Students explore the role of professional skills in the workplace, a model for self-reflection, a framework of co-operative education, and strategies to make the most of workplace opportunities and challenges. Topics include professional skills, strategies for workplace success, co-operative education, common workplace issues, typical corporate structures, work term planning, and effective self reflection. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Engineering students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PD 21",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD20",
            "Name": "Strategies for Career Success",
            "Desc": "An introduction to critical thinking and communication in the workplace for co-op engineering students. Students will practise general critical thinking and communication skills to assess evidence, interpret textual and visual information, and work through ethical and professional situations. Topics include the role of self-reflection in successful professional development, admitting ignorance to develop improved knowledge, understanding arguments, evaluating evidence, communicating conclusion and findings, recognizing and avoiding bias, and application to professional conduct. ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Engineering students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PD22",
            "Name": "Professionalism and Ethics in Engineering Practice",
            "Desc": "This course provides a framework for understanding professionalism and ethics within society as reflected through practice in the field of professional engineering.  Course topics on professionalism include:  the history of engineering and professions, the licensing of professional engineers and the certification of the practice of offering engineering services to the public, and the regulation of professional engineering in Ontario through Professional Engineers Ontario.  Course topics on ethics include: the philosophy of ethics and the Code of Ethics, the philosophy of justice, and the definition and disciplining of professional misconduct.  Case studies will apply these principles to workplace situations including factors such as environmental ethics, whistle blowing, conflict of interest, and health and safety.  ",
            "Notes": "[Note: Course will be graded on a CR/NCR basis.]",
            "Consent": "None",
            "Prereqs": "Prereq: Co-op students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECE 290",
            "crosslisted": "None",
            "online": true
        }
    ]
}