{
    "Name": "planning",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "PLAN100",
            "Name": "The Evolution of Planning",
            "Desc": "Introduction to planning in its historical and contemporary contexts. Discussion of city types and origins. Consideration of local, national, and international design and management of environment and human habitations. Introduction to selected main themes in planning and architecture. ",
            "Notes": "[Note: Estimated additional cost to student: $30.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN102",
            "Name": "Professional Communication",
            "Desc": "This is a practical introduction to written communications and oral presentations as they are used specifically in the Planning profession. Report writing, correspondence and interaction with the news media are among the forms of communication considered. Students complete both written and oral assignments. Considerable critical comment is provided  on assignment content as well as on technical aspects such as style and grammar.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN103",
            "Name": "Planning, Administration, and Finance",
            "Desc": "Important planning and financial instruments, administrative processes and planning practice are reviewed. Planning and Municipal Acts, official plans, plan amendments, zoning bylaws, site plans, easements, consents, variances, assessments, mill rates, capital works, and debentures. Municipal budgets and accounting concepts, and financing are studied.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN104",
            "Name": "Perspectives on Planning",
            "Desc": "This course introduces undergraduates to the discipline and practice of Planning. Students will gain a basic understanding of the many facets that make up Planning through interaction with a select complement of the School's faculty members. Emphasis will be placed on exploring research case studies and examining the link between academia and professional planning practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN105",
            "Name": "Introduction to Planning Analysis",
            "Desc": "The goal of this course is to introduce students to analytical approaches employed in planning. Students will gain a basic understanding of planning relevant data and approaches to analyzing and communicating planning data. Ideas and techniques drawn from demography are emphasized along with spatial analysis, visualization, and techniques for socio-economic data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN110",
            "Name": "Visual Approaches to Design and Communication",
            "Desc": "Practical project-based skill development involving sketching, digital and film photography, and 2-dimensional computer graphics used by planners to conceive, evaluate, and communicate design ideas. ",
            "Notes": "[Note: Estimated material cost to student will not exceed $125+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN203",
            "Name": "Transportation Planning and Analysis",
            "Desc": "This course provides an in-depth exploration of transportation planning. Topics covered will include fundamentals of transportation systems, the historical evolution of transportation planning, modern approaches to urban and regional transportation planning, and relevant transportation planning methods. Applied analysis emphasizing Canadian urban examples will be undertaken.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 104, ENVS 178",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN210",
            "Name": "Community Design Fundamentals for Planners",
            "Desc": "This course explores the role of design in shaping human settlements. Students will study fundamental concepts related to urban and regional form and structure as well as the principles of design. The course will examine the impacts of design and place-making on human well-being through problem-based explorations of built form vis-à-vis transit and movement, sustainability and resilience, social institutions (including heritage), physical infrastructure, social justice, and economic development. Students will demonstrate design literacy through the creation of a sketchbook and a portfolio.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 110; Level at least 2A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN211",
            "Name": "Design Studio Foundations",
            "Desc": "A studio-based course that explores, through problem solving, the built form's connections to its physical-natural setting and its socio-cultural and economic contexts. Individual and group projects, and studio critiques and reviews will underscore visual communication skills through qualitative and quantitative visual analyses, design drawings (e.g., site plans, cross sections, elevations, axonometric projections, and perspective drawings), and constructed and computer models. This course normally includes a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $25+HST. Estimated material cost to student will not exceed $150+HST.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: PLAN 210",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN233",
            "Name": "People and Plans",
            "Desc": "This course examines major social problems and the role of social planning as a contributing and resolving factor. The relationship between physical and social planning will be discussed along with a selection of social planning topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 100; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN261",
            "Name": "Urban and Metropolitan Planning and Development",
            "Desc": "This course explores the relationship between planning instruments and the urban land use market. It relates urban outcomes to interactions between market processes and planning interventions. It is in this light that it interprets changing urban land use and transportation patterns since the late 1940s, as well as contemporary urban issues. These issues are chosen so as to underscore differences in the circumstances confronting different zones of urbanization (core, inner city, inner suburb, and outer suburb).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 100",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN262",
            "Name": "Introduction to Global Emerging Cities",
            "Desc": "This course focuses on the dynamics of growth and change in global emerging cities, with a focus on the urban transition underway in cities, with emphasis on Asia and Africa. Current urban challenges (e.g. social inequality, uneven development, climate change) are discussed, as well as opportunities for innovative planning and sustainable urban development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN281",
            "Name": "Introduction to Geographic Information Systems (GIS)",
            "Desc": "Introduction to the fundamental concepts and use of Geographic Information Systems (GIS). Students learn about the nature of geographic information and how to store, manipulate and analyze spatial data in a range of application areas. Students will learn underlying theory in lectures and gain a working knowledge of GIS software in lab sessions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG 165 or 181 or 187 or Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN300",
            "Name": "Planning Theory",
            "Desc": "The course will examine key theoretical contributions to planning practice as well as selected theories guiding place and place-making. Issues of professional practice and ethics will also be considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN309",
            "Name": "Site Planning and Design Studio",
            "Desc": "A design studio that focuses on design planning for individual sites and small scale developments.  Projects integrate critical features: terrain, natural and cultural context, microclimate, infrastructure, and adjacent land uses.  Studio seminars, consultation and critiques explore theory and practice in observation, awareness, comprehension, and idea development. ",
            "Notes": "[Note: Studio fee of $15+HST may be charged.]",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 211",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN313",
            "Name": "Community Design Studio",
            "Desc": "A design studio on planning design at the community scale that is sensitive to the natural, built, and cultural context. Field study projects of area development or redevelopment projects are used to examine traditional and contemporary theory and practice. Studio seminars, presentations and critiques explore the definition, management and mapping of physical structures, visual and environmental resources. Included is consideration of the special problems of planning development within a scenic landscape. This course normally includes a field component. ",
            "Notes": "[Note: Studio fee: $15+HST may be charged. Field trip fee will not exceed $50+HST. Supply and printing cost will not exceed $150+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 309",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN320",
            "Name": "Economic Analyses for Regional Planning",
            "Desc": "Practical application and critical appraisal of regional analysis techniques used by planners, economic developers and consultants. Problem based approaches to understanding the strength and leverage of business and industrial sectors, projection and forecasting, employment and demographic trends, investment decision-making and cost benefit analysis.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN333",
            "Name": "Neighbourhood and Community Planning",
            "Desc": "This course examines concepts and issues related to social planning for neighbourhood and community environments.  It considers planning for particular target populations in the contexts of gentrification, suburbanization and core area revitalization.  It will review models of neighbourhood change and community development and will address ways to involve community members in the planning process. This course normally includes a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $45+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 233",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN340",
            "Name": "Canadian Environmental Policy and Politics",
            "Desc": "Consideration of the intersection between key ecological themes and recent policy developments. Investigation of current issues in environmental science and politics. Development of critical skills for assessing, framing and conveying information essential to planning, managing and developing policy for environmental stewardship.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ENVS 200, BIOL 150, BIOL 251",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN341",
            "Name": "Conservation/Resource Management of the Built Environment",
            "Desc": "Consideration of the constraints and guidelines that an application of the principles of ecology places on the planning and management of resources within urban spaces and the implications for urban design. The theory and history of this subject will be discussed together with urban ecomanagement, the management of waste, urban open space and parks, rehabilitated sites, and environmentally sensitive areas.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN346",
            "Name": "Advanced Tools for Planning: Public Participation and Mediation",
            "Desc": "A number of approaches and techniques such as Public Participation, Alternative Dispute Resolution and Mediation are used extensively in modern planning. This course addresses these techniques and critically explores their background, rationale, application, and use in contemporary community planning within a modern democratic society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN349",
            "Name": "Urban Form and Internal Spatial Structure",
            "Desc": "An examination of the major factors giving rise to distinctive styles of urban spatial organization. Focus moves from city-wide scale to subareas/sectors - inner city, housing, retailing, etc., with emphasis on understanding and planning for the dynamics of complex environments. Applied issues or problems are dealt with throughout the course.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GEOG 101, 202/202A, PLAN 100",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN350",
            "Name": "Research Methods for Planners",
            "Desc": "This course develops the capacity of students to apply research methods to planning-related issues. Examination of a variety of alternative approaches to designing and conducting research. Students learn how to become informed consumers and producers of planning-related research.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN/GEOG 281, ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN351",
            "Name": "Multivariate Statistics",
            "Desc": "The theory and application of multivariate statistics, with particular emphasis upon the use of the computer.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 278; Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN353",
            "Name": "Spatial Analysis",
            "Desc": "Advanced quantitative analysis in a spatial context. A selection of techniques from sampling, geostatistics, point pattern analysis and cluster detection, spatial classification, and spatial data mining.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 278; Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN362",
            "Name": "Regional Planning and Economic Development",
            "Desc": "The relationship of economic planning to regional planning. Concepts of economic development and models of regional development planning. Case studies and examples are drawn from federal regional development efforts in Canada and/or from Third World nations. Workshops focus on regional planning and development at both a conceptual and empirical level.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN381",
            "Name": "Advanced Geographic Information Systems",
            "Desc": "Students learn theoretical and operational approaches to advanced spatial analysis using geographical information systems. Emphasis is placed on the use of automation procedures using models and programming to address a variety of topics that may include but are not limited to digital terrain modeling, suitability analysis, network analysis, and cell-based models. The domain of spatial problems explored may vary by instructor.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG/PLAN 255 or GEOG/PLAN 281",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN387",
            "Name": "Spatial Databases",
            "Desc": "This course focuses on design and development of a GIS database. It addresses theoretical issues regarding data models used in GIS and data modeling techniques used in designing spatial databases. It considers the processing required to input data from a variety of sources and clean and edit a multi-theme database and introduces students to creation and use of internet map services.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG/PLAN 255 or GEOG/PLAN 281",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN401",
            "Name": "Planners and Planning Tribunals",
            "Desc": "An examination of tribunals and boards that adjudicate matters related to land use planning, environmental and heritage protection, property assessment, land valuation, and other matters. Topics include tribunal/board history; appeal rights and procedures; the roles and responsibilities of planners, lawyers, and stakeholders; and critical perspectives regarding current and alternative practices. ",
            "Notes": "[Note: Additional cost for document preparation will not exceed $100+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN403",
            "Name": "Professional Practice, Public and Private Administration",
            "Desc": "Professional practice responsibility and ethics, administrative methods and organization are considered in the context of the nature of organizations, politics and economics that provide opportunities and limitations. Perspectives are drawn from organizational theory, public administration, land economics, political and planning theory. Public sector decision making and policy development are discussed. This course may have a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $25+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN405",
            "Name": "Integrated Planning Project",
            "Desc": "This senior level course provides an opportunity for students to integrate their planning skills and knowledge in an applied context.  Working under the supervision of Planning faculty, student groups will tackle case studies based on local real world examples.  The projects will require an integrative approach with required design, analytic, and theoretical elements. Students will develop, implement, and present their term projects in a professional setting.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4B Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN408",
            "Name": "Urban Design Seminar",
            "Desc": "An exploration of traditional and contemporary theories of urban design and their application in a variety of contexts. This involves study of approaches that lead to improved quality of life within a robust and sustainable urban environment. Topic includes the spatial, environmental, social, cultural and economic aspects of urban design.  Precedents and trends will be analyzed. International viewpoints and case studies are considered.  ",
            "Notes": "[Note: Estimated material cost will not exceed $75+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN409",
            "Name": "Urban Design Studio",
            "Desc": "An intensive urban design studio that addresses both new and redevelopment planning design at a community and higher scale.  A problem-based exploration involving studio seminars, consultation and critiques to integrate design elements that provide economically and socially viable communities with a sense of place and community, and improved urban quality. This course normally includes a field component. ",
            "Notes": "[Note: Studio fee of $15+HST may be charged. Field trip fee will not exceed $50+HST. Estimated additional supply and printing cost will not exceed $120+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 309 and 313",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN414",
            "Name": "Heritage Planning Workshop",
            "Desc": "The role of cultural heritage in the community context is examined. Varying forms of heritage preservation, its function and organization are covered. This course may include a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $25+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN415",
            "Name": "Urban Planning and Development in Transitional China",
            "Desc": "This course offers a critical understanding of China's urban planning and development in the context of the country's economic reform and globalization. It engages with the ongoing social, economic, environmental, and spatial challenges facing transitional urban China. The course exposes students to diverse and essential issues such as urban form, urban system, rural-urban migration, urban land and housing development, economic transformation, spatial restructuring, urban governance, citizenship and rights, urban sprawl and expansion, and environmental sustainability.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 261.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PLAN 474 001 W17, PLAN 474 001 W19",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN416",
            "Name": "Modelling the City",
            "Desc": "This course examines the use of computer modeling and simulation in the realm of urban analysis and forecasting, with the goal of understanding urban land-use change trajectories. Topics include an overview of the drivers and consequences in urban land-use change, the role of models, an overview of current methodological approaches, and an examination of urban simulation models as used in the development of urban policies and official plans. This course provides an applied learning environment in which students will gain experience in the use of spatial (GIS) modeling approaches.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN/GEOG 281, ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN417",
            "Name": "Aggregate Resources Planning, Development, and Management",
            "Desc": "This course introduces students to the planning and management of aggregate resources (sand, gravel, and stone). These resources are critical to infrastructure and urban development and are often subject to land use/environmental issues and conflicts. Course topics related to aggregate resources include relevant legislation, geology, economics, site plans, licensing, technical/peer reviews, water resources, pit and quarry rehabilitation and after-use strategies, and significant tribunal decisions. Emphasis will be on practical applications and 'real world' issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Planning students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PLAN 474 001 F17, PLAN 474 001 F18, PLAN 474 001 F19",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PLAN418",
            "Name": "Spatial Demography",
            "Desc": "This course develops the capacity of students to apply methods of spatial demography. Spatial demography refers to the statistical study of human population using spatial methods for analyzing demographic data. It can provide insights into the understanding of geographic variations of population's characteristics, which in turn can help to make better plans in building the environment. Through this course, students will learn the basic concepts, data sources, data issues, methodologies, and applications of spatial demography.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 278 and GEOG/PLAN 281",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN431",
            "Name": "Issues in Housing",
            "Desc": "An examination of social planning and policy issues associated with Canada's housing system, considering the roles of various levels of government and the private sector in developing socially sustainable, affordable housing. The course considers the housing needs of various social and demographic groups. We use case study methods to examine redevelopment of social housing. Issues of social mix, live-work, housing need and homelessness, and ways housing can create community are considered. This course normally includes a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $60+HST.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN432",
            "Name": "Health, Environment, and Planning",
            "Desc": "This course examines the relationship between the environment (built/physical, economic, social, political, and natural aspects) and population health. It focuses on conceptual and empirical links among current environment-health issues such as air quality, active transportation, injury prevention, climate change, and mental well-being. Emphasis is placed on the role of urban planners in collaboration with allied professionals (e.g., public health, engineering, law enforcement, architecture) in creating and maintaining healthy built environments to improve population health with a focus on key health issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PLAN 233, HLTH/GSJ 260, ERS 253, GEOG 325",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN433",
            "Name": "Social Concepts in Planning",
            "Desc": "An advanced examination of planners in their environment considering the relationship between social and land use planning. The course will examine a set of social concepts which may include: safety, gentrification, neighbourhood revitalization, social mix, community, displacement, participation, social capital, social sustainability, accessibility, public space, urban sprawl and social cohesion.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 233",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN440",
            "Name": "Urban Services Planning",
            "Desc": "This course will explore the interconnections and cascading effects of urban infrastructure services (waste and water systems, power grids, transport networks, digital circuits) and the politics of planning for urban services in global and globalizing cities across the globe. Students will examine, in particular, the impact of climate change, and our collective responses to it, on the delivery of urban services and the role of progressive planning and policy in mediating infrastructure disruptions and disasters.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN450",
            "Name": "Changing Form and Structure of Metropolitan Canada",
            "Desc": "Selected analysis of processes, problems and planning issues associated with the internal growth and spatial reorganization of Canadian metropolitan areas. Three or four topics are chosen for detailed investigation; these will vary from year to year.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of GEOG 426, GEOG/PLAN 349, PLAN 362, PLAN 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN451",
            "Name": "Tools for Sustainable Communities",
            "Desc": "This seminar course will focus on conceptual frameworks and tools intended to guide communities to a more sustainable condition. Examples of possible concepts covered in the course are material and energy flows, resilience, adaptability, passive survivability, sufficiency, biophilia, and localization. Course focus will vary from year to year. Recent topics have included The Natural Step, transition towns, LEED-ND, microclimate design, biophilia, and community energy systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN452",
            "Name": "Policy Analysis and Program Evaluation",
            "Desc": "This course considers Policy Analysis and Program Evaluation as step-by-step processes of prescriptive activities used to aid decision-making. For heuristic purposes, simplified models of the policy and program processes are presented so that basic analytical methods for each step in these processes can be explored. The course highlights quick, yet theoretically defensible, methods useful for smaller-scale analyses or for taking a preliminary approach to larger-scale analyses. The instructor will present case materials from planning and policy to illustrate the analytical methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PLAN 350",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN453",
            "Name": "Urban Stormwater Management",
            "Desc": "Urban stormwater runoff affects the water quality, water quantity, habitat and biological resources, public health and aesthetic appearance of urban waterways. This course reviews the physical and chemical processes, environmental assessment techniques and best management practices related to stormwater management in the urban systems.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN471",
            "Name": "Planning Law",
            "Desc": "An analysis of the legal basis for planning in Ontario and the practice of planning law as it affects planners, municipalities, local councils, property owners and residents. The roles of planning boards, municipal councils, the Ontario Land Tribunal, the Ministry of Municipal Affairs and Housing, provincial Cabinet and the Niagara Escarpment Commission in the planning process will be discussed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ENVS 201",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN474",
            "Name": "Special Topics in Planning",
            "Desc": "These courses allow for additions to the program on a short-term basis, and for the development of future permanent courses.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN475",
            "Name": "Special Topics in Planning",
            "Desc": "Course content varies according to instructor availability and demand for specific topics in planning, including field courses. ",
            "Notes": "[Note: Field trip fee may be required.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN477",
            "Name": "Freight Planning and Policy",
            "Desc": "This course critically explores the evolution of freight planning and policy in the urban and regional realms from the early importance of ports to modern global logistics. Emphasis is placed on understanding 1) the theory, fundamental characteristics, and methods of analyzing freight systems, and 2) planning/policy perspectives on freight transportation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN478",
            "Name": "Transit Planning and Operations",
            "Desc": "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions. Models of transit vehicle motion are presented; transit travel times under different travel regimes are derived. Transit scheduling methods are shown. System operational characteristics are defined and quantitative measures of effectiveness are introduced. Transit network planning objectives are identified; actual geometries are qualitatively and quantitatively analyzed. Transit ownership structures and economics are discussed; contemporary ITS applications are presented. Methods for selecting appropriate transit modes are covered. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: CIVE 342 or ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN480",
            "Name": "Theory and Practice of Planning in the U.K.",
            "Desc": "Familiarization with the contribution of U.K. theory and practice to Canadian planning. Study of development of U.K. planning from mid-eighteenth century to present with reference to new town and urban redevelopment. Additional student costs for travel include flight, food and lodging. For information on duration, itinerary and travel costs contact the instructor.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN481",
            "Name": "Geographic Information Systems Project",
            "Desc": "The development, implementation, and presentation of a response to a set of GIS related project requirements is the focus of this course. Students work in small teams to enhance and develop their abilities to work with GIS and related spatial technologies and analytical methods in an advanced project setting. The nature of the project requirements and themes varies with faculty and student strengths and interests. Projects may emphasize development of software applications, use of programming, or advanced GIS analysis methods, and draw from theme areas such as environment studies and management, human and physical geography, or planning.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG/PLAN 387, GEOG/PLAN 381 and ENVS 278",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN483",
            "Name": "Land Development Planning",
            "Desc": "An examination of planning issues related to the design, economics and financing of private land and building construction projects including residential high-rise condominium, low-rise residential subdivision, infill, intensification and brownfield redevelopment and industrial/commercial land development. The course focuses on developer decision-making, analysis of risk, sources of financing, planning, environmental and engineering aspects of land development. This course may include a field component. ",
            "Notes": "[Note: Field trip fee will not exceed $50+HST]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN484",
            "Name": "Physical Infrastructure Planning",
            "Desc": "The need for infrastructure and environmental assessments; the impacts of infrastructure on urban form; core infrastructure concepts; economics of infrastructure costs, finance and pricing. Infrastructure evaluation and management methods.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN485",
            "Name": "Projects, Problems, and Readings in Planning",
            "Desc": "Special planning projects and problems chosen in consultation with instructor. ",
            "Notes": "[Note: Prior to registering for this course, students must arrange with a faculty member to serve as advisor and complete a contract.]",
            "Consent": "Instructor Consent Required",
            "Prereqs": "Prereq: Level at least 3A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN487",
            "Name": "Management Issues in Geographic Information Systems",
            "Desc": "Built around a set of key issues in the management of Geographic Information Systems (GIS). Focuses on middle management concerns and covers topics including GIS needs assessment, benchmarking, the law and spatial data, spatial data warehousing, multi-user GIS modelling and GIS application development.  Uses of GIS in both public and private sector organizations are covered. ",
            "Notes": "[Note: Formerly GEOG/PLAN 555]",
            "Consent": "None",
            "Prereqs": "Prereq: GEOG/PLAN 355 or GEOG/PLAN 381 or GEOG/PLAN 387 or GEOG/PLAN 455.",
            "Coreqs": "None",
            "Antireqs": " Antireq: GEOG/PLAN 555",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PLAN490",
            "Name": "Senior Honours Essay",
            "Desc": "Practical experience in carrying out a research proposal under the direction of a faculty member. The results of this research will be presented in the form of an essay that meets both professional and academic standards.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Planning students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}