{
    "Name": "puremathematics",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "PMATH320",
            "Name": "Euclidean Geometry",
            "Desc": "Euclid's axioms, triangle centres, conic sections, compass-and-straightedge constructions, isometries of the Euclidean plane and of Euclidean space, regular and star-shaped polygons, tessellations of the Euclidean plane, regular and quasi-regular polyhedra, symmetries of polygons and polyhedra, four-dimensional polytopes, sphere packings, and the kissing problem. Applications. ",
            "Notes": "[Note: This course will be of interest to all math students.]",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 106 or 114 or 115 or 136 or 146 or 215 or NE 112) and (MATH\n104 or 109 or 116 or 117 or 124 or 127 or 137 or 147)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH321",
            "Name": "Non-Euclidean Geometry",
            "Desc": "An introduction to three types of non-Euclidean geometry: spherical, projective and hyperbolic geometry. Lines, distances, circles, triangles, and areas in these non-Euclidean spaces. Conic sections in the projective plane. Inversions and orthogonal circles. Models of the hyperbolic plane (such as the Poincaré disc model or the upper-half plane model). Tilings of the hyperbolic plane. ",
            "Notes": "[Note: This course will be of interest to all math students.]",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 106 or 114 or 115 or 136 or 146 or 215 or NE 112) and (MATH 104 or 109 or 116 or 117 or 124 or 127 or 137 or 147).",
            "Coreqs": "None",
            "Antireqs": " Antireq: PMATH 360.",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH330",
            "Name": "Introduction to Mathematical Logic",
            "Desc": "A broad introduction to mathematical logic. The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability. ",
            "Notes": "[Note: PMATH 432 may be substituted for PMATH 330 whenever the latter is a requirement in an Honours plan.]",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 135 or 145) and (MATH 225 or 235 or 245); Not open to Computer Science students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: CS 245/245E, SE 212.",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PMATH331",
            "Name": "Applied Real Analysis",
            "Desc": "Topology of Euclidean spaces, continuity, norms, completeness. Contraction mapping principle. Fourier series. Various applications, for example, to ordinary differential equations, optimization and numerical approximation. ",
            "Notes": "[Note: PMATH 351 may be substituted for AMATH/PMATH 331 whenever the latter is a requirement in an Honours plan. Offered: F,W]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 237 or 247",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH332",
            "Name": "Applied Complex Analysis",
            "Desc": "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications. ",
            "Notes": "[Note: PMATH 352 may be substituted for AMATH/PMATH 332 whenever the latter is a requirement in an Honours plan. Offered: W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 237 or 247.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PHYS 365",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH333",
            "Name": "Introduction to Real Analysis",
            "Desc": "The purpose of the course is to present the familiar concepts of calculus at a rigorous level and to provide students who took the MATH 137/MATH 138/MATH 237 sequence with the background needed to be successful in PMATH 351 and PMATH 352. Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of (MATH 128 with at least 70%), (MATH 138 with at least 60%), MATH 148.",
            "Coreqs": " Coreq: (MATH 235 or 245) and MATH 237.",
            "Antireqs": " Antireq: MATH 247",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH334",
            "Name": "Introduction to Rings and Fields with Applications",
            "Desc": "Rings, ideals, factor rings, homomorphisms, finite and infinite fields, polynomials and roots, field extensions, algebraic numbers, and applications, for example, to Latin squares, finite geometries, geometrical constructions, error-correcting codes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 235 or 245.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH336",
            "Name": "Introduction to Group Theory with Applications",
            "Desc": "Groups, permutation groups, subgroups, homomorphisms, symmetry groups in two and three dimensions, direct products, Polya-Burnside enumeration.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 235 or 245.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH340",
            "Name": "Elementary Number Theory",
            "Desc": "An elementary approach to the theory of numbers; the Euclidean algorithm, congruence equations, multiplicative functions, solutions to Diophantine equations, continued fractions, and rational approximations to real numbers. ",
            "Notes": "[Note: PMATH 440 may be substituted for PMATH 340 whenever the latter is a requirement in an Honours plan.]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 225 or 135 or 145",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH343",
            "Name": "Introduction to the Mathematics of Quantum Information",
            "Desc": "Finite dimensional normed vector spaces and inner product spaces. Positive and normal operators, the spectral theorem, and singular value decomposition. Tensor products, finite dimensional C* algebras, and the GNS representation. Completely positive maps, Stinespring's theorem, the Choi-Jamiolkowski isomorphism, and the Choi-Krauss representation. Entanglement and the Bell and Tsirelson inequalities. Vector states and density matrices, quantum channels, observables, and quantum measurement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 235 or 245) and (AMATH/PMATH 331 or MATH 247 or PMATH 333).",
            "Coreqs": "None",
            "Antireqs": " Antireq: PMATH 399 taken Winter 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH347",
            "Name": "Groups and Rings",
            "Desc": "Groups, subgroups, homomorphisms and quotient groups, isomorphism theorems, group actions, Cayley and Lagrange theorems, permutation groups, Sylow theorems, and the fundamental theorem of finite abelian groups. Elementary properties of rings, subrings, ideals, homomorphisms and quotients, isomorphism theorems, and polynomial rings.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 235 or 245",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH348",
            "Name": "Fields and Galois Theory",
            "Desc": "Unique factorization domains, Gauss's lemma, and Eisenstein's criterion. Fields, algebraic and transcendental extensions, minimal polynomials, splitting fields, and the structure of finite fields. Galois theory. Solvable groups and the insolvability of the quintic.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 347",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH351",
            "Name": "Real Analysis",
            "Desc": "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 247 or PMATH 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH352",
            "Name": "Complex Analysis",
            "Desc": "Analytic functions, Cauchy-Riemann equations, Goursat's theorem, Cauchy's theorems, Morera's theorem, Liouville's theorem, maximum modulus principle, harmonic functions, Schwarz's lemma, isolated singularities, Laurent series, residue theorem.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 247 or PMATH 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH365",
            "Name": "Differential Geometry",
            "Desc": "Submanifolds of Euclidean n-space; vector fields and differential forms; integration on submanifolds and Stokes's Theorem; metrics and geodesics; Gauss-Bonnet Theorem.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 235 or 245) and (MATH 237 or 247)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH370",
            "Name": "Chaos and Fractals",
            "Desc": "The mathematics of iterated functions, properties of discrete dynamical systems, Mandelbrot and Julia sets. ",
            "Notes": "[Note: Programming experience on one computer language with graphical output is recommended.]",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MATH 118, 119, 128, 138, 148) and (One of MATH 114, 115, 136, 146, 225)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH399",
            "Name": "Readings in Pure Mathematics",
            "Desc": "Reading course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH432",
            "Name": "First Order Logic and Computability",
            "Desc": "The concepts of formal provability and logical consequence in first order logic are introduced, and their equivalence is proved in the soundness and completeness theorems. Goedel's incompleteness theorem is discussed, making use of the halting problem of computability theory. Relative computability and the Turing degrees are further studied.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 347",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH433",
            "Name": "Model Theory and Set Theory",
            "Desc": "Model theory: the semantics of first order logic including the compactness theorem and its consequences, elementary embeddings and equivalence, the theory of definable sets and types, quantifier elimination, and omega-stability. Set theory: well-orderings, ordinals, cardinals, Zermelo-Fraenkel axioms, axiom of choice, informal discussion of classes and independence results. ",
            "Notes": "[Note: PMATH 348 is highly recommended.]",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 347",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH440",
            "Name": "Analytic Number Theory",
            "Desc": "Summation methods, analytic theory of the Riemann zeta function, Prime Number Theorem, primitive roots, quadratic reciprocity. Dirichlet characters and infinitude of primes in arithmetic progressions, and assorted topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 352",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH441",
            "Name": "Algebraic Number Theory",
            "Desc": "An introduction to algebraic number theory; unique factorization, Dedekind domains, class numbers, Dirichlet's unit theorem, solutions of Diophantine equations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 348",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH445",
            "Name": "Representations of Finite Groups",
            "Desc": "Basic definitions and examples: subrepresentations and irreducible representations, tensor products of representations. Character theory. Representations as modules over the group ring, Artin-Wedderburn structure theorem for semisimple rings. Induced representations, Frobenius reciprocity, Mackey's irreducibility criterion.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 347",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH446",
            "Name": "Introduction to Commutative Algebra",
            "Desc": "Module theory: classification of finitely generated modules over PIDs, exact sequences and tensor products, algebras, localisation, chain conditions. Primary decomposition, integral extensions, Noether's normalisation lemma, and Hilbert's Nullstellensatz.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 348",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH450",
            "Name": "Lebesgue Integration and Fourier Analysis",
            "Desc": "Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces. Separable Hilbert space, orthonormal bases. Fourier analysis on the circle, Dirichlet kernel, Riemann-Lebesgue lemma, Fejer's theorem, and convergence of Fourier series.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 351 with a grade of at least of 60%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH451",
            "Name": "Measure and Integration",
            "Desc": "General measures, measurability, Caratheodory Extension theorem and construction of measures, integration theory, convergence theorems, Lp-spaces, absolute continuity, differentiation of monotone functions, Radon-Nikodym theorem, product measures, Fubini's theorem, signed measures, Urysohn's lemma, Riesz Representation theorems for classical Banach spaces.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 450 with a grade of at least 60%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "PMATH453",
            "Name": "Functional Analysis",
            "Desc": "Banach and Hilbert spaces, bounded linear maps, Hahn-Banach theorem, open mapping theorem, closed graph theorem, topologies, nets, Hausdorff spaces, Tietze extension theorem, dual spaces, weak topologies, Tychonoff's theorem, Banach-Alaoglu theorem, reflexive spaces.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 450",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH464",
            "Name": "Introduction to Algebraic Geometry",
            "Desc": "An introduction to algebraic geometry through the theory of algebraic curves. General algebraic geometry: affine and projective algebraic sets, Hilbert's Nullstellensatz, co-ordinate rings, polynomial maps, rational functions and local rings. Algebraic curves: affine and projective plane curves, tangency and multiplicity, intersection numbers, Bezout's theorem and divisor class groups.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 348",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH465",
            "Name": "Smooth Manifolds",
            "Desc": "Point-set topology; smooth manifolds, smooth maps, and tangent vectors; the tangent and cotangent bundles; vector fields, tensor fields, and differential forms; Stokes's theorem; integral curves, Lie derivatives, the Frobenius theorem; de Rham cohomology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 365",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH467",
            "Name": "Algebraic Topology",
            "Desc": "Topological spaces and topological manifolds; quotient spaces; cut and paste constructions; classification of two-dimensional manifolds; fundamental group; homology groups. Additional topics may include: covering spaces; homotopy theory; selected applications to knots and combinatorial group theory.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PMATH 347, 351.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PMATH499",
            "Name": "Readings in Pure Mathematics",
            "Desc": "Reading course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}