{
    "Name": "politicalscience",
    "Notes": "Some of the courses listed are not offered in the current\r\nacademic year. Precise information on course offerings and more\r\ndetailed descriptions of the content of Political Science courses are\r\navailable in the Department at the time students select their classes.",
    "Courses": [
        {
            "courseCode": "PSCI100",
            "Name": "Power, Politics, and Policy: An Introduction",
            "Desc": "What are the key political issues in Canada and abroad? Students will undertake comparative study of ideas, institutions, and interests central to issues of policy and politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI150",
            "Name": "Introduction to Global Politics",
            "Desc": "What are the politics underlying the contemporary distribution and governance of global wealth and power? This course provides students with an introduction to core issues in the study of global politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI225",
            "Name": "Classics in Political Thought",
            "Desc": "Where do the core tenets of Western political philosophy come from? In this course students will trace the development of political philosophy by examining Ancient Greek plays (e.g., Antigone, Medea) and foundational political texts (e.g., Plato's Republic, Aristotle's Politics) which set the stage for modern Western political thought (Machiavelli and after).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI226",
            "Name": "Modern Political Thought",
            "Desc": "Where do contemporary ideas about political obligation, equality, freedom, and justice originate? By studying some of the most influential texts in Western political theory that emerged from the 1500s to the 1800s, students will consider such concepts as social contract theory (Hobbes, Locke, Rousseau), personal liberty (Mill), and structural-institutional critiques (Marx).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 150, 225/CLAS 225",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI228",
            "Name": "Introduction to Indigenous Political Thought",
            "Desc": "In this course students will learn theories, concepts, and topics in contemporary Indigenous political thought in Canada and North America including settler colonialism, assimilation policies, gender and sexuality, ecology, law, treaties, reconciliation, and decolonization. By exploring a variety of sources, students will understand and engage critically with structures, interests, and processes of settler-colonial institutions in North America. Students will learn to articulate diverse perspectives from Indigenous peoples critical of such institutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI231",
            "Name": "Government and Business",
            "Desc": "How do the relations between government, business, and civil society function? Focusing on Canada in comparative context, students will study national and sub-national government policies relating to key debates in socio-economic development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI244",
            "Name": "Irrational and Rational Choices in Politics",
            "Desc": "Why do some powerful dictators allow independent legislatures and parties to exist? Why are the frontlines of some civil wars spared from violence? Why do the same people sometimes choose language to define their ethnic identity but then choose religion at other times? Students will examine apparently random, puzzling, and even seemingly irrational choices made in political life. This course uses a rational choice framework to provide a unified explanation for some of these puzzling questions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 110, 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI250",
            "Name": "The Comparative Politics of State and Nation",
            "Desc": "How do states and regimes interact with cultural and national identity? In this core comparative politics course, students will assess various approaches to the study of politics within states, emphasizing political developments, institutions, and processes in countries both across the Global South and advanced industrial worlds.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 110, 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI252",
            "Name": "Global South",
            "Desc": "Why are some countries in the world poor and others rich? Why have some developing countries experienced rapid economic growth in recent years while others remain stagnant? What are some of the costs and benefits of development for societies and the environment? Students will explore multiple factors shaping economic growth, and political and social development in the Global South.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 150 or INTST 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI253",
            "Name": "Religion and Politics",
            "Desc": "Religion continues to influence politics around the world as seen in the return of religious nationalism, religious opposition to globalization, populism and religion, and grassroots political movements for social change. Considering both historical and contemporary cases, students critically analyze how religion shapes - and is shaped by - politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI254",
            "Name": "The Political Documentary",
            "Desc": "What role do political documentaries play in political thought, political practice, and the public sphere? Students will critically assess a range of documentary films made by government agencies, professional filmmakers, and activists.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI255",
            "Name": "Political Economy of Rich Countries",
            "Desc": "Students will gain an understanding about the main similarities and differences between the major economies in the rich world. Through a variety of research-based reading and data analysis, students will gain the skills to compare political and economy systems across countries and time. Students will critically reflect on issues such as poverty, inequality, gendered labour market activity, and technological disruption, to understand the structures, interests, and processes that shape the well-being of rich countries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 100",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI257",
            "Name": "Introduction to Middle East Politics",
            "Desc": "An introduction to modern Middle East political dynamics and the important role this strategic region has played in world affairs. The course examines Middle Eastern states, their domestic political challenges, geopolitical complexities, and relations with the international political community.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HIST 230/PSCI 257 taken before fall 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI259",
            "Name": "Government and Politics of Asia",
            "Desc": "How are countries in Asia (including East, South, and South East Asia) governed and what policies have helped make them one of the fastest growing economic centers in the world in recent decades? Using a comparative perspective of the political economy of major countries in Asia, students will study their political histories and government institutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 110, 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI260",
            "Name": "Canadian Government & Politics",
            "Desc": "An examination of Canada's federal system, parliamentary government, and national political processes, such as the party system, interest groups, the electoral system, and voting behavior.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 100, 101, 110",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI264",
            "Name": "American Government and Politics",
            "Desc": "How do the key institutions of the United States' federal government function? Students will study the crucial elements of national political processes in America. Where appropriate, the course will focus on a particular upcoming electoral event.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI277",
            "Name": "International Relations of East Asia",
            "Desc": "This course explores key topics in the international relations of East Asia after World War 2. Classes examine literature on major developments of East Asian relations, including the Cold War, East Asian regionalism, and the foreign policies of China, Japan, and Korea.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI281",
            "Name": "World Politics",
            "Desc": "What patterns the distribution of power around the globe? When, where, and why does violent conflict or war break out? When, where, and why do co-operation and peace prevail? Students will study how billions of people live together in various degrees of harmony and disharmony.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 150 or INTST 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI282",
            "Name": "Foreign Policy",
            "Desc": "What trends prevail in foreign policy across states? Using a comparative approach by focusing on particular country-specific issues and approaches, students will explore important influences on the development of foreign policies and on the differentiation of big, middle, and small powers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 150 or INTST 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI283",
            "Name": "International Political Economy",
            "Desc": "How is the world economy governed? Students will study the politics of international trade, global money and finance, foreign investment, global agriculture and resources, regional economic integration, global inequality and development, and international economic governance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI or ECON, or INTST 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI290",
            "Name": "Special Topics in Political Science",
            "Desc": "This topics course will be offered from time to time to cover areas of emerging research and teaching interest. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI299",
            "Name": "Political Science Beyond the Classroom",
            "Desc": "Course topics vary. Students will focus on learning about politics through experiences both within and beyond the classroom. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI300",
            "Name": "Theories of Political Economy",
            "Desc": "What is the relationship between politics and economics, power and wealth, states and markets? Students will study influential historical and contemporary works that shape political economy debates in the contemporary world.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 110 or 150; ECON 101 or 102; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI301",
            "Name": "Canadian Political Economy",
            "Desc": "What is the relationship between Canadian politics and economics? How do states and markets, and governments and businesses interact? Focusing on theoretical understandings of historical Canadian political-economic development, students will examine a range of current issues. Topics may include the evolution of the Canadian welfare state, labour relations, capitalist (re)production, and gendered and environmental concerns.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 231; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI302",
            "Name": "Local Government",
            "Desc": "How do Canadian local governments function? Students will study the relationship between municipalities and other levels of government, current governance challenges facing local officials, and the design and implementation of public policy within a complex local political environment.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI303",
            "Name": "Political Economy of the Environment",
            "Desc": "How do major political actors, with diverging interests, resources, and strategies, influence environmental policy and outcomes? Students will study major historical and contemporary environmental debates in Canada, drawing on insights from comparative cases.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI304",
            "Name": "Pan-African Global Politics",
            "Desc": "This course examines Africa's role in international order and offers an in-depth study of the evolution of Africa's global political relations. Engaging with concepts related to political and economic underdevelopment, post coloniality, and early Pan-African political thought and practice, students will be challenged to develop and apply an historical understanding of Africa's past political relations to analyses of contemporary African multilateralism, global Pan-Africanism, and increased political and economic engagement with world nations. Students will engage with current concepts of Pan-African politics and envision prospects of future Black global leadership.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BLKST 101 or BLKST 102; Level at least 2A or students pursuing the Diploma in Black Studies or the Diploma in Fundamentals of Anti-Racist Communication",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI310",
            "Name": "Politics and Diplomacy of Contemporary Japan",
            "Desc": "This course surveys several key topics in the politics and diplomacy of contemporary Japan, particularly in its relations with its Asia-Pacific neighbours. Topics may include the Pacific War and its legacies, the Japan-US security alliance, the Okinawa problem, and Japan-Canada relations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI314",
            "Name": "Quantitative Analysis",
            "Desc": "How do quantitative methods contribute to political science? Students will study a range of quantitative methods, with an emphasis on practical applications. The course requires only a rudimentary understanding of mathematics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to Math students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 280, BIOL 361, ECON 221, ENVS 278, ISS/SDS 250A/B, 250R, KIN 222, 232, PSYCH 292, REC 371, SMF 230, SOC/LS 280, STAT 202, 204, 206, 211, 221, 231, 241, SWREN 205R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI315",
            "Name": "Research Design in Political Science",
            "Desc": "What makes political science political science? Drawing on techniques from across various fields of political research, students will study the fundamentals of research design in political science, contrasting these approaches with dominant approaches in other closely related disciplines.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.5 unit in PSCI; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI324",
            "Name": "Issues in Contemporary Political Theory",
            "Desc": "What is freedom? What does justice require? How does equality matter? Students will study 20th- and 21st-century thinkers' interpretations of these, and other, key political values. Theoretical analysis will be grounded in current problems, such as poverty, racism, sexism, global inequalities, colonialism, and environmental degradation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI326",
            "Name": "Multiculturalism and Democracy: Within, Against, and Beyond",
            "Desc": "In this course students will gain an understanding and learn to articulate diverse perspectives on democracy, multiculturalism, and the politics of recognition as they are understood within modern political thought. Through reading and analyzing a variety of sources, and engaging in original research, students will consider and discuss multiple ways of seeing these topics. Student will learn both history of Hegelian, liberal, and multicultural concepts which have shaped normative Canadian politics as well as to apply feminist, decolonial, Indigenous, and other critiques to critically reflect on and understand the limits of such paradigms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI at the 200-level or above",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI331",
            "Name": "Public Administration",
            "Desc": "What is the role of the public service in Canada? Students will study the structures and functions of Canada's political system by examining the ways in which the public service relates to other institutions, such as the political executive and the legislature.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI334",
            "Name": "Public Policy",
            "Desc": "An examination of the policy-making process in liberal democratic societies, and an evaluation of the tools employed by policy analysts to understand that process.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 250, 255, 264, LS 206/PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI348",
            "Name": "Protests, Movements, and Revolutions",
            "Desc": "This course is about different forms of political contention including protests, social movements, and revolutions. It explores what motivates people to dissent, what strategies and tactics are employed to achieve objectives, what factors influence the outcomes of social movements, and what is the government response to these demands for change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 390 taken fall 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI351",
            "Name": "Power Sharing in Divided Societies",
            "Desc": "How does the sharing of power ease or worsen conflict within society? Students will study different forms of power sharing, including pluralism, corporatism, consociationalism, and federalism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI353",
            "Name": "Politics in Russia",
            "Desc": "What explains the successes and failures of democratization in Russia? Students will undertake the comparative study of political processes, institutions, and reforms in Russia, focusing on the dilemmas posed by democratization and authoritarianism. ",
            "Notes": "[Note: One of PSCI 244, 250, 252, 255, 259, 260, 264 strongly recommended]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI355",
            "Name": "Russia and its Neighbours",
            "Desc": "How has Russia interacted with its many neighbours and how does it manage those relationships today? Students will study a range of topics including, but not limited to, nationalism and ethnicity, nuclear weapons, NATO expansion, the colour revolutions, energy politics, Baltic regional security, German-Russian relations, and the rise of China. Where appropriate, the course will include a crisis simulation, pushing students to think strategically.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI358",
            "Name": "Political Change in China",
            "Desc": "How does political change in China occur? Students will study China's political history, contemporary political institutions, political economy, and foreign relations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI359",
            "Name": "Politics of South Asia",
            "Desc": "How do international and domestic politics interact in South Asia? Students will study bilateral relations between countries within South Asia and the involvement of external powers, such as the U.S. and China, and delve into the challenges of political development in the region as they are shaped by class, ethnicity, religion, and gender.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI360",
            "Name": "Topics in Canadian Government and Politics",
            "Desc": "Course topics vary. Topics may include provincial politics, the federal system, parliamentary government, Indigenous self-government, and ethnicity and multiculturalism. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 206/PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI362",
            "Name": "Politics of Indigenous Peoples",
            "Desc": "Students will gain an understanding of and learn to articulate diverse perspectives on contemporary Indigenous issues, politics, and critical theory by examining these issues from the perspective of Indigenous North American peoples. Through a variety of research-based reading and writing assignments, students will critically reflect on colonialism, power, and state policy to understand the structures, interests, and processes that shape Indigenous struggles in Canada and North America.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI course at the 200-level or above; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI363",
            "Name": "Canadian Constitutional Law",
            "Desc": "An introduction to the nature and basic principles of constitutional law. Explores constitutional conventions, the distribution of powers in the Canadian federalism, Aboriginal and treaty rights, and the Charter of Rights and Freedoms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101 or LS 206/ PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI367",
            "Name": "Topics in American Government and Politics",
            "Desc": "How does the U.S. government function? Students will study the core institutions of American government, examining their implications for its politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 264",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI368",
            "Name": "Global Discourses on Colonialism",
            "Desc": "In this course students will the learn the history of colonialism. Through the study of various academic and/or peer-reviewed materials, and by engaging in original research, students will be able to demonstrate familiarity with diverse approaches to defining colonialism and its role in global politics. Students will further consider the historical evolution of colonialism as it has changed over time, including notions of postcolonialism, neocolonialism, and coloniality, as well as distinct manifestations of colonialism such as settler colonialism. Students will also engage with considerations of the social, economic, and political interplay of colonialism and other phenomena such as political economy, race, gender and sexuality, orientalism, and culture.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI at the 200-level or above",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI369",
            "Name": "The Politics of Decolonization",
            "Desc": "This course examines the break-up of empires in the mid/late 20th century, and assesses how the colonial experience has shaped relations between and among former imperial polities to the present. Focus is given to questions of political identity in colonial and post-colonial societies, and how these identities shape current political challenges.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI370",
            "Name": "Gender and Politics",
            "Desc": "How does gender inform - and challenge - political ideas? Students will study the interrelationship of important concepts such as power, equality, oppression, representation, intersectionality, and autonomy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI or GSJ; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI373",
            "Name": "Political Parties, Elections, and Political Marketing",
            "Desc": "What is the role of political parties and electoral competition in established democracies? Students will focus on the practice of political marketing and its implications for democracy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 231, 250, 255, 264, LS 206/PSCI 260; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI375",
            "Name": "Transnational Migration",
            "Desc": "This survey of transnational migration in the contemporary moment examines the reasons people have migrated voluntarily (e.g., as migrant workers) and involuntarily (e.g., as refugees), and how international and domestic law and policies affect, enable, and/or criminalize the movements of people across state borders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 250, 252, 255, 259, 264, 281, LS 206/PSCI 260; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI380",
            "Name": "Political Economy of International Trade",
            "Desc": "What determines international trade policies? Through an examination of alternative theories and through empirical study, students will gain an understanding of how institutions, interests, and ideas shape countries' trade policies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 283.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 402",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI382",
            "Name": "Politics of Canadian Foreign Policy",
            "Desc": "What forces shape Canadian foreign policy? Students will study both the domestic and international factors that influence Canada's foreign policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 206/PSCI 260; PSCI 281 or 282",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI384",
            "Name": "Technology and International Security",
            "Desc": "What is the relationship between technology and international security? How have technological innovations altered national security strategy and military competition in world politics? Students will be exposed to a number of case studies, including motorized armour, aircraft, nuclear weapons, submarines, autonomous weapons, digital communication, cyber security, biotechnology, and new media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI385",
            "Name": "Chinese Foreign Policy Since 1949",
            "Desc": "This course examines the major elements and evolution of Chinese foreign policy since 1949 and China's external relations in the context of rising Chinese power.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI387",
            "Name": "Globalization",
            "Desc": "How is globalization changing the nature of politics? Students will examine leading political debates surrounding the forces that promote and resist global integration in the contemporary age.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 150 or INTST 101; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI389",
            "Name": "Global Governance",
            "Desc": "Global governance is governing beyond the state.  An examination of diverse problems - global warming, international human rights, terrorism, property rights disputes, and health crises - which transcend borders and demand cooperative global solutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI390",
            "Name": "Special Studies",
            "Desc": "Course topics vary. Past examples include climate change justice and transnational migration. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in PSCI; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI391",
            "Name": "Special Studies",
            "Desc": "The special studies course is an opportunity for students to study a specific topic not concurrently taught in a focused manner in the department's regular course offerings. Topics may vary based on student interest. Past examples include political economy of energy in Canada, and dynastic politics in Pakistan. Learning in this course is self-directed, which means that students are required to plan, propose, and carry out their program of study with supervision from a faculty advisor. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a\ntotal of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI400",
            "Name": "Special Honours Essay",
            "Desc": "Honours Political Science students wishing to undertake a senior honours essay and to complete it in one term should consult the department's undergraduate officer.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3B Political Science majors; Political Science average at least 75%.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 499A, PSCI 499B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI403",
            "Name": "Topics in Politics and Business",
            "Desc": "Course topics vary. Topics may include accumulation, crisis, and the state and the ups and downs of capitalism. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Political Science students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI404",
            "Name": "Globalization, International Business, and Development",
            "Desc": "How does international business influence development in the context of economic globalization? Students will study contending perspectives on how international business practices have affected economic, social, and political development in host countries, home countries, and the world in general.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Two of PSCI 252, 283, 300, 350, 387, PSCI 389/LS 366",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI405",
            "Name": "Chinese Political Economy",
            "Desc": "How has China been able to achieve decades of sustained economic growth? Students will study various aspects of the deep economic, political, and social changes associated with China's transition from an insular command economy to an increasingly internationalized and market-oriented economy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 259 or 358",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI420",
            "Name": "Gender and Global Politics",
            "Desc": "Does looking at the world through the lens of gender change how we see the state, sovereignty, diplomacy, security, trade, migration, globalization, governance, and other foundational concepts in global politics? Students will review feminist theories of politics, with a particular focus on international relations and global governance; examine how gender shapes the roles and experiences of women and men in global politics; and discuss how to do feminist research.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 281, 282, 283, WS 202.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 490 (LEC 002) taken winter 2015",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI421",
            "Name": "Justice and Gender",
            "Desc": "Theories of justice are concerned with the distribution of the basic goods of society - money, power, status, leisure, and so on. This course considers how the gender system fares from the standpoint of liberal justice, and to what extent the promises of liberal justice can be used to overturn the unequal treatment of women.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 225/CLAS 225, PSCI 226, 370, LS 201; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI423",
            "Name": "Democratic Theory and Practice",
            "Desc": "Students will learn the normative foundations of democracy and the ways these do (and should) impact institutional design and democratic practices. Through an examination of systemic racism, sexism, and settler colonialism, students will articulate their understanding of the limits of contemporary democratic theory. Students will consider perspectives arising from an examination of inclusion and exclusion, equality, rights, democratic organization, protest, and communication, and will apply their knowledge to analyze problems and suggest solutions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI426",
            "Name": "Selected Subjects in Political Philosophy",
            "Desc": "Course topics vary. Past examples include genetics and justice. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI428",
            "Name": "The State and Economic Life",
            "Desc": "What is the relationship between the state and economic life? Students will study current debates and competing ideological traditions as these conceptualize the relationship between the state and economic life.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 2.0 units in PSCI; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI431",
            "Name": "Canadian Public Policy",
            "Desc": "Students will examine major trends in contemporary Canadian public policy, with course topic varying to reflect pressing policy issues. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 334; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI432",
            "Name": "Global Environmental Governance",
            "Desc": "Examination of the ways in which world society is striving to address environmental challenges by means of \"global governance\" - that is, international organizations and institutions intended to deal with these challenges. The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI433",
            "Name": "Topics in Public Administration",
            "Desc": "Students will examine the major issues and debates in public administration, with the course topic varying to reflect recent developments in Canada and in the world. A variety of research-based assignments are tailored to help students hone their skills in writing and presenting for a policy-making and public administration audience. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI437",
            "Name": "Working with Data in Politics",
            "Desc": "This course will help students to develop the specialized skills required to analyze political data, and to use data in order to answer political questions. For example, where should one go to collect political data? How does one use data to understand political trends, to predict electoral victories, or identify polarizing tendencies in society? The course also trains students on the use of software to process data.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A or one of PSCI 100, PSCI 150, ARTS 280",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI439",
            "Name": "Global Social Policy",
            "Desc": "Students will gain an understanding of and learn to articulate diverse perspectives on governance responses to social policy issues at the supranational regional and global levels by examining these responses from gender-based, North-South, and Indigenous perspectives. Through a variety of reading and writing assignments, students will critically reflect on both the normative and power-based underpinnings of global social governance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI450",
            "Name": "Kings, Generals, and Tyrants",
            "Desc": "What are the differences between non-democracies like China, hybrid regimes like Russia, one-party states like Singapore, patrimonial and personalist states in Africa, and military dictatorships in Latin America? Students will study how political power is structured in authoritarian regimes and how it shapes the relationship between state and society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 250",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI452",
            "Name": "Parties and Elections",
            "Desc": "Students will learn about the dynamics of political parties and elections around the world. Through a variety of research-based reading and writing assignments, students will gain the skills to analyze party competition, voter behaviour, and election outcomes. Students will critically reflect on issues such as ideology, the role of government, economic disruption, and corruption, to better understand the structures, interests, and processes that drive party competition and election outcomes in both rich and poor countries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI455",
            "Name": "Comparative Political Economy",
            "Desc": "What are the social and economic consequences of politics, including its influence on poverty, inequality, growth, and declinate? Focusing on advanced industrialized countries, students will survey the key topics in political economy including the influence of politics on social and economic policies in relation to welfare states, labour markets, training, corporate governance, and technological innovation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI456",
            "Name": "Ethnic Conflict and Conflict Resolution",
            "Desc": "What causes ethnic conflict? What strategies do states use to manage or resolve ethnic conflict? Students will undertake a comprehensive review of such strategies including both those that are morally unacceptable and those that are morally desirable.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI460",
            "Name": "The Cultural Politics of Israel/Palestine",
            "Desc": "What are the key features of the cultural politics that underlie the Israel/Palestine conflict? Students will study the everyday lives of those affected by the violence to understand the complex narratives of violence, peace, and human rights that circulate across the region, as well as among those in diaspora and exile.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI461",
            "Name": "Canadian National Politics",
            "Desc": "Course topics vary. Past examples include the health (or ill-health) of Canadian democracy. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: LS 206/PSCI 260; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI462",
            "Name": "Indigenous Political Theory",
            "Desc": "In this course students will develop familiarity with key concepts such as dispossession, elimination, and the politics of refusal, and situate them in a context of differing ideas regarding authority and contrasting legal orders. The role of these concepts in the political thought of Indigenous peoples and movements will be critically assessed. Students will demonstrate their learning through both oral and written assignments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI463",
            "Name": "Rights and Public Policy",
            "Desc": "An examination of the role that rights and rights discourse plays in public policy development and policy change. Examines Canadian public policy in relation to the Charter of Rights and Freedoms and human rights legislation, as well as cases in comparative context.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: LS 101 or LS 206/ PSCI 260",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI470",
            "Name": "The Body Politic",
            "Desc": "This course examines the body as a site of governance in politics and public policy, exploring the relationships between how certain people(s) come to be governed as \"groups of bodies\" (e.g., racialized bodies, Indigenous bodies, reproductive bodies) and the regulation of body parts (e.g., blood, skin). Throughout the course, students engage in a variety of assignments aimed at different audiences (e.g., academic, public, policy makers) to gain an understanding of the specific relationship between macro and micro approaches to the governance of the body, and the influence of related law and policy on experiences of (in)equality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 490 SEM 001 winter 2022, LEC 041 winter 2021 LEC 001 winter 2020; GSJ 472 SEM 001 winter 2020, SEM 001 winter 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI472",
            "Name": "Women and Public Policy",
            "Desc": "How, if at all, do public policies meet women's needs? How do women experience public policies? Reviewing developments in Canada and elsewhere, students will reflect on the significance of feminist approaches to public policy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI479",
            "Name": "International Political Economy of Asia",
            "Desc": "What are the political and economic implications of growing interdependence in the region? Students will study patterns of economic development in Asia at the national level.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 259 or 283",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI480",
            "Name": "China and Global Governance",
            "Desc": "Has China's rising power changed it from a rule-taker to a rule-maker in global governance? This course examines China's involvement in global governance on a range of issues (e.g., security, economy, human rights, the environment, and social policy) in light of China's evolving preferences, capabilities, and relations with the rest of the world.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI481",
            "Name": "Interstate War",
            "Desc": "What political forces shape war and conflict? Course topics will vary, depending on the instructor and current events. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 281 or 282; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI482",
            "Name": "Critical Security Studies",
            "Desc": "This course reviews critical analytical models for the study of security and covers a range of issues which might be considered non-traditional including environmental security, public safety, cyber security, and counter-terrorism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 281 or 282; Level at least 4A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI485",
            "Name": "Selected Topics in International Political Economy",
            "Desc": "Students will study particular issues of relevance to the latest debates in the field of international political economy. Topics may include the politics of global money and finance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 283 or 387; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI486",
            "Name": "Special Topics in International Diplomacy",
            "Desc": "What are the key issues within, and perspectives on, diplomacy? Students will study public diplomacy, the use of technological innovation such as cyber-diplomacy, the widening definitions of diplomacy, multilateral diplomacy, and \"niche\" diplomacy. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of PSCI 281, 282, 283; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI487",
            "Name": "International Relations Theory",
            "Desc": "Students will examine the major schools of international relations theory with attention paid to positivist and critical approaches.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: PSCI 281 or 282; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI488",
            "Name": "Global Food and Agricultural Politics",
            "Desc": "This course examines the global food and agriculture system. Specific themes to be covered include political and governance issues related to the Green Revolution, global food corporations, agricultural trade liberalization, food aid, international agricultural assistance, the global agro-chemical industry, and agricultural bio-technology.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI490",
            "Name": "Special Subjects",
            "Desc": "Course topics vary. Topics may include international trade and cultural literacy, and the practice of politics. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.5 unit in PSCI; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI491",
            "Name": "Special Subjects",
            "Desc": "Course topics vary. Topics may include the ethics of war, the 2018 U.S. election, and U.S. foreign policy. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.5 unit in PSCI; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI493",
            "Name": "Field Course",
            "Desc": "A combination of academic study and field experience that expose students to \"real-world\" political scenarios, including important political gatherings, such as the meetings of the International Monetary Fund/World Bank in Washington, DC; or sites of political significance, such as Israel/Palestine. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times. Course will be graded on a CR/NCR basis. Additional fees required.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI494",
            "Name": "Current Issues in Political Science",
            "Desc": "Students in this course attend talks or conferences, monitor the media, and do independent research to investigate how a broad concept in political science plays out in contemporary politics, policy, and governance. Students will complete assignments and have the opportunity to share their experiences with other students.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Political Science majors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 495, 496, 497, 497A, 497B, 498A, 498B, 498C",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI495",
            "Name": "Research Apprenticeship in Political Science",
            "Desc": "Research apprenticeship in which students assist a political science professor with a research project. Students will complete assignments, share their experiences with other students, and complete a final project related to their research apprenticeship.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Political Science majors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 494, 496, 497, 497A, 497B, 498A, 498B, 498C",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI496",
            "Name": "Civic Engagement in Political Science",
            "Desc": "Students participate in a civic engagement experience and reflect on how concepts in political science help to illuminate it. Students may also participate in a seminar in which they complete guided reflections, share their experiences with other students, and complete a final project related to their civic engagement experience.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Political Science majors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 494, 495, 497, 497A, 497B, 498A, 498B, 498C",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI497",
            "Name": "Study Abroad Experience",
            "Desc": "While participating in a study abroad experience, students will complete reflections and a project that integrates what they learned while studying abroad with contemporary politics, policy, and governance. ",
            "Notes": "[Note: Students enrolled in this course must also be registered in a university-sanctioned exchange or study abroad program.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Political Science majors.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSCI 494, 495, 497, 497A, 497B, 498A, 498B, 498C",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI499A",
            "Name": "Special Honours Essay",
            "Desc": "Honours Political Science students wishing to undertake a senior honours essay in their fourth year should consult the department's undergraduate officer. ",
            "Notes": "[Note: A numeric grade for PSCI 499A will be submitted only after the completion of PSCI 499B.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3B Political Science majors; Political Science average at least 75%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "PSCI499B",
            "Name": "Special Honours Essay",
            "Desc": "Honours Political Science students wishing to undertake a senior honours essay in their fourth year should consult the department's undergraduate officer.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: PSCI 499A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}