{
    "Name": "religiousstudies",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "RS100",
            "Name": "Religions of Asia",
            "Desc": "An introduction to religious traditions of Asia, including Hinduism, Buddhism, and East Asian traditions. Further topics may include Sikhism, Jainism, and Shinto. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS101",
            "Name": "Introductory Ancient Greek 1",
            "Desc": "This course is designed for students beginning the study of ancient Greek. It covers the foundational grammar of Attic and Hellenistic Greek and is the first step in preparing students to read original ancient Greek texts for the study of classical studies and religious studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: GRK/RS 133",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS102",
            "Name": "Introductory Ancient Greek 2",
            "Desc": "This course is a continuation of GRK 101/RS 101. The majority of the rules of ancient Greek grammar will be covered by the end of the course. Students will begin to read more complex ancient Greek texts relevant to the study of classical studies and religious studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GRK 101/RS 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS110",
            "Name": "Religions of the West",
            "Desc": "Encounter with Judaism, Christianity, and Islam: the characteristics and interaction of the three major religious traditions originating in the Middle East that have shaped the image of the Western World. ",
            "Notes": "[Note:  This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS121",
            "Name": "Evil",
            "Desc": "How do the religions of the world define evil? How do they suggest it can be overcome? Classical and modern writers from Judaism, Christianity, Buddhism, and Hinduism will be considered. ",
            "Notes": "[Note:  This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS123",
            "Name": "Monsters and Magic in Japanese Popular Culture",
            "Desc": "An examination of the roles played by monsters, magic, and supernatural creatures in Japanese popular culture, with attention to their treatment in Buddhism, Shinto, Daoism, and folk practices. Topics include modern-day creations such as Godzilla and Pokemon and traditional beings such as deities, ghosts, angry spirits, goblins, and shapeshifters.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS150",
            "Name": "Christian Ethics",
            "Desc": "An introduction to Christian ethical theory and practice and their implications for personal and social living. Case studies will investigate sexual morality, business and medical ethics, environmental issues, violence and non-violence, and family life. ",
            "Notes": "[Note:  This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS180",
            "Name": "Love and Friendship",
            "Desc": "A study of the significance of love and friendship in classical and contemporary religious writers. We will consider questions such as, \"Why are friendship and love important for human living?\" and \"Is friendship with God a possibility?\" ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS201",
            "Name": "Religions of East Asia",
            "Desc": "An examination of the leading religious and philosophical ideas that have shaped the cultures and histories of East Asia: China, Korea, and Japan. Folk, Shamanic, Confucian, Daoist, Shinto, and Buddhist traditions are examined. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS203",
            "Name": "Hinduism",
            "Desc": "A study of the development of religious thought in India from the Vedic Period to the present. The course will combine a historical survey with a study of representative texts from the religious, philosophical, social, and political thought of the Hindus. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS204",
            "Name": "Buddhism",
            "Desc": "An introduction to the unifying beliefs and philosophical presuppositions of the Buddhist world-view, and an overview of the diverse forms of Buddhism in South and South-East Asia, Tibet, China, and Japan. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS206",
            "Name": "Japanese Religions",
            "Desc": "An examination of religious phenomena in the history of Japan, including their impact on art, literature, philosophy, and politics. Buddhism, Shinto, Confucianism, folk beliefs, new religious movements, and other traditions are explored. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS207",
            "Name": "Mindfulness and Meditation",
            "Desc": "What is mindfulness? This course examines the origins and contemporary use of mindfulness and other forms of meditation. Topics include major methods and teachers of meditation, its use in Buddhist and non-Buddhist contexts, and applications in education, medicine, work, and more.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS208",
            "Name": "Religions of India",
            "Desc": "This course examines the religions of India, including Hinduism, Jainism, Buddhism, and Sikhism. It also addresses Islam, Zoroastrianism, Judaism, and Christianity, which came to India through conquest, travel, or spiritual encounters. It will focus on their cultural context, significance, connections, and conflict among them, both in history and India today.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS209",
            "Name": "Jews and Jewishness",
            "Desc": "This course examines the central elements that make up contemporary Jewish identity/identities, traditional and otherwise, with particular focus on the North American Jewish experience and the nature of Jewish modernity. It explores historical, literary, religious, and social issues that have contributed to the formation of these identities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 114/RS 114",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS210",
            "Name": "Judaism",
            "Desc": "An introduction to the religious tradition of the Jews in terms of beliefs, practices, ideals, and institutions from the beginning to the present time. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS211",
            "Name": "Jewish Responses to the Holocaust",
            "Desc": "The catastrophe and devastation of the Holocaust and the radical nature of its evil demanded responses within contemporary Jewish thought, identity, and experience. This course will explore philosophical, theological (Jewish law, rabbinic), literary (novels, poetry, memoirs, plays), and artistic (museums, memorials) attempts to deal with the issues the Holocaust raises. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS212",
            "Name": "Great Jewish Books",
            "Desc": "Jews are a people of many books. Over the centuries challenges to their faith and very existence have provoked various responses. From the Bible to contemporary times, this course comprehensively examines the history of Jewish thought through essential books that offer radically divergent conceptions of Jewishness and Judaism.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 125",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS216",
            "Name": "Islam",
            "Desc": "An introduction to the Islamic faith and practice, with a review of the development, achievements, and impact of the Muslim community from Muhammad the Prophet to the present day. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS218",
            "Name": "Seduction, Rivalry, and Dysfunction in the Bible",
            "Desc": "Students will be introduced to the Hebrew Bible (Old Testament) by way of selected readings which deal with a particular aspect of the human predicament. The focus will be on exploring relationships via narrative passages in the Old Testament and particularly in the Book of Genesis. The following relationships will be discussed: spousal; human/God; parent/child; siblings; gender issues in narratives of rape, incest, seduction, and dominance. The focus of this course will be more on select specific themes rather than an overview of many themes.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 120/RS 111",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS219",
            "Name": "Religion in America",
            "Desc": "The course examines religion in the American context regarding issues like secularization, the nature and the influence of sects (e.g., Mormonism, Pentecostalism), Protestant revivalism and televangelism, and the impact of non-Christian traditions (e.g., Buddhism, Islam). ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS220",
            "Name": "Religion and Politics",
            "Desc": "Religion continues to influence politics around the world as seen in the return of religious nationalism, religious opposition to globalization, populism and religion, and grassroots political movements for social change. Considering both historical and contemporary cases, students critically analyze how religion shapes - and is shaped by - politics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS221",
            "Name": "Islam, the West, and the Modern World",
            "Desc": "This course examines conceptions of East-West divide and confrontation as well as topics of interest, both geo-political and religious, that influence the relationships of Muslims and the Western world. The focus is on the history of Muslims in the West and the challenges of integration of Muslim communities in pluralistic, secular societies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS223",
            "Name": "Intermediate Greek",
            "Desc": "This course is a continuation of GRK 102/RS 102. It will complete the initial study of ancient Greek grammar and devote substantial time to the reading of ancient Greek literature. Texts read will include a selection of poetry and prose in a variety of fields, including authors such as Homer, Herodotus, Euripides, Plato, the New Testament, and Josephus.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GRK/RS 102",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS224",
            "Name": "Selections from Greek Authors",
            "Desc": "This course is designed to follow GRK 201/RS 201 and to expand students' experience of reading ancient Greek texts for the study of classical studies and religious studies. Texts read will include a selection of poetry and prose in a variety of fields, including authors such as Homer, Herodotus, Euripides, Plato, the New Testament, and Josephus.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: GRK 201/RS 223",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS225",
            "Name": "Sacred Beauty: Religion and the Arts",
            "Desc": "An exploration of the spiritual dimension through the medium of art: sacred and secular. Aspects of the quest for meaning in world religions will be considered, expressed variously in the visual arts, architecture, music, and cinema. ",
            "Notes": "[Note: Formerly RS 122. This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 122",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS226",
            "Name": "Introduction to Indigenous Spirituality",
            "Desc": "This course introduces the plurality of Indigenous spiritual traditions in Canada and the diversity, complexity, and strength of these traditions. Included is an understanding of traditional ceremonies, world views, creation stories, cultural values, healers, and medicine. Special attention is given to Anishinaabe and Haudenosaunee nations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS228",
            "Name": "Big Ideas of the Bible",
            "Desc": "The Bible is the most translated and most read document in human history. This course explores central biblical ideas, from creation to the end of time, violence to redemption, and political intrigue to family ties, and examines their impact on Judaism, Christianity, and Western Culture. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 131/RS 130",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS229",
            "Name": "Christianity and Social Change in Canada",
            "Desc": "How has Christianity been a force for both oppression and liberation in Canada's history? This course examines the involvement of Christianity in such Canadian matters as racism, colonization, and the creation of the social welfare state.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS230",
            "Name": "Visions of Israel in Judaism: From Biblical to Modern Times",
            "Desc": "This course surveys the significance of the land of Israel in Judaism from historical, textual, and religious perspectives. Topics covered include the politics of Ancient Israel; the concept of Israel in prayer and the rabbinic and medieval Jewish imagination; portrayals of Israel in Christian and Muslim texts; and the origins, visions, and challenges of Zionism and the modern State of Israel. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS234",
            "Name": "Power and Corruption in the Bible",
            "Desc": "This course will examine the uses and abuses of power in the Hebrew Bible (Old Testament) by analyzing the historical narratives of the conflict between Saul and David, as well as the rise and fall of King David. In doing so, it will deal with the period of the prophets, i.e., the books of Joshua, Kings, and Samuel. ",
            "Notes": "[Note: Knowledge of Hebrew is not required. This course fulfils an Area 1 or Area 2 requirement for Religious Studies majors but not both.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 130/RS 112",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS235",
            "Name": "Jesus: Life and Legacy",
            "Desc": "The life and death of Jesus of Nazareth, as experienced and interpreted by his followers and recorded in the New Testament and other ancient literature. Attention is given to Jesus' identity as a Jew in the Roman Empire in the first century, his teachings and actions, and his ongoing significance throughout history. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS236",
            "Name": "Paul: Life and Letters",
            "Desc": "The career and thought of the apostle Paul, at once a Jew, a Graeco-Roman, and a Christ believer, living within the Roman Empire. Attention is given to issues such as spirit, Jewish Law, grace, freedom and slavery, Christ, church, politics, gender, and sexuality. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS237",
            "Name": "Insiders and Outsiders in the Bible",
            "Desc": "This course explores the tension between insiders and outsiders in the Bible, examining the rationale for and implications of issues such as purity, holy war, the chosen people, and the Gentiles. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS240",
            "Name": "History of Christianity",
            "Desc": "The development of Christianity in its Roman Catholic, Eastern Orthodox, and Protestant traditions from the time of Christ to the present. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS241",
            "Name": "Sex, Politics, and Religion in the U.S. and Canada",
            "Desc": "What are the three topics that should not be talked about in polite company? Sex, politics, and religion. Breaking the taboo, this course examines religious practices and conflicts around sexuality and sexual behaviour in the United States and Canada, and how they have manifested in political contests and public policy. ",
            "Notes": "[Note: Formerly RS 115R.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 115R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS242R",
            "Name": "Religious Diversity and Social Development",
            "Desc": "Religious traditions and beliefs contribute both positively and negatively to social development. This course explores the interrelationship of religious diversity, multiculturalism, and attitudes towards social issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS244",
            "Name": "Religion in Canada",
            "Desc": "Canada is a multicultural and a multi-faith society. While Christians remain the majority, Canada is home to increasing numbers of Buddhists, Hindus, Sikhs, Jews, Muslims, and people with no religion. This course examines religious diversity in Canada, including topics such as religion and multiculturalism, human rights, and selected controversies. ",
            "Notes": "[Note: Formerly RS 319.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: RS 319",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS245",
            "Name": "The Catholic Church in Canada",
            "Desc": "Using a variety of methods this course critically examines the role played by the Catholic Church in the social, political, and economic life of Canada from 1608 to the present.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS250",
            "Name": "History of Christian Thought",
            "Desc": "An analysis of the major theological developments in the Christian traditions from the apostolic era to the present. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS251",
            "Name": "Catholic Social Thought",
            "Desc": "This course will explore the origins, development, and contemporary challenges to Catholic social thought. The main focus will be on the critical and global influences of the past 100 years. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS253",
            "Name": "Christianity's Big Questions",
            "Desc": "Who is God? What does it mean to be human? What difference does the death of Jesus Christ make? What is the purpose of the Christian church? What happens after death? This course will explore the diversity of Christian responses to these questions and examine debates about the meaning of such beliefs in contemporary contexts. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 152",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS254",
            "Name": "Christian Sexual Ethics",
            "Desc": "Historical and contemporary Christian approaches to ethical questions about human sexuality and relationships. Topics include marriage, celibacy, single life, homosexuality, HIV/AIDS, sexual violence, gender roles, abortion, reproductive technologies, and sexuality and spirituality. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS255",
            "Name": "Roman Catholicism",
            "Desc": "This course offers comprehensive knowledge of the significance of Roman Catholic beliefs, values, and practices for our time. Topics analyzed in a wide context include spirituality, ethics, the meaning of the sacraments, prayer, sin and salvation, questions of authority, tradition, change, and views on sexuality and gender. ",
            "Notes": "[Note: Formerly RS 151.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 151",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS258",
            "Name": "God",
            "Desc": "An examination of ideas about God in Western thought from religious, philosophical, cultural, scientific, and political perspectives. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS259",
            "Name": "Gender, Sexuality, and Christianity",
            "Desc": "What do the churches say about sex and gender? This course examines how matters of the body have affected Christian spirituality, particularly in the lives of women and LGBTTTQQIPA + persons.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS260",
            "Name": "Religion Matters",
            "Desc": "Societies are in a time of flux and change - so too religions. No matter one's worldview, religion offers a window into societal changes. How one studies religion matters. This course addresses complex issues such as violence, religious experience, ritual, and gender within the context of methods in the study of religion. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS261",
            "Name": "Introduction to the Philosophy of Religion",
            "Desc": "A critical discussion of basic religious concepts. Among the topics covered will be faith, miracles, religious experience, immortality, arguments for the existence of God, and challenges to religious belief. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS262",
            "Name": "Spirituality, Secularity, and Religion in Sociological Perspective",
            "Desc": "This course examines the nature of religion, spirituality, and non-religion in society and their impact on many aspects of social and political life in North America and Europe. We will also consider how religion, spirituality, and non-religion can be sources of social stability and peace as well as of social change and conflict. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS263",
            "Name": "Religion and the Sensory Experience",
            "Desc": "Is listening to music a religious experience? Why is food an essential part of some religious rituals? This course integrates attention to sensory experience with the study of material culture and ritual in a variety of religious traditions, both ancient and modern.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS264",
            "Name": "Spiritual Journeys",
            "Desc": "An examination of spiritual autobiographies, attending to themes such as context, conversion, the relationship of individual and community, the dynamic character of spiritual identity, and self-presentation. This course may consider the writings of persons such as Augustine, Dorothy Day, Malcolm X, Elie Wiesel, Mother Teresa, Martin Luther King Jr., and the Dalai Lama, among others.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS266",
            "Name": "Death and Dying",
            "Desc": "While death is a physical event, it often entails legal, social, cultural, psychological, and religious significance. This course examines matters of dying, death, and death rituals in a variety of religions. ",
            "Notes": "[Note: The course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS270",
            "Name": "Religion in Popular Film",
            "Desc": "This course examines how religion has been a central concern and inspiration for filmmakers and how popular films have informed and shaped our understanding of religion. ",
            "Notes": "[Note: Film Studies course. This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 270R",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS271",
            "Name": "Special Topics in Religion and Film",
            "Desc": "This course focuses on a specific genre or theme to explore the complex\nrelationship between cinema and religion. ",
            "Notes": "[Note: Film Studies course. This\ncourse fulfils an Area 3 requirement for Religious Studies majors. This\ncourse is repeatable up to five times, subject to different content. RS 271\nwas formerly RS 271R.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 271R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS272",
            "Name": "The Holocaust and Film",
            "Desc": "An examination of the Holocaust as portrayed in feature films and documentaries. Do cinematic attempts capture the horror of the Holocaust faithfully, or trivialize it? The background to anti-semitism, use of religious imagery in propaganda films, and what counts as success or failure in cinematic representations are discussed. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS275",
            "Name": "Religion and Japanese Film",
            "Desc": "The course examines how religious beliefs and values in Japan are explored in the medium of film. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS279",
            "Name": "Religion and Popular Culture",
            "Desc": "A critical examination of the role of religion and myth in popular culture including television, cinema, music, fashion, and sport. ",
            "Notes": "[Note: Formerly RS 170.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 170",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "RS280",
            "Name": "Cults and New Religious Movements",
            "Desc": "This course examines various cults and new religious movements (e.g., Scientology, Krishna Consciousness, Neo-paganism) and places them within the context of our sociological knowledge of their emergence, who joins and why, and other issues. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS281",
            "Name": "Millennialism and Violence",
            "Desc": "An examination of the nature and causes of episodes of mass violence inspired by apocalyptic beliefs. This course will use historical and contemporary case studies and theoretical discussions of the social and psychological factors precipitating violence. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS283",
            "Name": "Religion and Ethics",
            "Desc": "How have world's religious communities responded to the great ethical challenges of today? This course examines how religious thinkers, activists, and institutions have responded to individual and social problems, such as questions about human rights, ecology, sex, and social justice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS284",
            "Name": "Gender and the Great Religions",
            "Desc": "Through a review of the teachings of the great religious traditions about gender, this course aims to arrive at a global view of the situation of beliefs and practices related to gender \"in the world of religion\". It will examine the role of religion as an important influence on gender and human development. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: WS 261",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS285",
            "Name": "The Sacred Earth: Religion and Ecology",
            "Desc": "An examination of the past and present effects of Christianity and other world religions on human treatment of the natural world. Historical background, recent debates, and contemporary approaches to the ethical issues will be investigated. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS287",
            "Name": "Mysticism and Wisdom Teachings in the World's Religions",
            "Desc": "This course will introduce students to core wisdom teachings and mystical practices in the world's religions, with an emphasis on comparative interpretation. Through this course, students will gain an elemental knowledge of diverse approaches to religious epistemology, increasing their capacity to identify similarities and differences in the thought worlds and value systems of various traditions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS288",
            "Name": "Health, Medicine, and Spirituality",
            "Desc": "This course examines how spirituality and religion have informed approaches to health and medicine from the 19th century to the present, including understandings of disease, illness, health, sexuality, and the body. Topics may include spiritual and/or religious concepts of health and sickness; meditation, prayer, and healing; \"alternative\" medicine; Indigenous approaches to health and medicine; mental health and spiritual practice; and religion and health care justice. Students are introduced to a variety of research methods that will help them identify, understand, and critically assess the complex boundaries that exist between modern medicine and spirituality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS291",
            "Name": "Special Topics",
            "Desc": "Consult Department for current offerings. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS301",
            "Name": "Engaged Buddhism",
            "Desc": "This course examines Buddhist - including mindfulness - engagement with contemporary social issues, such as peacemaking, environmentalism, political reform, race and gender concerns, and LGBTTTQQIPA+ rights.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS307",
            "Name": "Buddhism in North America",
            "Desc": "This course examines the history and development of Buddhism in North America. Topics such as the adaptation of traditional Buddhism to North American culture and its development as a Western religion will be examined. ",
            "Notes": "[Note: This course fulfils an Area 1 for Religious Studies majors. Formerly RS 227.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: RS 227",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS310",
            "Name": "Digital Spirituality: New Media Art in the Middle East/North Africa Diaspora",
            "Desc": "This course examines how Muslims and those influenced by Islam give spiritual expression to their lives through the digital arts. Using critical approaches, we will examine contemporary art of the Middle East/North Africa diaspora in the West to explore the relationship of Islam to the digital realm.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS312",
            "Name": "Muslim Lives and Practices Worldwide",
            "Desc": "This course examines the diversity of Muslim lives and practices worldwide. Selected case studies raise issues such as gender, authority, stereotypes, fundamentalism, and secularism. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS314",
            "Name": "Secret Teachings and Mysticism in Judaism",
            "Desc": "This course will survey the roots, history, and symbolism of the Jewish mystical tradition known as Kabbalah. Students will be introduced to the major texts, charismatic mystical masters, and schools of Kabbalah. ",
            "Notes": "[Note: Knowledge of Hebrew is not required. This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: JS 211/RS 213",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS315",
            "Name": "Greek and Roman Religion",
            "Desc": "An examination of the religious beliefs and cult practices of the classical world. Topics include prayer and sacrifice; divination and oracles; temples, priests, and festivals; mystery cults and their relation to Christianity.  ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: One of CLAS 100, 104, 201, 202",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS318",
            "Name": "Indigenous Worldviews and Spirituality",
            "Desc": "This course introduces students to the integral role and place of spiritual practices and ceremonies in the everyday experiences of Indigenous peoples in Canada. Course materials will be supplemented by visits with Elders, Knowledge Keepers, Storytellers, as well as integration of ceremonial and land-based practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS320",
            "Name": "Christian Approaches to Peacemaking",
            "Desc": "Current Christian approaches to peacemaking in areas of conflict: war and militarism, crime, poverty, racism, and gender relations. Attention will be given to various biblical, theological, and historical bases for these approaches. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: RS 256",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS325",
            "Name": "Sex and the World Religions",
            "Desc": "This course examines deeply rooted attitudes in the major world religions toward sexual identity, practices, and gender. Examining sacred scriptures and codes of conduct from the world religions, as well as fictional writings and films, this course enables students to explore various social and religious traditions. ",
            "Notes": "[Note: This course fulfils an Area 1 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 320",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS327",
            "Name": "The Body, Dress, and Religion",
            "Desc": "From clothing to hairstyles to tattoos, dress can express beliefs, aspects of identity, and power. This course examines dress in a variety of religions from ancient Greece to the modern era. The course includes attention to the look and feel of dress on the body, conflicts that can arise over dress and religion, as well as the role of dress in the formation and maintenance of religious communities. ",
            "Notes": "[Note: The course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS335",
            "Name": "Christianity, Violence, and the Bible",
            "Desc": "Why has the Bible inspired so much violence? This course explores how it has been used to justify, and to oppose, violence within the Christian tradition in historical and contemporary contexts. Topics may include the crusades, slavery, colonization, apartheid in South Africa, the residential school system in Canada, gender violence, and the environmental crisis. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS342",
            "Name": "Heresy and Religious Crises in Late Medieval Europe",
            "Desc": "An exploration of the impact of social crises on late medieval religious modes of expression. Topics will include the Great Famine, the Black Death, the Avignon Papacy and Western Schism, the development of heretical movements, and the eventual disintegration of European religious unity. ",
            "Notes": "[Note: This course fulfils the Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS343",
            "Name": "Reformation History",
            "Desc": "A study of the major 16th century reformers, and their intellectual background in humanism and late medieval scholasticism. Special attention will be given to the Lutheran and Reformed traditions, and their ideological, social, and political expressions. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for RS majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS344",
            "Name": "The Radical Reformation",
            "Desc": "A study of 16th century Anabaptism - a religious Reformation movement dissenting from both Protestantism and Roman Catholicism - its origins; its social, political, and theological content; and its relationship to such independent dissenters as Sebastian Franck. ",
            "Notes": "[Note: This course fulfils the Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS348",
            "Name": "The Catholic Church and Change",
            "Desc": "This course examines how the Roman Catholic Church adjusts to change, including the Second Vatican Council (1962-1965) that revolutionized teaching on issues such as religious freedom, human rights, and relations with other religions. The course also explores how the Church confronts contemporary issues such as racism, climate change, and gender.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS349",
            "Name": "The Mystical Imagination",
            "Desc": "This course examines works of writers, artists, architects, and thinkers in the Western European tradition for whom all of reality participates in the larger mystery of God. The course focuses on figures who, from the early Italian Renaissance onward, gave expression to that mystical imagination. ",
            "Notes": "[Note: This course is taught in Rome and incurs extra costs for the student above and beyond the registration fee in the form of travel, room and board, and incidental costs.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS350",
            "Name": "Dying for God",
            "Desc": "Why do people die for their religious convictions? How do religious communities shape the stories they tell about such persons? What are the implications of these practices? This course will examine historical and contemporary martyrdom in various religious and political contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS353",
            "Name": "War and Peace in Christian Theology",
            "Desc": "Christian teachings on war and peace from the early church to the present, including crusade, just war, and pacifist traditions, focusing especially on the 20th century discussion around realism, just revolution, nuclear pacifism, and non-violent resistance. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS354",
            "Name": "Shapers of Roman Catholicism",
            "Desc": "An examination of influential Christian thinkers - both historical and contemporary - who have played a critical role in shaping Roman Catholic thought and practice. Issues include debates on the nature of God, sin and redemption, authority in the Church, and perspectives on gender and sexuality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of RS 151/255, RS 240/HIST 235, RS 250",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS355",
            "Name": "Christianity, Gender, and Justice",
            "Desc": "New thinking about the nature and meaning of gender in Christianity has challenged traditional teaching and practices at every level. This course will explore how writers concerned with gender and justice have disrupted traditional disciplines of theology and spirituality and introduced innovations into Church thinking and practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS357",
            "Name": "The Church's Song",
            "Desc": "This course examines the origins of the music sung by the Christian church and its development up to the present. The course considers the Church's Song as theological, poetic, musical, cultural, and spiritual expression, and the use of songs in a variety of worship settings. Students will practice methods of song analysis, assess musical meaning, value and effects in various cultural contexts, and reflect on written and oral transmission of music.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS358",
            "Name": "Worship and its Music",
            "Desc": "The nature of worship and the role of music within worship in historical, theological, and cultural perspectives. Field trips to services of various traditions. ",
            "Notes": "[Note: This course fulfils an Area 2 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS361",
            "Name": "Anthropology of Religion",
            "Desc": "This course examines how religion has been studied as an object of anthropological inquiry. Topics may include ritual, magic, witchcraft, symbolism, cosmology, the relation between beliefs and practices, as well as the mutual influences of religion, politics, nationalism, and socioeconomic change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS364",
            "Name": "Jewish Humour: Laughing Your Way Through History",
            "Desc": "Jewish comedians have dominated humour in North America from Groucho Marx to Jerry Seinfeld, Sarah Silverman, Amy Schumer, and Seth Rogen. Studying Jewish humour is critical for understanding the development of Judaism, Jewish identity, immigrant experience, and response to persecution. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS377",
            "Name": "Religion in Science Fiction Films and Television",
            "Desc": "This course examines how religion, religious themes, and the religious imagination are explored in and through science fiction film and television. Topics include the use of science fiction to discuss questions of transcendence, humanity, and divinity, as well as the challenge of extraterrestrial and artificial lifeforms.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS380",
            "Name": "Religion and Peacebuilding",
            "Desc": "This course investigates the roles of religion and spirituality in peacemaking, exploring both obstacles and opportunities facing religious peace builders. Cases involving representatives of major world religions (Christianity, Islam, Judaism, Hinduism, and Buddhism) will provide a basis for comparing practices of faith-based advocacy for social justice, reconciliation, and coexistence. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A or Peace and Conflict Studies Diploma students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS383",
            "Name": "Justice, Peace, and Development",
            "Desc": "An examination of communities, movements, and theologies which express a Christian hope for justice, peace, and development in the encounter with injustice, oppression, and poverty.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS387",
            "Name": "Aging and the Spiritual Life",
            "Desc": "Engaging experience, theory, and reflection, this course explores spirituality as a central aspect of growth and development in later life. This course draws on perspectives from various faith and humanistic traditions. Topics include religious beliefs and spiritual concerns later in life, a spirituality of aging, providing spiritual care to persons in later life, spirituality and dementia, and death and dying. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: RS 391 taken winter 2018",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS391",
            "Name": "Special Topics",
            "Desc": "See Department for current offerings. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS395",
            "Name": "Study-Travel Seminar in Religion",
            "Desc": "Consult department for current offerings. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS398",
            "Name": "Directed Readings in Special Subjects",
            "Desc": "Readings in selected topics chosen in discussion with instructor. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS420R",
            "Name": "Critical Encounter with Human Nature",
            "Desc": "This course explores human nature, issues fundamental to human life, and theories which have developed around these issues. The approach is interdisciplinary and intercultural/interreligious with emphasis on such themes as self knowledge, community, loneliness and anxiety, free will and purpose in human life, and the nature of human happiness.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS450",
            "Name": "Reading and Interpreting the Qur'an (in translation)",
            "Desc": "This course serves as a comprehensive introduction to the sacred text of Islam. Students engage the Qur'an using a wide array of interpretive approaches, from traditional forms of exegesis to new trends in the academic study of the Qur'an.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS462",
            "Name": "Religion and Spirituality in the Social and Legal World",
            "Desc": "This course examines key substantive, theoretical, and methodological issues in the field of sociology of religion. Students will critically analyze high-profile media and legal cases surrounding the role of religion, spirituality, and secularity in Canadian society. Students will also further their knowledge by completing their own projects in this thematic area, developing both their research and written skills. ",
            "Notes": "[Note: This course fulfils an Area 3 requirement for Religious Studies majors.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Sociology majors",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS491",
            "Name": "Special Topics",
            "Desc": "Consult the department for special topics. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of 10 times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS495",
            "Name": "Study Term Abroad",
            "Desc": "Consult the department for current offerings.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS498",
            "Name": "Directed Readings in Special Subjects",
            "Desc": "Readings in selected topics chosen in discussion with instructor.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "RS499",
            "Name": "Senior Seminar",
            "Desc": "This seminar examines contemporary methods and theories in the study of religion and how they may be used to address specific themes in religious studies.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A Honours Religious Studies",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}