{
    "Name": "science",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "SCI200",
            "Name": "Energy - Its Development, Use, and Issues",
            "Desc": "A survey course which deals with energy resources, their conversion into energy products and their use in today's industrial societies. In light of the Energy Technology Perspectives (ETP) Model, energy supply demand, and conservation constraints, the use of non-renewable fossil and nuclear fuels, biofuels and other renewable fuels (wind, hydraulic, solar) will be reviewed and technical and social issues arising from their use explored. This course should prepare students to analyze and deal with the many contradictory energy usage claims and decide for themselves the best course of energy use. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI201",
            "Name": "Global Warming and Climate Change",
            "Desc": "This course will survey a broad spectrum of topics relating to global climate change, with an emphasis on the scientific approaches to address this issue. Topics covered will include natural and anthropogenic causes of climate change, monitoring methods, current and low emission alternatives of energy production.  The scientific, economic, public and political aspects of implementation of carbon capture and storage technology and other geo-engineering options to mitigate climate change will also be discussed.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: EARTH 358",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI206",
            "Name": "The Physics of How Things Work",
            "Desc": "A practical introduction to everyday technology, this course will look at the physics behind common devices used in consumer products and industry.  Examples include air conditioners, microwave ovens, household wiring, nuclear reactors, and medical imaging.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI207",
            "Name": "Physics, the Universe, and Everything",
            "Desc": "How does the universe work? How can it even exist? What is the ultimate nature of reality? This course explores big picture questions that connect humanity to the nature of the physical world. Beginning with introduction to Einstein's ideas and the quantum nature of the universe, this course considers how physicists tackle some of the mysteries (e.g., existence itself) and challenges (e.g., the world's energy problem) in science today. ",
            "Notes": "[Note: No mathematics or other specialized knowledge is required; students from non-science faculties are encouraged to attend. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI227",
            "Name": "Chemistry in Society:  Yesterday, Today and Tomorrow",
            "Desc": "This course surveys the impact of chemistry on our lives and explores the role of chemists and the chemical sciences in addressing the past and especially the present and future needs of society. Topics will vary from year to year, but will be drawn from the following critical areas: food, energy, materials, health, and the environment.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Grade 12 Chemistry",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI230",
            "Name": "Global Aspects of Technological Innovation and Entrepreneurship",
            "Desc": "This course features a combination of academic study, group work, and field trips in Southern Ontario and  Israel. The course focuses on cultural exchange and team work. Students will examine different approaches to transforming scientific innovations into useful products. \n",
            "Notes": "[Note: This concentrated 18-day block course, open to Science students and/or Velocity Science members, is offered at the end of the spring term examination period. The course incurs a $1,000 field trip cost and is intended for students with limited direct experience with Israel. Selection criteria apply. More course information detail can be found online; Offered: S, F]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI237",
            "Name": "Exploring the Universe",
            "Desc": "A survey course in astronomy (primarily intended for students in Applied Health Sciences, Arts and Environment). The solar system, stars, the Milky Way, galaxies and the Universe.  ",
            "Notes": "[Note:  Cannot be taken for credit by Engineering, Mathematics, or Science students.  Offered: F]",
            "Consent": "None",
            "Prereqs": "Prereq: Not open to  Engineering, Mathematics and Science students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PHYS 175, SCI 238",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI238",
            "Name": "Introductory Astronomy",
            "Desc": "A survey course in astronomy intended for Mathematics, Engineering, and Science students. The solar system, the Sun and planets, stars, the Milky Way, galaxies, and cosmology. ",
            "Notes": "[Note: Students with a strong background in physics and mathematics should consider PHYS 175 instead of SCI 238. Offered: W,S; also offered online: F]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHYS 175, SCI 237",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SCI250",
            "Name": "Environmental Geology",
            "Desc": "An introduction to geological concepts; the influence of geological factors on the natural environment; Earth processes and natural hazards; Earth resources, including water, energy and mineral resources; waste disposal and pollution; global climatic and environmental change.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI252",
            "Name": "Quantum Mechanics for Everyone",
            "Desc": "Quantum mechanics is driving a technological revolution. This course offers an introduction to the basic concepts of quantum mechanics from a historical and philosophical perspective. The course will supply the background needed to understand the controversies surrounding the interpretation of quantum mechanics as well as the principles behind the cutting-edge research being carried out at the Perimeter Institute and the University of Waterloo.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHIL 271 taken winter 2016, winter 2017",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI266",
            "Name": "Ancient Science",
            "Desc": "The ancient Greeks developed scientific theories that were influential for over a thousand years. Their worldview was different from ours, but they sought to explain some of the same phenomena that we grapple with today. In this course, we will study ancient Greek theories and methodologies in the sciences, which may include physics, astronomy, mathematics, meteorology, cosmology, astrology, and geography.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PHIL 271 taken winter 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI267",
            "Name": "Introduction to the Philosophy of Science",
            "Desc": "This course considers fundamental questions concerning the nature of science. Consideration is given to such topics as scientific methodology, scientific revolutions, natural laws, and the debate about whether scientific theories represent reality, or just our perceptions of reality.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI395",
            "Name": "Science Study Abroad Program",
            "Desc": "Waterloo students studying abroad for academic transfer credits under a Science Exchange Program during the Fall term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI396",
            "Name": "Science Study Abroad Program",
            "Desc": "Waterloo students studying abroad for academic transfer credits under a Science Exchange Program during the Winter term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SCI397",
            "Name": "Science Study Abroad Program",
            "Desc": "Waterloo students studying abroad for academic transfer credits under a Science Exchange Program during the Spring term.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}