{
    "Name": "socialdevelopmentstudies",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "SDS131R",
            "Name": "Political Ideologies and Social Development",
            "Desc": "This course introduces major political ideologies, their influence in political institutions and public discourse, and their impact on contemporary Canadian social policy and social development. ",
            "Notes": "[Note: Formerly ISS 131R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS150R",
            "Name": "Lifespan Processes",
            "Desc": "This course is an introduction to human development that spans conception to death. It provides an overview of events which occur throughout the lifespan and considers how biological, psychological, and social factors may impact healthy development. ",
            "Notes": "[Note: Formerly ISS 150R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS205R",
            "Name": "History of Education in Canada",
            "Desc": "This course considers the development of education as an institution within Canadian society and provides an understanding of significant educational issues and policies from a historical perspective.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ISS 205R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS210R",
            "Name": "Children's Rights in Canada",
            "Desc": "This course examines children's rights from a moral and comparative legal perspective. Students explore the welfare and developmental interests of children; the corresponding duties of parents, custodians, educators, and social workers; and the nature and scope of public educational authority in the common law jurisdictions of Canada.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS215R",
            "Name": "Education and Social Development from a Global Perspective",
            "Desc": "This course explores education and social development from a critical global perspective. Students learn the connections between educational practices and global conditions by focusing on themes such as citizenship, human rights, peace, and environment. ",
            "Notes": "[Note: Formerly ISS 215R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS220R",
            "Name": "Changing Concepts of Childhood",
            "Desc": "Childhood has changed as a social and cultural concept. This course will trace these changes, examining sociological, psychological, cross-cultural, historical and political factors. Art and literature will also be used to reflect attitudes about childhood. ",
            "Notes": "[Note: Formerly ISS 220R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: HIST 255",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS231R",
            "Name": "Introduction to Social Policy Processes",
            "Desc": "This course examines the policy-making process in Canada at the municipal, provincial, and federal levels to give students a sense of the players and their roles. It examines how policy agendas are set and the role of power and interest groups in the policy-making process. It also examines the various types of policies and the implementation process. ",
            "Notes": "[Note: Formerly ISS 231R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS240R",
            "Name": "Art and Society",
            "Desc": "Social issues and themes explored through the arts. Topics include art and social change, war and peace, propaganda, art of conscience, and the response of artists to poverty, hunger and catastrophic events. Specific applications include art as cross-cultural awareness and art as therapy. ",
            "Notes": "[Note: Formerly ISS 240R]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS242R",
            "Name": "Religious Diversity and Social Development",
            "Desc": "Religious traditions and beliefs contribute both positively and negatively to social development. This course explores the interrelationship of religious diversity, multiculturalism, and attitudes towards social issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS250R",
            "Name": "Social Statistics",
            "Desc": "This introductory level statistics course will emphasize the collection, manipulation, descriptive presentation, and statistical analysis of social research data. ",
            "Notes": "[Note: SWREN 250R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to Math.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 280, ECON 221, ENVS 278, GBDA 205, ISS 250A/B, ISS 250R, KIN 232, LS/SOC 280, PSYCH 292, REC 371, SMF 230, STAT 202, 206, 211, 221, 231, 241",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS251R",
            "Name": "Social Research",
            "Desc": "Introduction to the philosophy and methodology of applied social science research, including treatment of the problems and strategies of research design and execution. ",
            "Notes": "[Note: SWREN 251R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to students in the Faculty of\nMathematics.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS 251R, LS/SOC 221, LS/SOC 321, PSYCH 291, REC 270, SMF 220",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS260R",
            "Name": "Ecology, Society, and Justice: Social Development and the Environment",
            "Desc": "This course introduces theory and concepts of social ecology, an interdisciplinary approach to understanding the interrelationship of social and environmental well-being. Students critically examine the implications of environment and environmentalism for human society, as well as explore ideas for community action and social institutions that reflect a social-ecological ethic.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SDS 131R, PSCI 150, SOC 101R/101, EARTH 122, ERS 100, ENVS 105, ENVS 205",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS288R",
            "Name": "International Organizations",
            "Desc": "This course introduces students to major international organizations, focusing on intergovernmental organizations. The course explores the following major issues relating to international organizations: their origins, their functions, their impact in various policy areas, and their role in international cooperation on addressing various global issues.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS310R",
            "Name": "Disability and Society",
            "Desc": "This course examines disability through a social justice lens. Engaging with key texts in critical disability studies, students will explore how dominant ideas of embodiment, difference, expertise, and social value produce (dis)ableism and inequity. Through the social model of disability, it introduces concepts of access, inclusion, disability culture/justice, and universal design.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SOCWK 356R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS311R",
            "Name": "Indigenous Peoples and Canadian Public Policy",
            "Desc": "Framed within the Truth and Reconciliation process underway in Canada, this course examines the historical and ongoing colonial processes and impacts of government policies targeting First Nations, Inuit, and Métis peoples. Particular analysis will be given to government policy as a cause of (and response to) social, political, and economic problems experienced by Indigenous peoples in Canada. ",
            "Notes": "[Note: SWREN 311R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS 311R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS312R",
            "Name": "Homelessness and Public Policy",
            "Desc": "This course provides students with a basic overview of homelessness in modern society. Its goal is to familiarize students with the human, social, political and economic aspects of homelessness. Throughout, the emphasis will be on understanding homelessness from a public policy framework - its incidence and prevalence, etiology, consequences, and strategies for its prevention and amelioration. ",
            "Notes": "[Note: SWREN 312R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS 312R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS322R",
            "Name": "Community Engagement and Social Development",
            "Desc": "This course highlights the importance of community engagement for individual, community, and societal well-being and introduces theory and methods related to social inclusion and participation in community. Through case examples and hands-on experience, this course explores approaches to research and professional practice designed to stimulate social development through community engagement.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS323R",
            "Name": "International Perspectives in Community Organization",
            "Desc": "An exploration of community organization activities in the context of international processes of colonization and globalization.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOCWK 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS326R",
            "Name": "Philosophy and History of Social Welfare",
            "Desc": "Social welfare from the 18th century to the present. The effects of religious, political, economic and cultural factors on social welfare, development, and the continuing influence of inherent attitudes, philosophies, and values on this complex institution. Focus on the Canadian social welfare system.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOCWK 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS330R",
            "Name": "International Public Policy",
            "Desc": "This course introduces students to major international public policies, including macroeconomic and fiscal policies, public transport and infrastructure policies, health care and social welfare policies, educational policies, and energy and environmental policies. Through a comparative and cross-cultural examination of major public policies, students will acquire better understanding of the major policy issues that affect the everyday lives of citizens.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS331R",
            "Name": "Social Inequality, Social Justice, and Social Action",
            "Desc": "This course examines the hidden causes of inequality and associated social injustices. It provides a snapshot of main issues associated with modern society and the evidence that ties them to persistent inequality and injustice. The course reviews not only the major types of inequality but also social and public policy responses to them. ",
            "Notes": "[Note: Formerly ISS 331R. SWREN 331R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS345R",
            "Name": "Self-Development and Identity Formation: A Sociocultural Perspective",
            "Desc": "This course examines interdisciplinary approaches (sociological, developmental, psychological, critical, sociocultural perspectives) to identity formation, development, and maintenance. Relevant theories, literature, and research will showcase diverse approaches to understanding social and cultural factors that impact identity formation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R, PSYCH 101/101R; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SOC 209, SOC 235",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS350R",
            "Name": "Adult Life Crises and Events",
            "Desc": "A study of normal events occurring during the adult years, why they happen, and how we cope with them. Relying on research, popular literature, and life experiences, students examine social change, the future, adult development and adjustment. ",
            "Notes": "[Note: Formerly ISS 350D]",
            "Consent": "None",
            "Prereqs": "Prereq: SDS/ISS 150R; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS351R",
            "Name": "Qualitative Research for Social Change",
            "Desc": "Engaging in histories, stories, language, and media, this course examines how qualitative research can support movements for social change. Students will learn how to conduct research and evaluations through a humanizing approach and have opportunities to participate in diverse research environments while reflecting on their positionalities and identities as researchers. ",
            "Notes": "[Note: Formerly ISS 351R]",
            "Consent": "None",
            "Prereqs": "Prereq: SDS/ISS 251R; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: LS 322/SOC 322",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS353R",
            "Name": "The Evolution of Family Law in Canadian Society",
            "Desc": "This course examines the evolution of family law in Indigenous, francophone, anglophone, and other communities in Canada. Taking an interdisciplinary approach, the course not only explores the demographic, economic, social, and political contexts in which family law developed but also assesses its significance for Canadian society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS354R",
            "Name": "Values and Contemporary Families",
            "Desc": "An exploration of how religious, economic, political, and other social institutions shape values in our society, and what impact society's changing values are having upon families. ",
            "Notes": "[Note: Formerly ISS 350H]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS355R",
            "Name": "Resilience and Social Support",
            "Desc": "This course is a survey of resilience and social support grounded in interdisciplinary study. Students explore how factors such as gender, age, culture, physical and mental health, personality, cognition, severity, and social/interpersonal systems of support affect stress, coping, and resilience. ",
            "Notes": "[Note: Formerly ISS 355R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS357R",
            "Name": "Family Violence",
            "Desc": "An application of the principles and models of medical, psychogenic, and sociogenic adjustment to an understanding of family violence. The treatment of victims of family violence, the prevention of such violence and social policies affecting family welfare are considered.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOCWK 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS358R",
            "Name": "Child Maltreatment: Identification and Prevention",
            "Desc": "The objectives of this course are to provide an understanding of the dimensions and causes of child maltreatment, to develop skills identifying cases of this social problem, and to explore current methods of management and treatment of persons involved in child maltreatment situations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SOCWK 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS367R",
            "Name": "Aging and Social Development",
            "Desc": "This course examines aging from the perspective of human and social development. On individual, group, family, community, and systemic levels, it analyzes interventions for enhancing the well-being of the elderly, emphasizing the roles of social justice and civic engagement in Canadian society.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS370R",
            "Name": "International Learning Experience",
            "Desc": "This course examines sociocultural realities of a country other than Canada through on site experience and academic study. ",
            "Notes": "[Note: Formerly ISS 370R. Field trip fee will be required.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS375R",
            "Name": "Studies in Interdisciplinary Social Science",
            "Desc": "This course will deal with selected topics in interdisciplinary social science. Subjects will be dependent upon the research and/or instructional interests of faculty. ",
            "Notes": "[Note: Formerly ISS 375R. Students wishing to take such courses should consult with the Social Development Studies undergraduate advisor. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS388R",
            "Name": "Globalization and Social Development",
            "Desc": "This course explores the rise of globalization; its impact on economics, politics, society, and culture; and its implications for national development and social policies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS398R",
            "Name": "Independent Study",
            "Desc": "Interdisciplinary focus in greater depth than is available in other courses, on a selected area of concern to the student. Available to individuals or small groups of third- or fourth-year Social Development Studies students and arranged with one of the program's faculty members. ",
            "Notes": "[Note: Normally, a student may take only two of the independent studies courses: PSYCH 398R, 399R; SDS 398R [Formerly ISS 398R], 399R; SOC 398R, 399R; SOCWK 398R, 399R.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS399R",
            "Name": "Independent Study",
            "Desc": "Interdisciplinary focus in greater depth than is available in other courses, on a selected area of concern to the student. Available to individuals or small groups of third- or fourth-year Social Development Studies students and arranged with one of the program's faculty members. ",
            "Notes": "[Note: Normally, a student may take only two of the independent studies courses: PSYCH 398R, 399R; SDS 398R, 399R [Formerly ISS 399R]; SOC 398R, 399R; SOCWK 398R, 399R.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS400R",
            "Name": "Comparative Social Policy",
            "Desc": "This course introduces students to the main methodological approaches in comparative policy analysis. It is designed to provide students with an understanding of key issues involved in comparative social policy research, and develops their analytical skills in systematic comparison. It explores the implications of globalization on social policy development; considers the impact of transnational policy making bodies; and considers international variation in policy challenges as well as variation in policy responses to those challenges. ",
            "Notes": "[Note: Formerly ISS 400R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS405R",
            "Name": "Cosmopolitanism and Social Development",
            "Desc": "What does it mean to be a \"citizen of the world\"? Cosmopolitanism is a social and political philosophy that views all human beings as members of a moral, political, relational, or cultural community. From a critical and comparative perspective, students in this course explore the philosophy of cosmopolitanism and its implications for social development in diverse social, political, and cultural contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS410R",
            "Name": "Queer and Trans Studies",
            "Desc": "Centering 2SLGBTQ+ cultural and political contributions, this course examines the ways in which sexualities, bodies, relationships, and identities have been regulated and transformed. Topics include colonialism, education, family, HIV/AIDS, psychiatry, incarceration, violence, popular culture, immigration, neoliberalism, and homonormativity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS411R",
            "Name": "Decolonization and Social Action",
            "Desc": "This course focuses on the relationships between Indigenous and non-Indigenous peoples within, against, and beyond settler colonialism. We explore the concepts of decolonization, resurgence, unsettling, and reconciliation and address issues of settlement, sovereignty, treaty relationships, solidarity, appropriation, and the relationship between Indigenous struggles and other movements for social change.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS415R",
            "Name": "Gender Relations within Educational Institutions",
            "Desc": "This course focuses on gender in education as both an analytical category and a teaching/learning tool. The course introduces students to the study of gender, intersected with class, race, sexuality, and disability, by focusing on pedagogy, curriculum, and identity development. ",
            "Notes": "[Note: Formerly ISS 415R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS420R",
            "Name": "Critical Encounter with Human Nature",
            "Desc": "This course explores human nature, issues fundamental to human life, and theories which have developed around these issues. The approach is interdisciplinary and intercultural/interreligious with emphasis on such themes as self knowledge, community, loneliness and anxiety, free will and purpose in human life, and the nature of human happiness.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS421R",
            "Name": "(Re)framing Indigenous-Settler Relations",
            "Desc": "Interactions between Indigenous and Settler peoples are influenced by historical and contemporary stories told about each other. This course will examine the ideologies, knowledge, beliefs, values, and assumptions behind these stories, within the context of Canada's current Truth & Reconciliation process. It will be taught using Indigenous pedagogy in a sharing-circle format.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SDS 450R (001) taken spring 2018, spring 2019",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS425R",
            "Name": "Educational Equity in Canada",
            "Desc": "This course examines the social foundations of education (traditionally philosophy, sociology, and history of education, but also cultural and equity studies). Through an interdisciplinary framework, this course considers the roles that schooling systems, teachers, and students play in both reproducing and challenging social inequalities and injustices. ",
            "Notes": "[Note: Formerly ISS 425R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SDS431R",
            "Name": "Radical Ideology and Social Policy",
            "Desc": "From a critical and comparative perspective, students explore the impact of radical political ideologies on U.S. and Canadian political institutions and processes. Students consider the potential implications of an ideologically polarized political landscape for social policy and social development.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ISS/SDS 131R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS435R",
            "Name": "Restorative Approaches to Education",
            "Desc": "This course aims to develop understandings and skills in restorative approaches to education through dialogue, communication, and relational pedagogy. Through examining the current state of schools and communities engaging with restorative approaches for children and youth, this course will explore transformative options for promoting sustainable equity and inclusion.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS440R",
            "Name": "Optimal Living",
            "Desc": "This course takes an interdisciplinary perspective to consider what conditions foster optimal living. Topics may include the mind-body connection, spirituality, simplicity, healthy relationships, work-life balance, community engagement, leadership, generativity, and meaning. ",
            "Notes": "[Note: Formerly ISS 440R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS441R",
            "Name": "Popular Culture and Social Change in the Radical Imagination",
            "Desc": "This course examines the role of popular culture in movements for social and political change. Students will explore both historical contributions and contemporary realities where popular culture becomes a site that fosters the radical imagination.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS445R",
            "Name": "Pedagogies of Democratic Education",
            "Desc": "Engaging pedagogies for democratic education is a central goal of public and parapublic organizations, particularly schools. Yet such democratic engagement is understood in varying ways based on diverse identities. This course draws on experiential education to critically examine democratic education, including civic knowledge, values, and action.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS449R",
            "Name": "Prejudice and Discrimination",
            "Desc": "This course takes an interdisciplinary approach in examining causes of, impacts of, and ways to overcome stereotyping, prejudice, and discrimination. The experience and behaviour of both the target and the purveyor of discrimination will be studied from individual, interpersonal, and structural perspectives. Topics may include overt and subtle forms of prejudice, intersectionality, and situational barriers to stigmatized groups' success. ",
            "Notes": "[Note: Formerly PSYCH 449R]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS450R",
            "Name": "Senior Seminar in Special Topics",
            "Desc": "Senior seminars may include weekly readings, individual and/or group projects, class presentations and discussions, research proposals, essay/literature reviews, assignments, midterms, and final exams. Consult  departmental listings for topics and prerequisites for the current year. ",
            "Notes": "[Note: Formerly ISS 450R. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS451R",
            "Name": "Community Based Research for Social Development",
            "Desc": "This course introduces research approaches that prioritize community participation in the active creation and democratic use of knowledge for social development. Through concrete examples, this course explores the role of power in knowledge production, and examines fundamental principles and dilemmas in community-engaged research.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SDS/ISS 251R, HLTH 333, LS/SOC 221, LS/SOC 321, PSYCH 291, REC 270; Level at least 3A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS 450R taken fall 2010 (section 002), fall 2011; SDS 450R taken fall 2012, 2013, 2014, 2015",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS490R",
            "Name": "Special Studies",
            "Desc": "An independent, in-depth study, based on empirical research and/or extensive reading from multiple disciplines on a contemporary social issue under the direction of individual instructors in social development studies. Available to individuals or small groups of Social Development Studies majors and arranged with one of the faculty members from the plan. The project must be approved by the academic supervisor of the course prior to registration. ",
            "Notes": "[Note: Formerly ISS 490R. Normally, a student may take only two of the following: PSYCH 490R, SOC 490R, SOCWK 490R, SDS/ISS 490R, SDS/ISS 499A and SDS/ISS 499B.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS495R",
            "Name": "Research Apprenticeship",
            "Desc": "This course invites students to work with a professor on the latter's research project. During this unpaid apprenticeship (six to eight hours per week throughout the term), students will do agreed-upon tasks to help them acquire skills and gain understanding of the research process and of the discipline itself. The faculty member and the student will determine the exact duties together.  A document outlining these duties must be approved by the Social Development Studies chair and kept on file. The course is graded on a CR/NCR basis.  Paid or volunteer positions outside this course are not eligible for credit. ",
            "Notes": "[Note: Formerly ISS 495R]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SDS/ISS 250R and 251R; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS496R",
            "Name": "Applied Apprenticeship in Social Development Studies",
            "Desc": "This course provides third- and fourth-year Social Development Studies students with an opportunity for an unpaid apprenticeship in an applied setting. The course consists of two components. The apprenticeship component normally requires a commitment of 6-8 hours per week for 10 weeks. The seminar component requires students to meet bi-weekly, as a group, with a course coordinator to set learning goals, to discuss issues arising from their apprenticeship, and to present their apprenticeship experiences and outcomes. ",
            "Notes": "[Note: Formerly ISS 496R. This course is offered on a CR/NCR basis.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS499A",
            "Name": "Senior Honours Essay/Thesis",
            "Desc": "Under the supervision of a faculty member, students focus on an area of Social Development Studies and either complete an essay involving in-depth literature research and analysis or complete a scholarly report on their own study involving literature review, research design, data collection, and analysis. ",
            "Notes": "[Note: Formerly ISS 499A. A numeric grade for SDS 499A will be submitted only after completion of SDS 499B.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Honours Social Development Studies",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SDS499B",
            "Name": "Senior Honours Essay/Thesis",
            "Desc": "Under the supervision of a faculty member, students focus on an area of Social Development Studies and either complete an essay involving in-depth literature research and analysis or complete a scholarly report on their own study involving literature review, research design, data collection, and analysis.  ",
            "Notes": "[Note: Formerly ISS 499B]",
            "Consent": "None",
            "Prereqs": "Prereq: SDS/ISS 499A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}