{
    "Name": "sustainabilityandfinancialmanagement",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "SFM101",
            "Name": "Introduction to Sustainability and Financial Management",
            "Desc": "Introduction to foundational concepts in sustainability through an exploration of the interaction between business, society, and the natural environment from multiple perspectives. The course will emphasize ways to mobilize inclusive blended knowledge for sustainability and innovation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Sustainability and Financial Management students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 102, ENVS 274 001 fall 2021",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM102",
            "Name": "Sustainability Economics",
            "Desc": "This course provides an introduction to the basic concepts and tools of microeconomics and macroeconomics from the perspective of economic approaches to the environment.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Sustainability and Financial Management students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON\n100/COMM 103, ECON 101, ECON 102, ENVS 220, ENVS 274 001 winter 2022",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM201",
            "Name": "Social Issues in Sustainability",
            "Desc": "This course is an examination of a variety of social issues in sustainability. Foundational topics include human rights, labour, gender equality, children's rights, education, and diversity and engagement of Black, Indigenous, and People of Colour (BIPOC) communities.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SFM 101; Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM299",
            "Name": "Special Topics in Sustainability and Financial Management",
            "Desc": "A course offered from time to time on a significant sustainability management issue. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM301",
            "Name": "Enterprise Carbon Accounting",
            "Desc": "This course is an exploration of carbon markets and regulations. It investigates best practices in greenhouse gas measurement and management in the focal firm and across the supply chain, including greenhouse gas information management system, verification and auditing processes, and strategies for emission reductions target setting.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM309",
            "Name": "Sustainability and Business Ethics",
            "Desc": "This course focuses jointly on business ethics and the ethics of sustainability. Ethical issues commonly encountered by finance and accounting professionals are explored. Ethical issues regarding the compatibility of commercial activity and sustainability are also examined with a particular lens on the role of corporate governance, culture, and social responsibility.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Accounting and Financial Management or Sustainability and Financial Management students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: AFM 311",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM310",
            "Name": "Sustainability in Capital Markets",
            "Desc": "This course examines financial market tools, processes, and institutions which influence the environmental and the channels by which they can be utilized to promote sustainable and socially responsible long-term growth.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AFM 272 or AFM 273.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ENBUS 310",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM311",
            "Name": "Social Regulation and Policy",
            "Desc": "Social policy regulation and policy identifies acceptable and unacceptable activities by governments, business, and society. This course examines the formal and informal policies, laws, regulations, and norms that act to restrict practices that threaten to undermine social welfare and the equitable distribution of benefits. Topics include governmental laws and regulations, tax policy, corporate social responsibility and accountability, social license, and the role of mass media.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SFM 310 or ENBUS 310; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM328",
            "Name": "Sustainability Integration Consulting Group - Junior Strategist",
            "Desc": "This course provides students hands-on training in strategic integration of sustainability objectives and measurement within the firm with guidance from industry experts and supervision by faculty. This will generally be the first course that students take when they join the Sustainability Integration team. Junior strategists will attend consulting group meetings, assist in firm research and materiality assessments, and assist in the preparation of consulting reports/recommendations. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times. Course will be graded on a CR/NCR basis.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students. AFM students require 3 of AFM 485, ENBUS 102, 202, 310, 407, 408, 410, ENVS 195, 200, 205, 220, INDEV 100, 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM329",
            "Name": "Sustainability Integration Consulting Group - Senior Strategist",
            "Desc": "This course provides students hands-on training in strategic integration of sustainability objectives and measurement within the firm with guidance from industry experts and supervision by faculty. This course is normally taken after a student has completed one term as a junior strategist with the consulting group. Senior strategists interface with firm representatives, lead the consulting student team, and oversee consulting reports/recommendations. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times. Course will be graded on a CR/NCR basis.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students. AFM students require 3 of AFM 485, ENBUS 102, 202, 310, 407, 408, 410, ENVS 195, 200, 205, 220, INDEV 100, 200",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM401",
            "Name": "Social and Human Capital Accounting",
            "Desc": "This course examines approaches and methodologies used by firms to understand and measure the value added by social and human capital, to assess positive and negative impacts, and to provide information for decision-making that informs and influences external and internal stakeholders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM402",
            "Name": "Sustainability Accounting",
            "Desc": "This course examines approaches and methodologies used by firms to understand and measure natural capital, to assess positive and negative impacts on natural resources, and to provide information for decision-making that informs and influences external and internal stakeholders.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 4A Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM403",
            "Name": "Integrated Planning, Reporting, and Risk Management for Sustainability",
            "Desc": "This capstone course will review channels by which social, human, natural, and financial capital feed into strategic planning and environmental risk management. Students examine effective and ineffective attempts to embed an understanding of the interdependency among social, human, sustainability, and financial factors and complete a project critically analyzing the planning, reporting, and/or risk management practices of a firm.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SFM 401, SFM 402; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM411",
            "Name": "Sustainability Regulation and Policy",
            "Desc": "This course examines the impact of sustainability regulation and policy on the natural environment including impact assessments, conservation/resource management plans, pollution and waste licensing, and tax policy from the perspective of multiple stakeholders, including governments, businesses, and society. The course will review a range of existing and proposed policy and regulation to evaluate the efficiency of each approach to obtain broad sustainability objectives.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SFM 311, ENVS 201, ENBUS 410; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM412",
            "Name": "Investor Behaviour",
            "Desc": "Behavioural finance examines the role that emotions and irrational preferences have on investor decision making. This course examines the psychology of investment preferences for retail investors and how these influence financial analysts and investment management. Particular focus is placed on popular media influences and how current trends influence investment decisions and how those decisions impact corporate sustainability practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: AFM 272 or AFM 273",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM413",
            "Name": "Integrated Policy and Regulation for Sustainability",
            "Desc": "In this capstone students will consider the sustainability performance of an entity from a number of perspectives including tracking, reporting, communications, regulations, ethical considerations, and compensation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SFM 411; Accounting and Financial Management, Environment and Business, or Sustainability and Financial Management students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM497",
            "Name": "Special Topics in Sustainability Reporting and Measurement",
            "Desc": "A course offered from time to time on a significant sustainability reporting and measurement issue. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM498",
            "Name": "Special Topics in Sustainability Finance",
            "Desc": "A course offered from time to time on a significant sustainability finance issue.\n",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SFM499",
            "Name": "Special Topics in Sustainability Accounting",
            "Desc": "A course offered from time to time on a significant sustainability accounting issue. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of two times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}