{
    "Name": "studiesinislam",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "SI121R",
            "Name": "Islam in the World",
            "Desc": "An introduction to the caliphates, cities, and cultures of Islam, through film and selected texts, including the experience of Islam in Canada as revealed through its writers. This course provides a foundation for Studies in Islam, establishing a context for multidisciplinary approaches to a wide variety of topics.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI131R",
            "Name": "Arab Culture",
            "Desc": "Integrating elements of Arab history, geography, language, literature (prose and poetry), art, music, theatre, cinema, politics, press, humour, dance, fashion, and food, this course explores varied expressions of Arab culture. Students will also study the phenomenon of Orientalism and the impact of European colonialism upon the Arabs.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: ARTS 190 taken spring 2016",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SI132R",
            "Name": "Introduction to Modern Arab and Muslim Drama",
            "Desc": "The course explores contemporary Arab and Muslim drama in English (1940s-present) from multiple perspectives, including literary, social, economic, and political.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI221R",
            "Name": "Islam, the West, and the Modern World",
            "Desc": "This course examines conceptions of East-West divide and confrontation as well as topics of interest, both geo-political and religious, that influence the relationships of Muslims and the Western world. The focus is on the history of Muslims in the West and the challenges of integration of Muslim communities in pluralistic, secular societies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI230R",
            "Name": "Islamic Visual Culture: Art, Architecture, and Aesthetics",
            "Desc": "This course explores Islamic visual culture by focusing on three main design elements in Islamic art and architecture: calligraphy, arabesque, and geometry. The course emphasizes the aesthetic, visual, and cultural importance of ornamentation in Islamic art and examines its manifestation in the work of contemporary Muslim artists.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI231R",
            "Name": "Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts",
            "Desc": "Exploring the history of Islamic and East Asian calligraphic arts and the study of Eastern and Western artists, this course examines multiple ways in which writing and other forms of visible language are incorporated into visual arts. Through studio projects, students explore conceptual approaches to text-based image making.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: FINE 204 (STU 001) taken winter 2014 or SI 375R (LEC 001) taken winter 2014",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI232R",
            "Name": "Decorative Arts in Islamic and East Asian Visual Cultures",
            "Desc": "From elaborate geometric patterns to sinuous dragon motifs, ornamentation is one of the most essential artistic modes in Islamic and East Asian cultures. This course examines the aesthetic, visual, and cultural importance of design elements in decorative works of the past and of contemporary artists.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI233R",
            "Name": "Contemporary Muslim and East Asian Visual Arts in Diaspora",
            "Desc": "This course investigates the notion of living between cultures brought about by the act of migration. Applying theories of cultural translation to the realm of visual arts, it focuses on Muslim and East Asian contemporary artists in diaspora.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI240R",
            "Name": "Migration, Diaspora, and Exile in Muslim Narratives",
            "Desc": "This course examines Muslim narratives written in the diaspora, such as from North America or the United Kingdom. It investigates the diversity of Islamic culture and expression in diasporic contexts, exploring an array of experiences and issues written from various sociocultural locations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI241R",
            "Name": "Sacred Spaces and Human Geographies in Muslim Literary Expressions",
            "Desc": "Using the Muslim dimension as a central theme, this course explores the social, cultural, and political implications to be found in a range of postcolonial literatures from Africa, South Asia, and the Middle East. Students investigate issues such as identities, nationalism and politics, cultural memory, and sacred space and place.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI242R",
            "Name": "Arabic Literature in Translation",
            "Desc": "This course is designed to examine major themes, schools, and genres in Arabic literature, covering the classical, postclassical, and modern eras. Students will read and analyze selected representative texts. The course will be delivered in English with assigned texts in English translation.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI250R",
            "Name": "The History of Islamic Civilization from Late Antiquity to 1300",
            "Desc": "This course surveys the diverse history of Islamic societies from the seventh to the thirteenth century. The primary focus is on the central Islamic lands from Egypt to Iran. In addition to the standard narrative, the course also examines salient aspects of Islamic civilization on a thematic basis. ",
            "Notes": "[Note: SI 121R recommended.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI251R",
            "Name": "The History of Islamic Civilization from 1300-1800: The Islamic Gunpowder Empires",
            "Desc": "This course studies in comparative fashion the rise, consolidation, and decline of the three major Islamic empires of the early modern period (c. 1300-1800): the Ottomans in Anatolia, the Balkans, and the Middle East; the Safavids in Iran; and the Mughals in India. ",
            "Notes": "[Note: SI 121R recommended.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI310R",
            "Name": "Digital Spirituality: New Media Art in the Middle East/North Africa Diaspora",
            "Desc": "This course examines how Muslims and those influenced by Islam give spiritual expression to their lives through the digital arts. Using critical approaches, we will examine contemporary art of the Middle East/North Africa diaspora in the West to explore the relationship of Islam to the digital realm.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI315R",
            "Name": "Islam, Women, and the Modern World",
            "Desc": "This course examines the lives and contributions of Muslim women in history - past and present - and political, social, and cultural influences that have affected the lives of Muslim women around the world. Challenging stereotypes of Muslim women and using religious, historical, and literary images, the course focuses on contributions of Muslim women as religious leaders, scholars, and politicians.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI375R",
            "Name": "Special Topics in Islamic and Arab Cultures",
            "Desc": "This course allows for in-depth study of selected topics in Islam, Islamic cultures, or Arab cultures. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI390R",
            "Name": "Understanding Islam",
            "Desc": "This course brings together the diverse strands that constitute the student's learning and experience in required as well as elective courses of Studies in Islam. Exploring Islam in a variety of contexts, the approach is interdisciplinary and integrative. ",
            "Notes": "[Note: In addition to the three prerequisite courses, a student must have completed at least four Studies in Islam elective courses. Students who do not meet the prerequisites may take the course with department consent.]",
            "Consent": "None",
            "Prereqs": "Prereq: SI 121R, SI 221R/RS 221; One of SI 250R/MEDVL 250R or SI 251R/MEDVL 251R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SI450R",
            "Name": "Reading and Interpreting the Qur'an (in translation)",
            "Desc": "This course serves as a comprehensive introduction to the sacred text of Islam. Students engage the Qur'an using a wide array of interpretive approaches, from traditional forms of exegesis to new trends in the academic study of the Qur'an.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SI 121R or RS 216; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}