{
    "Name": "sexuality,marriage,andfamilystudies",
    "Notes": "The following courses are administered by St. Jerome's University.",
    "Courses": [
        {
            "courseCode": "SMF101",
            "Name": "Introduction to Relationships and Families",
            "Desc": "This course provides an overview of couple, marital, and family relationships from a broad, interdisciplinary perspective.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SMF111",
            "Name": "Sex, Marriage, and Family Traditions in Italy",
            "Desc": "This course explores the contributions of Italian women artists, writers, and intellectuals from the Medieval times through the Renaissance to the Baroque period. The focus will be on the institutions of marriage and of the family.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF112",
            "Name": "Sexual Identities and Relationships in Italy",
            "Desc": "This course explores the contributions of Italian women artists, writers, and intellectuals from the Enlightenment until contemporary times. The focus will be on the expression of sexual identities, the nature of relationships, and the influence of family ties.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF200",
            "Name": "Special Topics in Sexualities, Relationships, or Families",
            "Desc": "This course introduces students to special topics in sexualities, relationships, and/or families. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF204",
            "Name": "Introduction to Human Sexuality",
            "Desc": "This course provides a broad interdisciplinary overview of theories and research on human sexuality. Topics may include human anatomy, sexual health, sexual response cycle, sexual orientation, gender, sex work, sexual practices, fetishes and paraphilias, and attraction/intimacy/love.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: PSYCH 236",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF205",
            "Name": "The Dark Side of Sexuality",
            "Desc": "As with all profound and meaningful human activities, sexuality has the potential to involve harm, manipulation, and abuse.  This course offers a theoretical and empirical examination of the dark side of human sexuality.  Topics may include sex work, pornography, sexual violence and abuse, incest, compulsive sexual behaviour, and paraphilias.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 204 or PSYCH 236",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF207",
            "Name": "Parents, Children, and Family Relations",
            "Desc": "This course examines caregiver/parent-child relationships from a broad interdisciplinary perspective over the lifespan. Topics may include the transition to parenthood, parenting practices and their intersection with child/adult development, social and cultural influences on families with children, same-sex parenting, gender variance/fluidity and family relationships, family relations after parental separation, and care of aging parents.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 101",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF208",
            "Name": "Introduction to Systemic Therapies and Anti-Oppressive Practices",
            "Desc": "This course provides an overview of various theoretical and therapeutic practices in relational and sex therapy, and serves as an introduction to social justice, anti-oppressive, and inclusionary therapeutic practices. In doing so, the intersections of social locations such as class, culture, dis/ability, gender, and race within various social contexts are critically analyzed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 101; one of SMF 204, 207, PSYCH 236; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF211",
            "Name": "Dynamics of Dating",
            "Desc": "This course examines the dynamics of intimate relationships in the context of the modern, Western construct of dating. Topics explored may include long-distance relationships, polyamorous relationships, online dating, hook-up culture, shifting romantic and family formation dynamics, modern communications and technology, and the role of pop culture in dating trends.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF212",
            "Name": "Navigating Sexuality and Relationships in Mid/Later Life",
            "Desc": "This course reviews the process of navigating relationships and sexuality as persons age. Topics may include physical/biological changes, desire, youth-focused culture, relationship dissolution, dating, and technologies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF213",
            "Name": "Sexual Health and Well-Being",
            "Desc": "This course offers a theoretical and empirical examination of sexuality from a health perspective. Approaches to counselling, prevention, and treatment will be discussed. Topics may include sexually transmitted infections (STI) and pregnancy prevention, pregnancy and post-partum health, healthy romantic and sexual relationships, chronic and long-term illnesses, and sexual cancers.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF214",
            "Name": "Constructing Erotics",
            "Desc": "This course examines the social construction of the erotic, in particular how culture, politics, religion, literature, economics, medicine, or technology interact to regulate the definition and performance of sexuality across cultures. Topics may include the sexual body (e.g., beauty and desire), the regulation of sex (e.g., taboos, laws, religion), and other cultural constructions of sexuality (e.g., sexual education).",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF215",
            "Name": "Sexuality and Popular Culture",
            "Desc": "This course examines how sexuality is depicted in, shaped by, and contested in popular culture. It introduces different theories in the study of popular culture and sexuality through a range of historical and contemporary texts and practices.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF216",
            "Name": "Sexual Pleasure",
            "Desc": "This course offers a theoretical and empirical examination of the pleasurable and recreational aspects of human sexuality. Topics may include optimal sexuality, romantic passion, sexual techniques, sex toys, BDSM, and sexual role-playing. A range of pleasure discourses and practices (beyond those focused on the genitalia) are addressed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF218",
            "Name": "Sexual Health and Well-being in Comics",
            "Desc": "This course will present a concentrated history of the major trends and patterns within the representation of human sexuality and sexual health in 20th- and 21st-century comics art. Students will be introduced to the unique and powerful role that comics have played in representing sexuality and sexual well-being through exposure to various artists and scholars on the subject. Students will explore key concepts through close readings of relevant texts, and through the application of key theoretical materials, modeling the kind of analytical work that students will then produce themselves in both discussion and written assignments.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: SMF 200 taken spring 2020",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF220",
            "Name": "Research Methods",
            "Desc": "This course introduces students to the philosophy and methods of social science and humanities research, including an examination of issues and approaches to conducting research in the areas of sexuality, couples, and families.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SMF 101, 204, PSYCH 236.",
            "Coreqs": "None",
            "Antireqs": " Antireq: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF230",
            "Name": "Introduction to Statistics in Sexuality, Marriage, and Family Studies",
            "Desc": "The goal of this introductory statistics course is to help students understand the logic and appropriate application of commonly used descriptive and inferential statistics, with examples drawn from various disciplines relevant to sexuality, marriage, and family studies.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SMF 101, 204, PSYCH 236.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF241",
            "Name": "Caregiving, Illness, and Relationships",
            "Desc": "In the typical health care model most of the attention is focused on the patient and their well-being, often ignoring the health, financial, and emotional impact on those who provide unpaid informal care and support - family and friends. Through the reading of memoirs, students with an interest in aging, health care, and the therapeutic professions will grapple with the profound impact that caregiving during illness has on carers and relationships across the spectrum - from young carers, to intimate partners, to adult children caring for aging parents, and beyond. Discussions will be grounded in the social, legal, and policy contexts.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF250",
            "Name": "Family Policy and the Law",
            "Desc": "There is a persistent tension in our society about where the responsibility for children lies: with the family or the society. This course examines various topics in Canadian social and family policy that affect children's development and family well-being. Topics may include the legislative provisions in areas such as parenting supports, income security, family law, youth justice, caregiving, and the distinct framework for Indigenous families. Students will use foundational concepts and theories to examine the strengths and limitations of policy to address the needs of families.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF301",
            "Name": "Communication and Counselling Skills",
            "Desc": "This course is an examination and analysis of the theories and methods of communication as applied within the processes of individual, relational, and family consultation and counselling.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SMF 101, 204, PSYCH 236; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SOCWK/SWREN 220R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF304",
            "Name": "Human Sexuality in Relationships",
            "Desc": "This course examines the development and experience of sexuality in a relational context from infancy to old age. Emphasis will be placed on sexual interaction and communication in adult relationships, but the effects of relationships on sexual experiences during infancy, childhood, adolescence, and old age may also be examined.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 204  or PSYCH 236; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF305",
            "Name": "Social Issues and Controversies in Human Sexuality",
            "Desc": "This course will provide a detailed examination of selected issues and controversies in the area of human sexuality.  Topics may include the role of sex education in schools, nature vs. nurture, censorship, and surrogate motherhood.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 204  or PSYCH 236; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF306",
            "Name": "Intimate Relationships",
            "Desc": "The interpersonal dynamics involved in intimate relationships will be examined. Topics such as attraction, commitment, love, trust, dissolution, and communication will be examined from various theoretical and empirical perspectives.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SMF 101, PSYCH 253/253R; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSYCH 354/354R",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF307",
            "Name": "Conflict in Close Relationships",
            "Desc": "Families and close relationships are among the most important and valued human experiences, but they can also be the source of much conflict and pain. This course will examine the role that conflict plays in close relationships, with a focus on topics such as emotions, power, third-party interventions, breakdown of relationships, conflict styles, and conflict resolution.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of SMF 101, PSYCH 253/253R; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF308",
            "Name": "Relational Therapy",
            "Desc": "Modern and postmodern therapeutic approaches to working clinically within relational contexts (e.g., family, romantic, other relationship configurations) are taken up. This course emphasizes cultural sensitivity, social justice, and anti-oppressive practices in therapeutic settings. Students will apply theory to practice and explore the ethical implications associated with doing clinical work.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 208; One of SMF 301, SOCWK/SWREN 220R; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF309",
            "Name": "Sex Therapy",
            "Desc": "This course examines therapeutic approaches and clinical issues when working with sexuality related problems. Research and theoretical issues in the field of sex therapy will be discussed and applied to clinical contexts. The applied focus enables students to connect clinical theory and ethical issues to practice.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 208; One of SMF 301, SOCWK/SWREN 220R; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF310",
            "Name": "Sexual and Relational Ethics",
            "Desc": "A study of social relationships and systems that support sexual identities and relationship structures which generate ethical issues related to attitudes, values, and behaviours at both the individual and group level. This course may address sexual and relationship ethics on local, national, and transnational scales focusing on how issues of ethics and morality have been socially constructed.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 101; SMF 204 or PSYCH 236; Level at least 2B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF317",
            "Name": "History of Sexuality: The Pre-Modern Period",
            "Desc": "This course introduces students to the history of Western sexuality, beginning with the ancient world and focusing primarily on the Middle Ages and the transition to modernity.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in HIST; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF318",
            "Name": "History of Sexuality: The Modern Period",
            "Desc": "This seminar introduces students to the history of sexuality. The course focuses on the 19th and 20th centuries.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: At least 0.50 unit in HIST; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF350",
            "Name": "Love and the Law",
            "Desc": "Relationship breakdown is a social phenomenon that can have legal consequences. This course provides students with a socio-legal foundation in current family law. Topics may include the court system, the litigation process, property division, spousal and child support, child co-parenting, child protection, high conflict families, and alternative dispute resolution processes. Students will learn about the strengths and limitation of the law to address relationship breakdown and develop transferable skills for careers in policy, social work, mediation, family justice, education, and community service organizations.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Any 200-level LS or SMF course; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF365",
            "Name": "Special Topics in Human Sexuality",
            "Desc": "A specialized course in topics related to human sexuality. Topics cover the application of theory and research in any area related to human sexuality. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 204 or PSYCH 236; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF366",
            "Name": "Special Topics in Couples, Marriages, and Family Studies",
            "Desc": "A specialized course in topics that cover the application of theory and research in any area related to couples, relationships, and families. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times.]",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 101; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF400",
            "Name": "Capstone Seminar",
            "Desc": "This seminar invites students to integrate their knowledge in the domains of sexuality, relationships, and families and make connections among theories, research, and practices. The capstone focus provides students the opportunity for critical self-reflection on their university experience. ",
            "Notes": "[Note: Normally students will take SMF 400 in their last term of study. Offered: Winter. SMF 220 equivalent courses: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221. SMF 230 equivalent courses: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241.]",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 220 or equivalent courses; SMF 230 or equivalent courses; SMF 310; Level at least 4B; Honours or General Sexuality, Marriage, and Family Studies students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF404",
            "Name": "Independent Study in Sexuality, Relationships, and/or Families",
            "Desc": "An independent, in-depth study based on empirical research and/or extensive reading of a topic in the area of sexuality, relationships, and/or families. The project must be approved by the academic supervisor of the course prior to enrolment. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of five times. SMF 220 equivalent courses: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221. SMF 230 equivalent courses: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SMF 220 or equivalent courses; SMF 230 or equivalent courses; One of SMF 304, 305, 306, 307, 365, 366, PSYCH 354/354R; SMF 310; Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF490",
            "Name": "Practicum and Professional Ethics",
            "Desc": "This course involves an assigned unpaid apprenticeship in a human services setting combined with regular seminar meetings. The practicum will require 15 hours per week. Paid or volunteer positions that are obtained outside the context of this course are not eligible for credit in this course. ",
            "Notes": "[Note: SMF 490 and SMF 491 can be taken independently of the SMF Human Services Practicum Specialization. An application is required prior to enrolment. The practicum placement component of SMF 490 is an eight-month commitment and continues into SMF 491. The two courses must be taken in consecutive terms.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 4A; Honours Sexuality, Marriage, and Family Studies students with a major average of at least 73%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF491",
            "Name": "Practicum and Applied Theory",
            "Desc": "This course involves the continuation of the SMF 490 practicum placement along with weekly seminar meetings that focus on integration of theory and practice. ",
            "Notes": "[Note: SMF 490 and SMF 491 can be taken independently of the SMF Human Services Practicum Specialization. The practicum placement component of SMF 491 is a continuation of the placement begun in SMF 490. The two courses must be taken in consecutive terms.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SMF 490; Honours Sexuality, Marriage, and Family Studies students with a major average of at least 73%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF494",
            "Name": "Seminar in Sexuality",
            "Desc": "This seminar allows students to integrate their knowledge in the domain of sexuality studies. Topics reflect current issues from a theoretical and research perspective. ",
            "Notes": "[Note: SMF 220 equivalent courses: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221. SMF 230 equivalent courses: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241.]",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 220 or equivalent courses; SMF 230 or equivalent courses; One of SMF 304, 305, 365; SMF 310; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF496",
            "Name": "Seminar in Family Studies",
            "Desc": "This seminar allows students to integrate their knowledge in the domains of couples, marriages, and family studies. Topics reflect current issues from a theoretical and research perspective. ",
            "Notes": "[Note: SMF 220 equivalent courses: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221. SMF 230 equivalent courses: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241.]",
            "Consent": "None",
            "Prereqs": "Prereq: SMF 220 or equivalent courses; SMF 230 or equivalent courses; One of SMF 306, 307, 366, PSYCH 354/354R; SMF 310; Level at least 3B",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF499A",
            "Name": "Thesis - Part 1",
            "Desc": "Under supervision of a faculty member, students normally will review literature, design a study, present a research proposal, analyze data, write a scholarly research paper, and deliver an oral presentation based on the paper (e.g., at the SMF Research Symposium). ",
            "Notes": "[Note: SMF 499A and SMF 499B can be taken independently of the SMF Intensive Research Specialization. A grade for SMF 499A will be submitted only after completion of SMF 499B. SMF 499A and 499B cannot be taken in the same term. The two courses must be taken in consecutive terms. SMF 220 equivalent courses: KIN 330, PSCI 315, PSYCH 291, REC 270, SDS/SWREN 251R, SOC/LS 221. SMF 230 equivalent courses: ARTS 280, ECON 221, ENVS 278, KIN 222, PSCI 314, PSYCH 292, REC 371, SDS/SWREN 250R, SOC/LS 280, STAT 202, 206, 211, 221, 231, 241.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SMF 220 or an equivalent course; SMF 230 or an equivalent course; Honours Sexuality, Marriage, and Family Studies students with a major average of at least 75%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SMF499B",
            "Name": "Thesis - Part 2",
            "Desc": "Continuation of SMF 499A. ",
            "Notes": "[Note: SMF 499A and SMF 499B can be taken independently of the SMF Intensive Research Specialization. A grade for SMF 499A will be submitted only after completion of SMF 499B. SMF 499A and 499B cannot be taken in the same term. The two courses must be taken in consecutive terms.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SMF 499A; Honours Sexuality, Marriage, and Family Studies students with a major average of at least 75%",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}