{
    "Name": "spanish",
    "Notes": "Native speakers and students with a knowledge of\r\nSpanish not acquired in an academic institution should contact the\r\nundergraduate advisor to determine their level of language ability.\nLanguage courses follow a sequence. Moving backwards in\r\nlanguage courses is not permitted.\nThe Department of Spanish and Latin American Studies\r\nreserves the right to refuse admission to, and/or credit for, any of\r\nits language courses to a student who has, in the view of the\r\nDepartment, a level of competence unsuited to that course.\nCourse descriptions for course numbers with a suffix of “W”\r\nare available on the Wilfrid Laurier University website.",
    "Courses": [
        {
            "courseCode": "SPAN101",
            "Name": "Introduction to Spanish 1",
            "Desc": "This course is for students with no previous knowledge of Spanish. The basic elements of Spanish grammar will be studied, with emphasis on group and individual oral practice. Focus will be given to the development of skills in listening/comprehension, speaking, reading, and writing. Multimedia exercises accompany each chapter of the textbook. Students will be expected to use them in the multimedia language centre and at home. ",
            "Notes": "[Note: SPAN 101 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "Antireq: 4U Spanish",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SPAN102",
            "Name": "Introduction to Spanish 2",
            "Desc": "This course is a continuation of SPAN 101, with emphasis being placed on more advanced elements of Spanish grammar and the spoken language. Students will be provided with a range of opportunities to gain practical insights into the customs and cultural contexts of the contemporary Spanish-speaking world. ",
            "Notes": "[Note: SPAN 102 is not open to students with native, near-native, or similar advanced ability.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 101. ",
            "Coreqs": "None",
            "Antireqs": " Antireq: 4U Spanish",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SPAN150",
            "Name": "Welcome to Latin America",
            "Desc": "Discover the vibrant diversity of Latin American cultures and societies from their genesis in conquest and colonization through to independence, and the post-colonial quest for identity and self-determination. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN201A",
            "Name": "Intermediate Spanish 1",
            "Desc": "This course develops intermediate skills in reading, writing, speaking, and listening. The primary goals are to build communicative competence and enhance social and cultural awareness of the Spanish-speaking world.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 102 or 4U Spanish.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SPAN 210",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN201B",
            "Name": "Intermediate Spanish 2",
            "Desc": "The course continues development of intermediate skills in reading, writing, speaking, and listening. The primary goals of the course are the further enhancement of communicative competence, and social and cultural awareness. Particular attention is placed on the use of the subjunctive mood.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 201A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SPAN 210",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN210",
            "Name": "Spanish Conversation",
            "Desc": "Practice makes perfect! In this course, students will continue to develop and hone their Spanish speaking and listening skills through discussions of current topics in Spanish-speaking countries. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be taken a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SPAN 201A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN217",
            "Name": "First Nations, Native Americans, Pueblos Originarios",
            "Desc": "This course will introduce and expose students to the Indigenous civilizations that embody the Americas. Students will look at the cosmogonies, histories, and cultures of Indigenous peoples from pre-Columbian times to the 20th century. They will analyze Latin America's Pueblos Originarios' perspectives on conquest, colonization, and independence, and compare such perspectives to those of First Nations and Native Americans. Through their study of colonial, social, economic, and political relations, students will examine how the meanings of these categories changed over time and how Indigenous peoples have contributed to the ethnically diverse regional societies that continue to characterize Latin America today. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN234",
            "Name": "Parallel Revolutions in a Nascent Continent",
            "Desc": "This course provides a broad foundation to the varied and complex geographical, ethnic, social, and historical forces that have shaped contemporary Latin American nations from the early 19th-century independence period to current affairs. Students will be introduced to the diverse regions of the continent: Mexico, Central America, the Caribbean, the Bolivarian republics, and the Southern Cone. Students will analyze and discuss nation-building factors such as European-African-Asian-New World interactions, ethnic mixtures, military takeovers, revolutions, U.S. interventions in the region, and migratory experiences. Discussions will also be aimed at contrasting and comparing the contemporary and diverse cultural manifestations of the peoples living in Latin America and the cultural transformation of Latin Americans who have emigrated to other parts of the world, as well as the perceptions of Latin Americans in other cultures. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN290",
            "Name": "Approaches to Translation",
            "Desc": "This course introduces students to translation studies through the examination of different approaches to the discipline, along with practical experience. Students review the grammar of the Spanish and English languages within particular contexts as the basis for translation practices. The course also enhances students' lexical and semantic knowledge of the Spanish language through an experiential component in the community. ",
            "Notes": "[Note: Formerly SPAN 450.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 201A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SPAN 450",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN300",
            "Name": "Theories of Cultural Identities",
            "Desc": "Students examine the work of various theorists, both historical and modern, who have contributed to the intellectual framework within which culture and cultural expression can be studied in order to deepen their ability to conduct critical inquiry into the formation of cultural identity. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN301A",
            "Name": "Spanish in Context 1",
            "Desc": "This course promotes students' oral and written abilities, as well as their critical understanding of Latin American history and culture. Course components include: written and oral/aural practice of Spanish through oral reports, class discussions and debates on assigned topics, short literary works, and films. It offers a review of more advanced grammatical structures with the aim of achieving greater accuracy.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 201B or 210.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SPAN 261W/303W",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN301B",
            "Name": "Spanish in Context 2",
            "Desc": "This course further develops the development of critical understanding of Latin American history and culture. Course components include: assigned readings in a variety of genres, critical cultural analysis, in-class discussions, written essays, and the viewing of films.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 301A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: SPAN 262W/304W",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN317",
            "Name": "Afro-Latin America",
            "Desc": "The African diaspora is central to understanding the historical development and contemporary expressions of Latin American identity. Through the study of historical events, cultural production, and current affairs, this course examines African cultural legacies in Latin America, and explains the economic, societal, and political challenges faced by Afro-Latin Americans today. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN326",
            "Name": "Theatre of the Golden Age: Dames, Divas, and Dandies",
            "Desc": "The aim of the course is to acquaint students with works by outstanding playwrights from Spain's Renaissance and Baroque periods. Students will look at the construction of character, the interplay between the sexes, and the struggle for justice. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN329",
            "Name": "Lights, Camera, Action! Film Production in Spain and Latin America",
            "Desc": "This course explores how Spanish and Latin American films address the intersection of class, gender, and ethnicity, and the construction of regional, national, and cultural identities. ",
            "Notes": "[Note: Taught in English. This is a repeatable course, subject to different content; it may be taken a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN344",
            "Name": "Special Topics in Hispanic Studies",
            "Desc": "Special topics in Hispanic studies, as announced by the Department. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN345",
            "Name": "Directed Studies",
            "Desc": "Study in a limited field under tutorial guidance. ",
            "Notes": "[Note: This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "Department Consent Required",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN387",
            "Name": "Gender, Power, and Representations in Latin America",
            "Desc": "This course analyzes women's cultural production in Latin America. Examining the construction and the representation of gender/sex differences, the course explores the power relations inherent in these representations, while also examining how gender roles and expectations are linked to representations of class, race, sexuality, age, nationality, and ability. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN390",
            "Name": "Introduction to Spanish Business Translation",
            "Desc": "This course is designed for students enrolled in their third year of the General or Honours program in Spanish. A strong command of Spanish and English is required. Intense concentration of the Spanish language through oral and written work will focus on business-oriented fundamentals of communication such as letter writing, as well as the translation of primary source materials such as newspapers and business documents.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 301A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN395",
            "Name": "Cultural Dimensions in English/Spanish Literary Translation",
            "Desc": "This course focuses on the actual practice of translating literature, not only as the transformation of textual expressions, but also as a process of cultural interpretation. Besides reinforcing vocabulary and grammar, students will also review and research notions of different literary genres (poetry, narrative, and theatre), and solidify their knowledge of cultural studies.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SPAN 301A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN400",
            "Name": "Memory, Human Rights, and Reconciliation",
            "Desc": "We remember the past to understand the present and imagine the future. With a focus on Latin America and Spain this course examines how the diverse forms of cultural production help develop our shared understanding of past violations of human rights to demand justice, build resilience, and develop tolerance. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN410",
            "Name": "Visual Culture in the Contemporary Hispanic World",
            "Desc": "This course explores the expressive avenues opened up by the confluence of verbal and visual representation in contemporary Hispanic cultural production. Through a close analysis of representative visual and literary works from Latin America and Spain covering a variety of genres and media, including poetry, novel, short story, theatre, painting, photography, and film, the many ways in which words and images interact with each other and make meaning will be examined. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN430",
            "Name": "Unruly Women in Early Modern Hispanic Culture",
            "Desc": "This course will examine works by and about women in early modern Hispanic culture (16th and 17th centuries), with  particular attention to engagements with and subversions of patriarchal culture in theatre, prose, and poetry. Authors to be discussed  may include, among others, Santa Teresa de Avila, Sor Juana Ines de la Cruz, Maria de Zayas, and Ana Caro. ",
            "Notes": "[Note: Taught in English.]",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 150; Level at least 2A.",
            "Coreqs": "None",
            "Antireqs": " Antireq: WS 430",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SPAN490",
            "Name": "Advanced Translation",
            "Desc": "This course is designed for students enrolled in the third and fourth year of the General or Honours program in Spanish. Fluency in both Spanish and English is required. The objective of this course is to refine translation techniques in order to enable the student to provide accurate and idiomatic translations of English texts in Spanish and vice versa.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: SPAN 301A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}