{
    "Name": "statistics",
    "Notes": "None",
    "Courses": [
        {
            "courseCode": "STAT202",
            "Name": "Introductory Statistics for Scientists",
            "Desc": "Elementary probability, populations, samples, and distributions with biological examples. Methods for data summary and presentation. Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Science or Knowledge Integration students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 220, 230",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT206",
            "Name": "Statistics for Software Engineering",
            "Desc": "Empirical problem solving with applications to software engineering. An introduction to probability theory. An introduction to distribution theory and to methods of statistical inference, including confidence intervals and hypothesis testing. An introduction to regression. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 115, 119; Software Eng students only.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT211",
            "Name": "Introductory Statistics and Sampling for Accounting",
            "Desc": "Descriptive statistics, probability, discrete and continuous random variables. Sampling distributions and simple hypothesis testing. Introduction to survey sampling. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 109; Arts/Acc and SciBiot/CA students only.",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT220",
            "Name": "Probability (Non-Specialist Level)",
            "Desc": "The laws of probability, discrete and continuous random variables, expectation, central limit theorem. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of MATH 118, 119, 128, 138, 148.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 202, 230, 240",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT221",
            "Name": "Statistics (Non-Specialist Level)",
            "Desc": "Empirical problem solving, measurement systems, causal relationships, statistical models, estimation, confidence intervals, tests of significance. [Offered: F, W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MATH 128, 138, 148) & (One of STAT 220, 230, 240).",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 231, STAT 241.",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT230",
            "Name": "Probability",
            "Desc": "This course provides an introduction to probability models including sample spaces, mutually exclusive and independent events, conditional probability and Bayes' Theorem. The named distributions (Discrete Uniform, Hypergeometric, Binomial, Negative Binomial, Geometric, Poisson, Continuous Uniform, Exponential, Normal (Gaussian), and Multinomial) are used to model real phenomena. Discrete and continuous univariate random variables and their distributions are discussed. Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed. Students learn how to calculate and interpret means, variances and covariances particularly for the named distributions. The Central Limit Theorem is used to approximate probabilities. ",
            "Notes": "[Note: Many upper-year Statistics courses require a grade of at least 60% in STAT 230. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: ((One of MATH 116, 117, 137, 147) with a minimum grade of 80%) or (MATH 128 with a minimum grade of 60%) or (one of MATH 118, 119, 138, 148); Honours Math or Math/Phys students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 220, 240",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "STAT231",
            "Name": "Statistics",
            "Desc": "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded. The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized. Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed. The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses. The interpretation of confidence intervals and p-values will be emphasized. The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests. Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples. ",
            "Notes": "[Note: Many upper-year Statistics courses require a grade of at least 60% in STAT 231. Offered: F,W,S]",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MATH 118, 119, 128, 138, 148) and (STAT 220 with a grade of at least 70% or STAT 230 or 240); Honours Math or Math/Phys students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 221, 241",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "STAT240",
            "Name": "Probability (Advanced Level)",
            "Desc": "STAT 240 is an advanced-level enriched version of STAT 230. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: ((MATH 137 or 147) with a grade of at least 80%) or (MATH 138 or 148); Honours Mathematics students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 220, 230",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT241",
            "Name": "Statistics (Advanced Level)",
            "Desc": "STAT 241 is an advanced-level enriched version of STAT 231. ",
            "Notes": "[Note: Students with a cumulative math average of at least 80% are encouraged to register in STAT 241. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 138/148 & STAT 230/240; Hon Math only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 221,231.",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT316",
            "Name": "Introduction to Statistical Problem Solving",
            "Desc": "This is an applications oriented course which prepares the nonmathematical student to use statistical software as a research tool. Topics include aids for statistical analysis and the preparation of documents such as reports and theses. The course provides sufficient background for application to other problems specific to the individual's field.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of ECON 221, ENVS 278, HLTH 204, SDS 250R, KIN 232, PSCI 214/314, PSYCH 292, REC 371, SOC/LS 280, any STAT course; Not open to Honours Mathematics students.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 331, 371",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT321",
            "Name": "Regression and Forecasting (Non-Specialist Level)",
            "Desc": "Modeling the relationship between a response variable and several explanatory variables via regression models. Model diagnostics and improvement. Using regression models for forecasting, Exponential smoothing. Simple time series modeling. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of MATH 225, 235, 245) and (One of STAT 221, 231, 241).",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 331, 371, 373, 443, AFM 323/STAT 374",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT322",
            "Name": "Sampling and Experimental Design (Non-Specialist Level)",
            "Desc": "Planning sample surveys; simple random sampling; stratified sampling. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Applications of design principles. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 221 or 231 or 241.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 332, 372",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT330",
            "Name": "Mathematical Statistics",
            "Desc": "This course provides a mathematically rigorous treatment for topics covered in STAT 230 and 231, and to make essential extensions to the multivariate case. Maximum likelihood estimation. Random variables and distribution theory. Generating functions. Functions of random variables. Limiting distributions. Large sample theory of likelihood methods. Likelihood ratio tests. \r\nJoint probability (density) functions, marginal probability (density) functions, and conditional probability (density) functions of two or more random variables are discussed. Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.  Properties of the Multinomial and Bivariate Normal distributions are proved. Limiting distributions, including convergence in probability and convergence in distribution, are discussed. Important results, including the Weak Law of Large Numbers, Central Limit Theorem, Slutsky's theorem, and the Delta Method, are introduced with applications. The maximum likelihood method is discussed for the multi-parameter case. Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions. Tests for simple and composite hypotheses are constructed using the Likelihood Ratio Test. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 237 or 247, (STAT 230 with a grade of at least 60% or STAT 240), STAT 231 or 241.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 334",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT331",
            "Name": "Applied Linear Models",
            "Desc": "Modeling the relationship between a response variable and several explanatory variables (an output-input system) via regression models. Least squares algorithm for estimation of parameters. Hypothesis testing and prediction. Model diagnostics and improvement. Algorithms for variable selection. Nonlinear regression and other methods. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 235 or 245, (STAT 231 with a grade of at least 60%) or STAT 241 or (SYDE 212 with a grade of at least 70%).",
            "Coreqs": "None",
            "Antireqs": " Antireq: ECON 421, STAT 321, 371, 373,AFM 323/STAT 374, SYDE 334",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT332",
            "Name": "Sampling and Experimental Design",
            "Desc": "Designing sample surveys. Probability sampling designs. Estimation with elementary designs. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Designing for comparison of groups. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (STAT 231 with a grade of at least 60%) or STAT 241 or (SYDE 212 with a grade of at least 70%).",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 361, STAT 322, 372",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT333",
            "Name": "Stochastic Processes 1",
            "Desc": "This course provides an introduction to stochastic processes, with an emphasis on regenerative phenomena. Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 230 with a grade of at least 60% or STAT 240; MATH 237 or 247.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 334",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT334",
            "Name": "Probability Models for Business and Accounting",
            "Desc": "Random variables and distribution theory, conditional expectations, moment and probability generating functions, change of variables, random walks, Markov chains, Markov processes. [Offered F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 237 or 247, (STAT 230 with a grade of at least 60% or STAT 240); STAT 231 or 241; Business/Math double degree, Mathematics/CPA or Math/Business students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 330, 333",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT337",
            "Name": "Introduction to Biostatistics",
            "Desc": "This course will provide an introduction to statistical methods in health research. Topics to be covered include types of medical data, measures of disease prevalence and incidence, age and sex adjustment of disease rates, sensitivity and specificity of diagnostic tests, ROC curves, measures of association between risk factors and disease, major sources of medical data in the Canadian context including surveys, registries, and clinical studies such as cohort studies, clinical trials and case-control studies. Papers from the medical literature will be used throughout to illustrate the concepts. Introduction to SAS for data analysis and an introduction to database management tools. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (STAT 221 with a grade of at least 60%) or STAT 231 or 241.",
            "Coreqs": "None",
            "Antireqs": " Antireq: HLTH 333, STAT 232",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT340",
            "Name": "Stochastic Simulation Methods",
            "Desc": "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems. Mathematical treatment of the underlying stochastic concepts and proofs. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (One of CS 116, 136, 138, 145, SYDE 221/322) and (STAT 230 with a grade of at least 60% or STAT 240) and (STAT 231 or 241)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT341",
            "Name": "Computational Statistics and Data Analysis",
            "Desc": "A computationally focused approach to statistical reasoning in the context of real data. Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics. Computational approaches to inductive inference and the assessment of predictive accuracy. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 237 or 247, (STAT 230 with a grade of at least 60% or STAT 240), STAT 231 or 241",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT371",
            "Name": "Applied Linear Models and Process Improvement for Business",
            "Desc": "Practical and theoretical aspects of simple and multiple linear regression models. Model building, fitting, and assessment. Process thinking and improvement. Strategies for variation reduction such as control charting. Process monitoring, control, and adjustment. Applications to problems in business. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (MATH 235 or 245) and (STAT 231 with a grade of at least 60% or STAT 241); Bus/Math dbl degree, Math/Bus, Math/FARM, Math/ITM, or Math Optimization - Business Spec students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 321, 331,374, 373",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT372",
            "Name": "Survey Sampling and Experimental Design Techniques for Business",
            "Desc": "Design and analysis of surveys. Management of sample and non-sample error. Simple random sampling and stratified random sampling. Additional topics in survey sampling. Observational and experimental studies. Principles for the design of experiments. Analysis of variance, factorial experiments, and interaction. Application to problems in business. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 231 with a grade of at least 60% or STAT 241; Business/Math Double Degree, Math/Business, Math/FARM, Math/ITM or Mathematical Optimization - Business Specialization students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 322, 332",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT373",
            "Name": "Regression and Forecasting Methods in Finance",
            "Desc": "Application of regression and time series models in finance; multiple regression; algebraic and geometric representation of least squares; inference methods - confidence intervals and hypothesis tests, ANOVA, prediction; model building and assessment; time series modeling; autoregressive AR(1) models - fitting, assessment and prediction; moving average smoothing, seasonal adjustment; non-stationarity and differencing. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 136, STAT 231 with a grade of 60% or STAT 241; Computing & Financial Management or Math/CPA students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 321, 331, 371, 443, AFM 323/STAT 374",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT374",
            "Name": "Quantitative Foundations for Finance",
            "Desc": "This course introduces analytical and statistical methods commonly used in finance, with applications to investment management and corporate finance.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: MATH 136, STAT 231 with a grade of 60% or STAT 241; Computing & Financial Management or Math/CPA students only.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 321, 331, 371, 443, AFM 323/STAT 374",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT430",
            "Name": "Experimental Design",
            "Desc": "Review of experimental designs in a regression setting; analysis of variance; replication, balance, blocking, randomization, and interaction; one-way layout, two-way layout, and Latin square as special cases; factorial structure of treatments; covariates; treatment contrasts; two-level fractional factorial designs; fixed versus random effects; split-plot and repeated-measures designs; other topics. [Offered: F,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (STAT 331 or 371) and (STAT 332 or 372).",
            "Coreqs": "None",
            "Antireqs": " Antireq: (for Arts and Environmental Studies students) BIOL 461, PSYCH 391",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT431",
            "Name": "Generalized Linear Models and their Applications",
            "Desc": "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 330, (331 or 371)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT433",
            "Name": "Stochastic Processes 2",
            "Desc": "This course provides further ideas and methods in stochastic modelling, with an emphasis on continuous-time stochastic processes. Topics cover time to absorption based quantities and discrete phase-type distributions of discrete-time Markov chains, continuous-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, and applications including birth and death processes and queueing models of practical interest. Other topics may include continuous phase-type distributions, renewal theory and limit theorems for regenerative processes, and phase-type renewal processes. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT435",
            "Name": "Statistical Methods for Process Improvements",
            "Desc": "Statistical methods for improving processes based on observational data. Assessment of measurement systems. Strategies for variation reduction. Process monitoring, control, and adjustment. Clue generation techniques for determining the sources of variability. Variation transmission. [Offered: W]",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: STAT 332 or 372",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT436",
            "Name": "Introduction to the Analysis of Spatial Data in Health Research",
            "Desc": "The objective of this course is to develop understanding and working knowledge of spatial models and analysis of spatial data. The course provides an introduction to the rudiments of statistical inference based on spatially correlated data. Methods of estimation and testing will be developed for geostatistical models based on variograms and spatial autogressive models. Concepts and application of methods will be emphasized through case studies and projects with health applications. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT437",
            "Name": "Statistical Methods for Life History Analysis",
            "Desc": "Statistical methods for the analysis of longitudinal data; hierarchical models, marginal models, and transitional models. Parametric and semiparametric methods for the analysis of survival data under censoring and truncation. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT438",
            "Name": "Advanced Methods in Biostatistics",
            "Desc": "Causal inference methodologies including propensity score matching and inverse probability weighting. Methods for handling incomplete data and covariate measurement error; likelihood based on joint models, estimating functions.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 431",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT440",
            "Name": "Computational Inference",
            "Desc": "Introduction to and application of computational methods in statistical inference. Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques. Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 330, STAT 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT441",
            "Name": "Statistical Learning - Classification",
            "Desc": "Classification is the problem of predicting a discrete outcome from a set of explanatory variables. Main topics include logistic regression, neural networks, tree-based methods, support vector machines, and nearest neighbour methods. Other topics include model assessment, training, and tuning. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 341; STAT 331 or 371",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT442",
            "Name": "Data Visualization",
            "Desc": "Visualization methods applied to data. Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data. Order and layout effects on tables and graphics. Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing. Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices. Glyphs (e.g., cartoon, statistical, or heatmap) and radial and parallel coordinates. [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 341",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT443",
            "Name": "Forecasting",
            "Desc": "Modelling techniques for forecasting time series data: smoothing methods,  regression including penalty/regularization methods, the Box-Jenkins framework, stationary and non-stationary processes, both with and without seasonal effects. Other topics may include: ARCH/GARCH models, Bayesian methods, dynamic linear models, Markov Chain Monte Carlo simulation, spectral density analysis, and periodograms. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 331 or 371 or SYDE 334.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 321, 373",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT444",
            "Name": "Statistical Learning - Advanced Regression",
            "Desc": "This course introduces modern applied regression methods for continuous response modelling, emphasizing both explainability and predictive power. Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants. Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 341; STAT 331 or 371",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT450",
            "Name": "Estimation and Hypothesis Testing",
            "Desc": "Discussion of inference problems under the headings of hypothesis testing and point and interval estimation. Frequentist and Bayesian approaches to inference. Construction and evaluation of tests and estimators. Large sample theory of point estimation. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 330",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT454",
            "Name": "Sampling Theory and Practice",
            "Desc": "Sources of survey error. Probability sampling designs, estimation, and efficiency comparisons. Distribution theory and confidence intervals. Generalized regression estimation. Software for survey analysis. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 332 or 372",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT464",
            "Name": "Topics in Probability Theory",
            "Desc": "Special Topics course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 333",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT466",
            "Name": "Topics in Statistics 1",
            "Desc": "Special topics course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: STAT 330, 331",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT467",
            "Name": "Topics in Statistics 2",
            "Desc": "Special topics course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT468",
            "Name": "Readings in Statistics 1",
            "Desc": "Reading course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "STAT469",
            "Name": "Readings in Statistics 2",
            "Desc": "Reading course as announced by the Department.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}