{
    "Name": "socialwork\r\n\r\n(bachelorofsocialwork)",
    "Notes": "SWREN 400-level courses represent requirements for the Bachelor of Social Work (BSW), Honours degree.\nThe following SWREN 100s, 200s, 300s are specific prerequisite\r\ncourses available only to students who have been granted Conditional\r\nAdmission to the BSW program.",
    "Courses": [
        {
            "courseCode": "SWREN120R",
            "Name": "Introduction to Social Work",
            "Desc": "This course provides an overview of the social work profession as part of the social welfare system in Canada, emphasizing Indigenous and Eurocentric histories, worldviews, values, ethics, and practice approaches, including individual, family, community, and structural settings. ",
            "Notes": "[Note: SWREN 120R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN220R",
            "Name": "Social Work with Individuals - Theory and Practice 1",
            "Desc": "A presentation of some of the theoretical constructs necessary for the understanding of the individual in the casework relationship, as well as an introduction to some appropriate casework interventions. Emphasis in the course will be theoretical. ",
            "Notes": "[Note: SWREN 220R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN221R",
            "Name": "Social Group Work",
            "Desc": "Presentation of some of the theoretical constructs necessary for an understanding of social group work as well as an introduction to methodology and interventions. ",
            "Notes": "[Note: SWREN 221R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN222R",
            "Name": "Community Organization",
            "Desc": "An examination of social work practice as it relates to functional and geographical communities. The course will explore the theoretical foundations of organization practice as well as a variety of models. ",
            "Notes": "[Note: SWREN 222R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN224R",
            "Name": "Poverty in Canada and its Social Consequences",
            "Desc": "A sociological analysis of poverty in contemporary Canada as it underlies a multiplicity of interlocking social problems. ",
            "Notes": "[Note: SWREN 224R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SOC 101/101R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN250R",
            "Name": "Social Statistics",
            "Desc": "This introductory level statistics course will emphasize the collection, manipulation, descriptive presentation, and statistical analysis of social research data. ",
            "Notes": "[Note: SWREN 250R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to students in the Faculty of Mathematics",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN251R",
            "Name": "Social Research",
            "Desc": "Introduction to the philosophy and methodology of applied social science research, including treatment of the problems and strategies of research design and execution. ",
            "Notes": "[Note: SWREN 251R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A; Not open to students in the Faculty of\nMathematics.",
            "Coreqs": "None",
            "Antireqs": " Antireq: ISS 251R, LS/SOC 221, LS/SOC 321, PSYCH 291, REC 270, SMF 220",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN300R",
            "Name": "Canadian Social Welfare Policy",
            "Desc": "This course will introduce students to the concept of social welfare as it has evolved in the post-industrial era. It will examine various social, economic and political factors that have shaped Canadian social welfare policy and it will consider present-day factors that are transforming that policy. ",
            "Notes": "[Note: SWREN 300R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN301R",
            "Name": "Understanding Diversity in Canada",
            "Desc": "This course explores the meaning of diversity in contemporary Canadian society through social work and social justice perspectives. Students will critically analyze the ideas of \"self\" and \"others\" across micro, mezzo, and macro levels of practice. Concepts of power, privilege, oppression, discrimination, stereotypes, prejudice, multidimensionality, and intersectionality will be explored. ",
            "Notes": "[Note: SWREN 301R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN311R",
            "Name": "Indigenous Peoples and Canadian Public Policy",
            "Desc": "Framed within the Truth and Reconciliation process underway in Canada, this course examines the historical and ongoing colonial processes and impacts of government policies targeting First Nations, Inuit, and Métis peoples. Particular analysis will be given to government policy as a cause of (and response to) social, political, and economic problems experienced by Indigenous peoples in Canada. ",
            "Notes": "[Note: SWREN 311R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN312R",
            "Name": "Homelessness and Public Policy",
            "Desc": "This course provides students with a basic overview of homelessness in modern society. Its goal is to familiarize students with the human, social, political and economic aspects of homelessness. Throughout, the emphasis will be on understanding homelessness from a public policy framework - its incidence and prevalence, etiology, consequences, and strategies for its prevention and amelioration. ",
            "Notes": "[Note: SWREN 312R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN321R",
            "Name": "Social Work with Families",
            "Desc": "Presentation of some of the theoretical constructs necessary for an understanding of the family in the social work relationship as well as an introduction to methodology and interventions. ",
            "Notes": "[Note: SWREN 321R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: SWREN 120R",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN331R",
            "Name": "Social Inequality, Social Justice, and Social Action",
            "Desc": "This course examines the hidden causes of inequality and associated social injustices. It provides a snapshot of main issues associated with modern society and the evidence that ties them to persistent inequality and injustice. The course reviews not only the major types of inequality but also social and public policy responses to them. ",
            "Notes": "[Note: Formerly ISS 331R. SWREN 331R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN349R",
            "Name": "Cross-Cultural Psychology",
            "Desc": "This course focuses on human psychology (behaviours, cognition, emotion, motivation, and personality) across cultures, with the aim of raising awareness and understanding of human commonality and diversity. It examines theoretical, methodological, and ethical issues in cross-cultural psychology in light of the current literature. ",
            "Notes": "[Note: SWREN 349R is available only to students who have been given conditional admission to the BSW program; such students must have already completed their first undergraduate degree.]",
            "Consent": "None",
            "Prereqs": "Prereq: PSYCH 253/253R.",
            "Coreqs": "None",
            "Antireqs": " Antireq: PSYCH 352",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN411R",
            "Name": "Indigenous Knowledges and Decolonizing Social Work Practice with Indigenous Peoples",
            "Desc": "This integrative practice course examines colonial impacts on social work policies and service delivery that adversely affect Indigenous Peoples in Canada. Indigenous knowledges and the importance of cultural practices for healing central to shifting colonial notions of 'best interest' are examined. Engagement in a reflexive stance encourages an inward gaze and analysis of the structural powers that work to sustain political, economic, environmental, and social injustices, as well as the identification of and actions towards decolonizing social work practices, relationships, and allyship with Indigenous Peoples.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN414R",
            "Name": "Interviewing and Assessment in Social Work Practice",
            "Desc": "This social work methods course explores the theory and skills of generalist social work practice, with particular attention to interviewing, communication, and assessment skills used with individuals, families, organizations, and communities.  Emphasis is placed on developing capacity for \"critical reflection\" on the social work practitioner's professional and personal self.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN422R",
            "Name": "Macro Practice: Critical Considerations of Community Organization",
            "Desc": "The course examines and compares the strengths, limitations, differential uses, and interconnections of the range of skills needed for community organization, social planning, and social policy practice. Practical applications such as conference planning, proposal writing and fund raising will be explored.",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN423R",
            "Name": "Social Work Knowledge and Skills for Diverse Group Work Practice",
            "Desc": "The aim of this course is to develop student's knowledge of different approaches to social group work practice, and the ways in which specialized knowledge of client's life conditions, life circumstances, and significant life events informs social work practice with groups within a generalist framework. Emphasis is placed upon conceptualizing and analyzing group-work skills and the capacity for self-directed practice with groups directed towards increasing the resiliency of the group as a whole and the resiliency of individual group members. A salient goal is the use of democratic means so that group process in all social work groups reflects a vision of social justice.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN424R",
            "Name": "Social Work and Organizations",
            "Desc": "In this course, students will apply critical and anti-oppressive theories to examine how organizations shape social work practice. Students will investigate the relations between social workers, service users, agency colleagues, and other institutions in particular practice settings, and how these are influenced by policies, mandates, forms, and other institutional texts. Key concepts will include diversity, inclusion, anti-racism, decolonization, and institutional (in)justice.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN431R",
            "Name": "Practitioner Research in Social Work: Intersectional Considerations",
            "Desc": "This course examines contemporary fields of practice. Attention is given to historical developments, service delivery systems, and practices. Research activities help develop a critical understanding of how social experience impacts the ways that people with diverse experiences access and encounter some of the major fields of practice.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN434R",
            "Name": "Selected Theories for Social Work Practice: Analysis and Application",
            "Desc": "In this course, students are provided an overview of selected theories that guide a generalist-eclectic approach to social work practice. It offers students the opportunity to engage in the critical analysis and application of contemporary theories by integrating theory with social work values and principles. The course emphasizes the critical use of theory to understanding, critiquing, and transforming the social work profession.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN441R",
            "Name": "Practicum 1",
            "Desc": "This first practicum phase helps students understand the general structure and functioning of the helping network and the place of agency-based community settings in it.  Simultaneously, the students begin to integrate interviewing and assessment skills to formulate an intervention plan with sensitivity to the diversity of the setting.  A bi-weekly seminar runs concurrently with the practicum.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only.",
            "Coreqs": " Coreq: SWREN 414R",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN442R",
            "Name": "Practicum 2",
            "Desc": "The second practicum phase develops students' intervention skills.  Opportunity is given to enhance social work practice skills specific to particular client populations within the context of diversity, and to develop awareness of one's professional self in relation to social work practice within the agency context.  A bi-weekly seminar runs concurrently with the practicum.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SWREN 414R, 441R; Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN443R",
            "Name": "Practicum 3",
            "Desc": "The third practicum phase helps students demonstrate understanding of, and ability to use, a range of interventions within the context of diversity.  Professional identification and the integration of theory with practice are emphasized.  A bi-weekly seminar runs concurrently with the practicum.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: SWREN 414R, 442R; Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN470R",
            "Name": "Mental Health Landscapes, Concepts, and Practice Approaches",
            "Desc": "This course uses an intersectional lens to critically explore social work practice and distress, mental health, and substance use. Students explore, understand, and apply different knowledges, worldviews, and intervention frameworks related to distress, mental health, and substance use, including national policy frameworks and Indigenous approaches to wellness and healing. Key topics in mental health and substance use are considered including trauma and trauma-informed services, harm reduction, and recovery-oriented principles and services as they are relevant to social work practice. Students are introduced to community- and peer-based approaches to distress and recovery.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": true
        },
        {
            "courseCode": "SWREN471R",
            "Name": "Social Work with Older Adults: Critical Issues and Future Trends",
            "Desc": "Focusing on social work practice, policy and research, the course examines issues of aging such as health, economic changes, role transition, family dynamics and losses.  The course also looks at implications of societal issues and the influence of recent Canadian research in the field of aging.  Current innovative and traditional programs will be examined for their relevance for future work with populations of older adults.",
            "Notes": "None",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN472R",
            "Name": "International Context of Practice: An Experiential Learning Opportunity",
            "Desc": "This course provides a framework for understanding a developing country through a comparative study with Canada. The collective responses of citizens in meeting community needs in the context of colonial legacies and contemporary global influences are highlighted in both settings. The international learning experience usually takes place during Reading Week and is complemented by three days of pre-trip learning focusing on Canadian realities and one post-trip day to reflect upon the comparative analysis. ",
            "Notes": "[Note: Student is responsible for travel expenses.]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SWREN490R",
            "Name": "Special Topics in Social Work",
            "Desc": "This special topics course will provide students with opportunities to learn about emerging trends and issues in the field of social work. ",
            "Notes": "[Note: For permission to enrol in the course, students should consult the department offering the desired section. This is a repeatable course, subject to different content; it may be completed a total of three times.]",
            "Consent": "None",
            "Prereqs": "Prereq: Bachelor of Social Work students only",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}