{
    "Name": "systemsdesignengineering",
    "Notes": "The numbering of Systems Design Engineering courses is as\r\nfollows:",
    "Courses": [
        {
            "courseCode": "SYDE101",
            "Name": "Communications in Systems Design Engineering-Written and Oral",
            "Desc": "This course introduces first-year students to systems design engineering with a focus on the engineering profession, and technical communication skills. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 101",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE101L",
            "Name": "Communications in Systems Design Engineering-Visualization",
            "Desc": "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD). [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 101L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE102",
            "Name": "Seminar",
            "Desc": "Systems design first-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE111",
            "Name": "Calculus 1",
            "Desc": "Differential calculus: limits, continuity, derivatives, differentials, applications. Sequences and series: convergence, power series, Taylor expansions. Simple numerical methods. Introduction to integration, indefinite and definite integral, techniques of integration. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering or 1A Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 116, 117, 127, 137, 147",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE112",
            "Name": "Calculus 2",
            "Desc": "Integration: improper integrals and applications. Multi-variable calculus: partial, total, and directional derivative, gradient divergence, double and triple integrals, Jacobian, solution techniques, applications. [Offered: W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering or 1B Biomedical Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: MATH 118, 119, 128, 138, 148",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE113",
            "Name": "Elementary Engineering Mathematics",
            "Desc": "Functions: trigonometric, exponential, log, inverse functions. Mathematical notation and proof techniques. Metric spaces. Geometry and algebra: root-finding, vectors, coordinate systems, lines and planes, conic sections, complex numbers. Introduction to numerical computation: binary and floating point numbers and arithmetic, accuracy and sources of error. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering or 1A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE114",
            "Name": "Matrices and Linear Systems",
            "Desc": "Matrix algebra, inverses, solution of linear systems, determinants, eigenvalues and eigenvectors, lower-upper (LU) factorization. Numerical methods: sensitivity, condition number. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering or 1B Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE121",
            "Name": "Digital Computation",
            "Desc": "Computer systems, problem solving, data and programs, structured programming, arrays, matrices and pointers, correct and efficient algorithms, data structures. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 121, CHE 121, CIVE 121, ECE 150, MTE 121/GENE 121",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE161",
            "Name": "Introduction to Design",
            "Desc": "Multidisciplinary system design, the design process, problem definition, life-cycle design, design specification, concept/design generation and evaluation, design for manufacturing and assembly, system modelling and analysis, introduction to mechanical design, prototyping, safety and responsibility in engineering design, design documentation. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 161",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE162",
            "Name": "Human Factors in Design",
            "Desc": "Design of human-machine environments, design to reduce human error. Analytical methods of determining user needs in systems with humans. Information processing and human sensory processes and consideration of these elements in the design of systems with humans. Human physical capabilities and consideration of these in ergonomic design.  [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 162",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE181",
            "Name": "Physics 1: Statics",
            "Desc": "Basic concepts of mechanics, vectors. Statics of particles. Rigid bodies and force systems, equilibrium of rigid bodies. Analysis of trusses and frames. Distributed forces, centroids and moments of inertia. Friction. Virtual work. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 181",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE182",
            "Name": "Physics 2: Dynamics",
            "Desc": "Kinematics of particles, rectilinear and curvilinear motion. Kinetics of particles, application to space mechanics. Energy and momentum methods. Systems of particles. Kinematics and kinetics of rigid bodies; planar motion. Vibrations. [Offered: F,W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Systems Design Engineering or 2A Mechatronics Engineering .",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 182",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE192",
            "Name": "Digital Systems",
            "Desc": "Digital technology, combinatorial logic, binary arithmetic, synchronous sequential circuits, design methodology, algorithmic state machines, microcomputer interfacing. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 292/393",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE192L",
            "Name": "Digital Systems Laboratory",
            "Desc": "Laboratory experiments for students taking SYDE 192.  [Offered:  S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 1B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 292L/393L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE201",
            "Name": "Seminar",
            "Desc": "Systems design second-year students will meet a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE202",
            "Name": "Seminar",
            "Desc": "Systems design second-year students will meet a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE211",
            "Name": "Calculus 3",
            "Desc": "Vector differential calculus: divergence and curl, line and surface integrals, fundamental theorems, applications. First order ordinary differential equations: analytical techniques and applications. Second order linear ordinary differential equations: systems of equations and applications. Numerical methods for solving ordinary differential equations (ODEs). [Offered: F,W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Designs Engineering or 2A Biomedical Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE212",
            "Name": "Probability and Statistics",
            "Desc": "Elementary probability theory. Random variables and distributions. Binomial, Poisson, and normal distributions. Elementary sampling. Statistical estimation. Tests of hypotheses and significance. Regression. Goodness-of-fit tests. Analysis of experimental measurements. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 213, CIVE 224, ECE 316, NE 115",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE223",
            "Name": "Data Structures and Algorithms",
            "Desc": "Algorithms and Data Structures emphasizes the following topics: structured software design, data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, problem-solving strategies and NP-completeness. [Offered: W,S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 1B Systems Design Engineering or Computer Engineering Option.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 122, CS 240/241E, ECE 250, MTE 140",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE252",
            "Name": "Linear Systems and Signals",
            "Desc": "Models and analysis of linear systems. Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response. Complex frequency, functions of complex variables, transform domain techniques: Z transforms; Fourier analysis, Laplace transform. Transfer functions and frequency response, frequency domain analysis of linear systems; sampling theory, stability, and linear filters. [Offered: F, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2B Systems Design Engineering or 2B Mechanical Engineering or 2B Mechatronics Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 252",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE261",
            "Name": "Design, Systems, and Society",
            "Desc": "This course will help students understand how others think about technology, and then use this knowledge to make better choices when designing. This impact course focuses on identifying, understanding, and analyzing the interactions and impacts among technology, society and the environment for current and emerging technologies using theoretical and evidence-based analyses. Connections among systems of systems engineering, impact analyses, evidence-based analyses, needs assessment, the design process, advocacy, and professional engineering will be discussed and applied. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE262",
            "Name": "Engineering Economics of Design",
            "Desc": "This course examines a variety of economic factors in Engineering and how they impact design. Topics include business plans, price and output decisions, choosing among alternative inputs, production processes, evaluating alternative investments, equipment service life and depreciation, new products. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 364, MSCI 261",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE263",
            "Name": "Engineering Prototyping",
            "Desc": "This course addresses the practical aspects of design and technical communication. By using a series of workshops culminating in a comprehensive final project, students gain the hands-on experience necessary for prototyping and design validation. Topics include generating technical specifications, material selection, fastener basics, motor selection, electronic switching, reading data sheets and schematics, and advanced microcontroller implementation. ",
            "Notes": "[Note: the lecture and laboratory components are offered alternate weeks. This course is graded as CR/NCR. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE283",
            "Name": "Physics 3: Electricity, Magnetism and Optics",
            "Desc": "Introduction to the fundamental laws of electricity, magnetism, and optics; electric fields, voltage, resistance, current, properties of conductors and semiconductors, capacitance, properties of dielectrics, magnetic fields, Faraday's Law and inductance, properties of magnetic materials; electromagnetic waves and the nature of light, geometrical optics; reflection and refraction, physical optics; interference and diffraction. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 386",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE285",
            "Name": "Materials Chemistry",
            "Desc": "The course will present how the fundamentals of chemistry are applied to materials science and engineering.  Concepts such as chemical bonding, crystal structure, phase diagram, redox reaction, and electrochemistry will be introduced in the context of materials science.  Properties, processing and structure of metals, semiconductors, polymers, ceramic, nanomaterials and biomaterials will be presented.  [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2A Systems Designs Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 282",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE286",
            "Name": "Mechanics of Deformable Solids",
            "Desc": "Introduction to mechanical response of materials and stress-strain relationship. Behaviour of prismatic members in tension, compression, shear, bending and torsion. Shear-force and bending-moment diagrams. Introduction to instability. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 2A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 281, CIVE 204, ME 219",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE292",
            "Name": "Circuits, Instrumentation, and Measurements",
            "Desc": "Active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition; step response of first and second order networks; sinusoidal steady state analysis using complex impedance phasors; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers, difference and instrumentation amplifiers, active filters, A/D and D/A conversion. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (2B Systems Design Engineering) or Mechatronics Option.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 392",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE292L",
            "Name": "Circuits, Instrumentation, and Measurements Laboratory",
            "Desc": "Laboratory experiments for students taking SYDE 292. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 2B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 392L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE301",
            "Name": "Seminar",
            "Desc": "Systems design third-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE302",
            "Name": "Seminar",
            "Desc": "Systems design third-year students will meet with a faculty member designated as their class professor. Performance in assignments, conceptual difficulties with courses, interrelation of coursework, later work and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE311",
            "Name": "Advanced Engineering Math 2",
            "Desc": "Series solutions of ordinary differential equations; Bessel functions, orthogonal functions, Fourier expansions and integral, Legendre polynomials, Sturm-Liouville systems. Partial differential equations; parabolic, hyperbolic and elliptic equations, numerical methods. Numerical integration; Gaussian quadrature, Runge-Kutta methods. Nonlinear systems; qualitative analysis, phase plane, Newton-Raphson method. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE312",
            "Name": "Applied Linear Algebra",
            "Desc": "Vector spaces, linear independence, linear maps and matrix representations. Inner product spaces and orthogonality.  Gramm-Schmidt algorithm and orthogonal projection. Interpolation and curve-fitting. Eigenvalues and eigenvectors, diagonalization, singular value decomposition. Applications and numerical methods. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE322",
            "Name": "Software Design",
            "Desc": "Software requirements specification; software architecture; design patterns; software testing and quality assurance; software maintenance; design of efficient algorithms and methods for their analysis, mathematical algorithms, string processing algorithms, geometrical algorithms, exhaustive search and traversal techniques, introduction to lower bound theory and NP-completeness.  Case studies and engineering examples. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BME 122 or CS 240/240E or ECE 250 or MTE 140 or SYDE 223; Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE334",
            "Name": "Applied Statistics",
            "Desc": "Review of basic Normal theory, t, chi-squared, and F distributions. Simple linear regression. Lack of fit. Analysis of variance. Multiple linear regression, variable selection techniques, indicator variables, diagnostics. Brief introduction to non-linear regression, factorial experimentation. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BME 213 or SYDE 212 (with minimum grade of 70%); Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: STAT 331, 371.",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE351",
            "Name": "Systems Models 1",
            "Desc": "Introduction to systems modelling and analysis. Graph theoretic models and formulation of system equations. State space formulation and solution. Time and frequency domain solutions. Application to engineering systems. [Offered: W, S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Systems Design Engineering or (MATH 115 and MTE 202 and level at least 3A Mechatronics Engineering)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE352",
            "Name": "Introduction to Control Systems",
            "Desc": "Classical and state space representations of control systems. Stability, controllability, observability and sensitivity. Routh-Hurwitz and root-locus methods. Frequency domain behaviour, Bode plots, Nyquist stability criteria. Pole placement, PID, phase-lead and phase-lag controllers.(labs alt. weeks) [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 353",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE352L",
            "Name": "Control Systems Laboratory",
            "Desc": "Laboratory experiments for students taking SYDE 352.  [Offered:  W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 353L",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE361",
            "Name": "Systems Design Methods 1: Needs Analysis and Prototyping",
            "Desc": "The methodology of design, situation of concern; needs analysis and problem definition, engineering analysis and generation of alternative solutions, design prototyping, and design documentation. The lecture material is supplemented by a term-long design project done in small groups that develops hands-on experience with electromechanical prototyping. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 361",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE362",
            "Name": "Systems Design Methods 2: Testing, Verification, and Validation",
            "Desc": "Engineering design project course where students work in small groups applying the principles of engineering problem solving and design, with a focus on testing and design evaluation, and an introduction to benchmark testing and applied design optimization. Student projects will provide hands-on experience with design verification, validation, and performance measurement and analysis using engineering tools. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 362",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE381",
            "Name": "Thermodynamics",
            "Desc": "An introductory course in engineering thermodynamics structured for students in Systems Design. Classical thermodynamics is presented as the systematic study of energy; its use, degradation, and waste. Introduction to heat transfer by conduction, convection, and radiation. Applications focus on problems of energy and environment. The concepts of statistical thermodynamics are introduced. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 3A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 384, MTE 309, ME 250",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE383",
            "Name": "Fluid Mechanics",
            "Desc": "Fundamental concepts in systems involving fluid flow. Basic treatment of statics, kinematics and dynamics of fluids. Conservation of mass, momentum and energy for a control volume. Dimensional analysis and similarity. Flow in pipes and channels. Brief introduction to boundary layers, lift and drag, ideal and compressible flow. [Offered: S]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 384, ME 351",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE401",
            "Name": "Seminar",
            "Desc": "Systems design fourth-year students will meet with a faculty member designated as their class professor. Conceptual difficulties, the interrelation of course work and engineering practice will be discussed. Non-credit course. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE402",
            "Name": "Seminar",
            "Desc": "Systems design fourth-year students will meet with a faculty member designated as their class professor. Conceptual difficulties, the interrelation of course work and engineering practice will be discussed. Non-credit course. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE411",
            "Name": "Optimization and Numerical Methods",
            "Desc": "Root-finding methods. Linear programming, simplex and interior-point methods. Local and global optimization methods. Constrained optimization. Multiobjective and multidisciplinary design optimization.[Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 411",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE461",
            "Name": "Systems Design Capstone Project 1",
            "Desc": "The first half of a two-term engineering design project continuing the systems design project sequence. Students work in small groups applying the principles of systems design engineering to a situation of concern of their own choosing. Students have individual project supervisors as well as an overall co-ordinator who provides the framework for the term assessments. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4A Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 461",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE462",
            "Name": "Systems Design Capstone Project 2",
            "Desc": "The second half of a two-term engineering design project continuing the systems design project sequence. Students work in small groups applying the principles of systems design engineering to a situation of concern of their own choosing. Students have individual project supervisors as well as an overall co-ordinator who provides the framework for the term assessments. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: 4B Systems Design Engineering.",
            "Coreqs": "None",
            "Antireqs": " Antireq: BME 462",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE522",
            "Name": "Foundations of Artificial Intelligence",
            "Desc": "The objective of this course is to introduce students to fundamental concepts of Artificial Intelligence. An overview of different learning schemes will be provided, including supervised and unsupervised algorithms. The focus of this course will be on dimensionality reduction, clustering, classification, deep and shallow artificial neural networks, and reinforcement learning. Ethical aspects of artificial intelligence will be discussed. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BME 122, CS 240/240E, ECE 250, MSCI 240, MTE 140, SYDE 223 and Biomedical Engineering or SYDE or level at least 4A Management Engineering or Mechatronics Eng or Mechatronics Option or Computer Eng Option.",
            "Coreqs": "None",
            "Antireqs": " Antireq:CS 480,486, ECE 457A,457B",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE531",
            "Name": "Design Optimization Under Probabilistic Uncertainty",
            "Desc": "Optimization methods for real world problems have to deal with probabilistic uncertainty either due to data uncertainty or manufacturing uncertainty or both. Maximizing the expected value of the objective function subject to reliability (or risk) constraints is commonly used in such design or decision-making problems. Common methods used are stochastic programming, stochastic dynamic programming, chance-constraints, yield optimization and tolerance design. Example applications are selected from water management, energy systems, financial engineering, and manufacturing. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE532",
            "Name": "Introduction to Complex Systems",
            "Desc": "The overwhelming majority of societal and ecological issues of pressing importance are complex systems; nonlinear interacting systems poorly characterized by linear analyses and Gaussian statistics. This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems, power-law distributions, and statistical inference. The mathematical methods will be motivated by a set of case studies comprised of pressing large-scale interconnected problems such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect the mathematical analyses to real-world examples. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE533",
            "Name": "Conflict Resolution",
            "Desc": "Formal methods for studying engineering decision-making problems involving multiple participants and multiple objectives. Topics include the graph model for conflict resolution, normal game form, metagame analysis, games with misperceptions, preference elicitation, human behaviour under conflict, evolution of a conflict, decision-making under uncertainty, sensitivity analyses, multiple criteria decision analysis, group decision and negotiation, coalition analysis, decision support systems, and real-world applications of the foregoing concepts.  [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "None",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE542",
            "Name": "Interface Design",
            "Desc": "This course focuses on the design of computer interfaces for simple to complex systems. Examples of applications are used to illustrate theoretical approaches. Main topics include forms of visual display; auditory display and soft controls; context, navigation, and layout; development techniques; design for engagement. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BME 162, MSCI 343, SYDE 162, 348/548, 543; Biomedical Engineering or Systems Design Engineering or (level at least 4A Management Engineering or 4A Mechatronics Engineering) or Ergonomics and Injury Prevention Minor",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE543",
            "Name": "Cognitive Ergonomics",
            "Desc": "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks. Main topics include signal detection and target location tasks, navigation tasks, training tasks, communication tasks, human error, stress and mental workload, supervisory control, and situational awareness. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: Biomedical Engineering or Systems Design Engineering or (Level at least 4A Mechatronics Engineering) or Biomechanics Option or Ergonomics and Injury Prevention Minor",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE544",
            "Name": "Biomedical Measurement and Signal Processing",
            "Desc": "This course develops an understanding of biomedical measurements through the examination of electromyographic (EMG), electroencephalographic (EEG), and electrocardiographic (ECG) signals. Measurement of human-body position, force, and pressure, and related instrumentation will also be presented. Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: One of BIOL 273, BME 284, SYDE 384/584; Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering or Level at least 3B Honours Life Physics (Biophysics Specialization)",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE548",
            "Name": "User Centred Design Methods",
            "Desc": "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective. Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process. While design issues pertaining to human-computer interaction are discussed, the methods presented can be applied to the design of almost any user interface. Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (Level at least 3A Biomedical Engineering) or (Level at least 3B Systems Design Engineering) or (Level at least 4A Mechatronics Engineering or Biomechanics Option or Ergonomics and Injury Prevention Minor).",
            "Coreqs": "None",
            "Antireqs": " Antireq: CS 449, MSCI 343",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE552",
            "Name": "Computational Neuroscience",
            "Desc": "Introduction to modelling and analysis of neurophysiological systems. Models of synaptic plasticity and learning, with focus on the similarities and differences between neuroscience and deep learning. ",
            "Notes": "[Note: For systems design engineering students: It is recommended that one of BIOL 273, 376, 377 or BME 284 or SYDE 384/584 be taken before or concurrently with SYDE 552. Offered: W]",
            "Consent": "None",
            "Prereqs": "Prereq: Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE553",
            "Name": "Advanced Dynamics",
            "Desc": "Newtonian and Eulerian formulation of particle and rigid body kinematics and dynamics.  Energy (Lagrangian and Hamiltonian) formulations of particle and rigid body dynamics; generalized co-ordinates, generalized forces, holonomic constraints, Lagrange multipliers. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (Level at least 3A Biomedical Engineering) or (Level at least 3B Systems Design Engineering) or (Level at least 4A Mechatronics Engineering) or Mechatronics Option or Biomechanics Option",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE556",
            "Name": "Simulating Neurobiological Systems",
            "Desc": "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience. Particular emphasis is placed on understanding representation, nonlinear computation, and dynamics in real neurobiological systems. Students will apply signal processing, control theory, linear algebra, probability theory, and similar quantitative tools for the purpose of modelling sensory, motor, and cognitive systems. Topics covered include single neuron function, neural coding, neural dynamics, attractor networks, learning, statistical inference, locomotion, working memory, etc. Familiarity with neural systems is helpful but not essential. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BME 252 or SYDE 252",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE572",
            "Name": "Introduction to Pattern Recognition",
            "Desc": "Pattern recognition as a process of data analysis. Pattern features as components in a random vector representation. Classification techniques; distance measures in feature space, probabilistic (Bayesian) decision theory, linear discriminants. Clustering and feature extraction. Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors. [Offered: W]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (Level at least 3A Biomedical Engineering) or (Level at least 3B Systems Design Engineering) or (Level at least 4A Mechatronics Engineering) or Mechatronics Option or Biomechanics Option",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE575",
            "Name": "Image Processing",
            "Desc": "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing. Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed. The key methods and problems are surveyed; edge detection, image denoising, image segmentation, image enhancement, image compression, image registration, and feature detection. Applications to machine vision, remote sensing, and medical imaging will be emphasized. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: BME 252 or SYDE 252; (Level at least 3A Biomedical Engineering) or (Level at least 3B Systems Design Engineering) or (Level at least 4A Mechatronics Engineering) or Mechatronics Option or Biomechanics Option",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE584",
            "Name": "Physiological Systems and Biomedical Design",
            "Desc": "In this course, students will become familiar with the physiology and anatomical structures of the human body. The structure, functions, and properties of major physiological systems (e.g., musculoskeletal, nervous, cardiovascular, and respiratory) will be presented in relation to modelling physiological systems and the design of biomedical devices (imaging, assistive, and diagnostic). Various aspects of pathology and how they influence measurements will also be introduced. [Offered: F]",
            "Notes": "None",
            "Consent": "None",
            "Prereqs": "Prereq: (Level at least 3B Engineering) or (Level at least 3B Honours Life Physics (Biophysics specialization)).",
            "Coreqs": "None",
            "Antireqs": " Antireq: BIOL 273, BME 284",
            "crosslisted": "None",
            "online": false
        },
        {
            "courseCode": "SYDE599",
            "Name": "Special Topics in Systems Design Engineering",
            "Desc": "This course deals with selected topics at the undergraduate level in environmental and societal systems, mechatronics and physical systems, or human factors and ergonomics. ",
            "Notes": "[Note: For a current list of offerings, see the associate chair of undergraduate studies. Offered: F,W]",
            "Consent": "Department Consent Required",
            "Prereqs": "Prereq: Level at least 3A Engineering students",
            "Coreqs": "None",
            "Antireqs": "None",
            "crosslisted": "None",
            "online": false
        }
    ]
}